Repository: wingware-dev/wing7-po-all
Catalog: PO/*/scripts_editor_extensions.po
Languages: fr

source: Delete the line or range of lines that contain the current selection. This duplicates what the editor command delete-line does.
fr: Supprimer la ligne ou la plage de lignes qui contient la sélection courante. Cela duplique ce que la commande d'éditeur delete-line fait.

source: Toggle block comment (with ## at start) on the selected lines in editor. This is a different style of block commenting than Wing implements by default (the default in Wing is intended to work better with some of the other editor functionality)
fr: Basculer un bloc en commentaire (avec ## au début) sur les lignes sélectionnées dans l'éditeur. C'est un style différent de commentaires de bloc que Wing implémente par défaut (par défaut Wing est prévu de mieux fonctionner avec d'autres fonctionnalités de l'éditeur)

source: Bring cursor to start of line, to start of visible area, or to start of document each successive consecutive invocation of this command.
fr: Apporter le curseur au début de la ligne, au début de la zone visible, ou au début du document à chaque invocation consécutive successive de cette commande.

source: Bring cursor to end of line, to end of visible area, or to end of document each successive consecutive invocation of this command.
fr: Apporter le curseur à la fin de la ligne, à la fin de la zone visible, ou à la fin du document à chaque invocation consécutive successive de cette commande.

source: Change current selection or current word to all lower case
fr: Modifier toute la sélection actuelle ou le mot actuel en minuscule

source: Change current selection or current word to all upper case
fr: Modifier toute la sélection actuelle ou le mot actuel en majuscule

source: Change current selection or current word to capitalize first letter of each word
fr: Modifier la sélection actuelle ou le mot actuel en passant en majuscule la première lettre de chaque mot

source: A better version of string.capwords
fr: Une meilleure version de string.capwords

source: Toggle current selection or current word between common name formats: my_symbol_name, MySymbolName, and mySymbolName
fr: Basculer la sélection actuelle ou le mot actuel entre les formats de noms communs: my_symbol_name, MySymbolName et mySymbolName

source: Sort selected lines of text alphabetically
fr: Trier alphabétiquement les lignes de texte sélectionnées

source: Copy the filename for the currently selected file to the clipboard
fr: Copier le nom de fichier pour le fichier sélectionné actuellement dans le presse-papier

source: Paste from clipboard after removing any >>> and ... prompts
fr: Coller depuis le presse-papier après avoir enlevé toutes les invites >>> et ...

source: Modified tab indentation command that acts like tab in Visual Studio.
fr: Commande d'indentation des tabulations modifiée agissant comme les tabulations dans Visual Studio.

source: Convert the current editor to use CR + LF style line endings
fr: Convertir l'éditeur courant à utiliser des fins de ligne de type CR + LF

source: Convert the current editor to use CR style line endings
fr: Convertir l'éditeur courant à utiliser des fins de ligne de type CR

source: Convert the current editor to use LF style line endings
fr: Convertir l'éditeur courant à utiliser des fins de ligne de type LF

source: Fold up all Python methods, expand all classes, and leave other fold points alone
fr: Replier toutes les méthodes Python, développer toutes les classes, et laisser les autres points de repliement seuls

source: Fold up all Python classes but leave other fold points alone
fr: Replier toutes les classes Python mais laisser les autres points de repliement seuls

source: Fold up all Python classes, methods, and functions but leave other fold points alone
fr: Replier toutes les classes, méthodes et fonctions Python mais laisser les autres points de repliement seuls

source: Approximation of zr key binding in vim
fr: Approximation du raccourci clavier zr dans vim

source: Approximation of zm key binding in vim
fr: Approximation du raccourci clavier zm dans vim

source: Insert a print statement to print a selected variable name and value, along with the file and line number.
fr: Insérer une instruction d’impression pour imprimer un nom de variable sélectionnés et leurs valeurs, ainsi que le fichier et le numéro de ligne.

source: Do a search on the Python documentation for the selected text in the current editor
fr: Réalise une recherche dans la documentation Python pour le texte sélectionné dans l'éditeur courant

source: Add a debug watch for the selected text in the current editor
fr: Ajouter une surveillance de débogage pour le texte sélectionné dans l'éditeur de texte actuel

source: If editor is split, unsplit it and show the vertical tools panel. Otherwise, hide the vertical tools and split the editor left-right Assumes default windowing policy (combined toolbox & editor windows). Thanks to Jonathan March for this script.
fr: Si l'éditeur est divisé, dé-divisé le et affiche le panneau vertical d'outils. Autrement, cacher les outils verticaux et divisez l'éditeur gauche-droite Assume la politique de fenêtrage par défaut (Boîte à outils & fenêtres d'éditeur). Merci à Jonathan March pour ce script.

source: Toggle between moving the toolboxes to a separate window and the default single-window mode
fr: Basculer entre déplacer les boites à outils vers une fenêtre séparée et le mode part défaut simple-fenêtre

source: Insert spaces to reach the next tab stop (units of given tab size or editor's tab size if none is given)
fr: Insérer des espaces pour atteindre l'arrêt suivant de tabulation (unités de taille de tabulation données ou la taille de tabulation de l'édietuer est none si donné)

source: Insert given text at current caret location, replacing any existing selected text
fr: Insérer le texte donné à l'emplacement actuel du curseur, remplacant tout texte sélectionné existant

source: Enter a newline, indent to match previous line and insert a comment character and a space. Assumes that auto-indent is enabled.
fr: Entrer une nouvelle ligne, l'indent correspondant à la ligne précédente et insérer un caractère de commentaire et un espace. En admettant que l'indentation automatique est activée.

source: Provide simple word-list driven auto-completion on the current editor
fr: Fournir une liste de mots simple entrainant l'auto-complétion dans l'éditeur actuel

source: Word
fr: Mot

source: Word:
fr: Mot :

source: Display the commands that a key is bound to in the status area. Does not fully work for the vi binding.
fr: Afficher les commandes auxquelles une touche est liée dans la zone de statuts. Ne fonctionne pas entièrement pour les raccourcis clavier vi.

source: is not bound
fr: n’est pas est lié

source: is bound to
fr: est lié à

source: Key
fr: Touche

source: Press Key(s) then Enter
fr: Appuyer sur une (des) touche(s) puis Entrée

source: Copy 'filename, lineno (scope)' optionally followed by the current line or selected lines to the clipboard. The scope is omitted if there isn't one or in a non-Python file.
fr: Copier ‘filename, lineno (portée)’, optionellement suivi par la ligne actuelle ou les lignes sélectionnées dans le presse papier. La portée est omise si il n’y a pas un seul ou dans un fichier non-Python.

source: Implement a variant of clipboard copy that copies the whole current line if there is no selection on the editor.
fr: Implémente une variante de la copie du presse-papier qui copie la ligne actuelle entière si il n'y a pas de sélection dans l'éditeur.

source: Implement a variant of clipboard cut that cuts the whole current line if there is no selection on the editor.
fr: Implémente une variante de la coupe du presse-papier qui coupe la ligne actuelle entière si il n'y a pas de sélection dans l'éditeur.

source: A variant of paste that inserts line just copied with smart-copy above current line.
fr: Une variante de collet qui insère une ligne juste copiée avec la copie-intelligente au-dessus de la ligne actuelle.

source: Open the url at caret in the current editor
fr: Ouvrir l’url au curseur dans l’éditeur actuel

source: Open the url being clicked in the current editor
fr: Ouvrir l’url qui est cliquée dans l’éditeur actuel

source: Open the filename at the caret in current editor
fr: Ouvrir le nom de fichier au curseur dans l’éditeur actuel

source: Open the filename being clicked in the current editor
fr: Ouvrir le nom de fichier qui est cliqué dans l’éditeur actuel

source: Close all readonly files
fr: Fermer tous les fichiers en lecture seule
