Repository: wingware-dev/wing7-po-all
Catalog: PO/*/scripts_pylintpanel.po
Languages: fr

source: Errors
fr: Erreurs

source: Errors that must be fixed
fr: Erreurs qui doivent être réparées

source: Warnings
fr: Avertissements

source: Warnings that could indicate problems
fr: Avertissements qui pourraient indiquer des problèmes

source: General informative messages
fr: Messages d'information générale

source: Get configuration option from configuration file
fr: Obtenir les options de configuration du fichier de configuration

source: Get full name and path of config file
fr: Obtenir le nom et chemin complet du fichier de configuration

source: Show the pylint configuration file so it can be edited
fr: Afficher le fichier de configuration pylint afin qu'il puisse être édité

source: Copies all results from the displayed pylint results list.
fr: Copie tous les résultats depuis la liste de résultats pylint affichée.

source: Line
fr: Ligne

source: Column
fr: Colonne

source: Copy the selected pylint results to the clipboard.
fr: Copier les résultats pylint sélectionnés dans le presse papier.

source: Copy the line number for the currently selected pylint result.
fr: Copier le numéro de ligne pour le résultat pylint en cours sélectionné.

source: Copy the currently selected pylint result message.
fr: Copier le message de résultat pylint sélectionné.

source: Execute pylint for the current editor
fr: Exécuter pylint pour l'éditeur courant

source: Execute pylint on all files in the package to which the file in the current editor belongs
fr: Exécute pylint sur tous les fichiers dans le paquet dont le fichier dans l'éditeur courant appartient.

source: Show the Wing documentation section for the PyLint integration
fr: Afficher la section de la documentation de Wing pour l'intégration de PyLint

source: PyLint panel configuration file not found. Choose "Configure" from the context menu to edit the configuration file. You will need to install pylint separately.
fr: Fichier de configuration du panneau PyLing non trouvé. Choisir "Configure" depuis le menu contextuel pour éditer le fichier de configuration. Vous aurez besoin d'installer pylint séparément.

source: Error
fr: Erreur

source: Invalid values specified in configuration file
fr: Valeurs invalides spécifiées dans le fichier de configuration

source: Updating for package %s
fr: En cours de mise à jour du paquet %s

source: Updating for %s
fr: En cours de mise à jour pour %s

source: Updating for %i items
fr: En cours de mise à jour pour %i éléments

source: Error executing PyLint: Command failed with error=%s, status=%s; stderr: %s
fr: Erreur exécutant PyLint : Commande échouée avec l'erreur=%s, statuts=%s ; stderr : %s

source: PyLint Failed
fr: PyLint a échoué

source: PyLint Timed Out
fr: PyLint temps dépassé

source: PyLint timed out: Command did not complete within timeout of %i seconds. Right click on the PyLint tool to configure this value. Output from PyLint: %s
fr: PyLint temps dépassé : la commande n'a pas été accomplie dans le temps dépassé de %i secondes. Clic droit sur l'outil PyLint pour configurer cette valeur. Sortie depuis PyLint : %s

source: Panel definition for the project manager
fr: Définition des panneaux pour le gestionnaire de projet

source: Get (label, prefix, suffix) for the display label to use for the given panel instance
fr: Obtenir (labell, prefix, suffix) pour l’affichage du label à utiliser pour l’instance de panneau donnée

source: Get full title for the given panel instance
fr: Obtenir le titre complet pour l'instance de panneau donnée

source: PyLint Panel
fr: Panneau PyLint

source: Constructor
fr: Constructeur

source: Returns the title of this view suitable for display.
fr: Retourne le titre de cette vue approprié pour l'affichage.

source: Get the command map object for this view.
fr: Obtenir l'objet de carte de commande pour cette vue.

source: Full Path
fr: Chemin complet

source: Line Number
fr: Numéro de ligne

source: Construct popup menu for this object.
fr: Construire un menu popup pour cet objet.

source: Update
fr: Mise à jour

source: Update for Package
fr: Mise à jour du paquet

source: Update for %s
fr: Mise à jour pour %s

source: Update for Package %s
fr: Mise à jour du paquet %s

source: Copy All Info Messages
fr: Copier tous les Messages d'Info

source: Copy All Warnings
fr: Copier tous les avertissements

source: Copy All Errors
fr: Copier toutes les erreurs

source: Copy Selected Results
fr: Copier les résultats sélectionnés

source: Copy Selected Line Number
fr: Copier le numéro de ligne sélectionné

source: Copy Selected Message
fr: Copier le Message sélectionné

source: Configure...
fr: Configurer...

source: Show PyLint Tool Documentation
fr: Afficher la documentation de l'outil PyLint
