Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_diff_commands.po
Languages: fr, ru

source: These commands act on the diff/merge manager or on the current project, regardless of keyboard focus.
fr: Ces commandes agissent sur le gestionnaire de diff/fusion ou sur le projet actuel, sans tenir compte du focus du clavier.
ru: Эти команды действуют в диспетчере "Различий/Слияний" или в текущем проекте, независимо от фокуса клавиатуры.

source: Start a diff/merge session with the given two files. Orientation should be 'h' or 'v' for horizontal or vertical side by side comparison, or None to use the Editor / Diff/Merge / Orientation preference
fr: Démarrer une session diff/fusion avec les deux fichiers donnés. L'orientation doit être 'h' ou 'v' pour une comparaison côte a côte horizontale ou verticale, ou None pour utiliser la préférence d'orientation de l'éditeur / Diff/fusion
ru: Запустите сеанс diff/merge с заданными двумя файлами. Ориентация должна быть "h" или "v" для горизонтального или вертикального сравнения бок о бок, или None, чтобы использовать предпочтения Редактор/ Различия/Слияние /Ориентация

source: File A
fr: Fichier A
ru: Файл A

source: File A:
fr: Fichier A :
ru: Файл A:

source: File B
fr: Fichier B
ru: Файл B

source: File B:
fr: Fichier B :
ru: Файл B:

source: Compare Files
fr: Comparer les fichiers
ru: Сравнить файлы

source: Start a diff/merge session with the given two directories. Orientation should be 'h' or 'v' for horizontal or vertical side by side comparison, or None to use the Editor / Diff/Merge / Orientation preference
fr: Démarrer une session diff/fusion avec les deux répertoires donnés. L'orientation doit être 'h' ou 'v' pour une comparaison côte a côte horizontale ou verticale, ou None pour utiliser la préférence d'orientation de l'éditeur / Diff/fusion
ru: Запустите сеанс diff/merge с заданными двумя каталогами. Ориентация должна быть "h" или "v" для горизонтального или вертикального сравнения бок о бок, или нет, чтобы использовать предпочтения редактора / различия / слияния / ориентации

source: Cannot compare remote directories
fr: Ne peut pas comparer les répertoires distants
ru: Не удается сравнить удаленные каталоги

source: Comparing remote directories is not yet supported. Please email support@wingware.com if you need this feature.
fr: Comparer les répertoires distants n'est pas encore supporté. Merci d'envoyer un email à support@wingware.com si vous avez besoin de cette fonctionnalité.
ru: Сравнение удаленных каталогов пока не поддерживается. Если вам нужна эта функция, напишите по адресу support@wingware.com.

source: Directory A
fr: Répertoire A
ru: Каталог A

source: Directory A:
fr: Répertoire A :
ru: Каталог A:

source: Directory B
fr: Répertoire B
ru: Каталог B

source: Directory B:
fr: Répertoire B :
ru: Каталог B:

source: Compare Directories
fr: Comparer des répertoires
ru: Сравнить каталоги

source: Start a diff/merge session between the current editor's unsaved contents and the contents of its file on disk. Orientation should be 'h' or 'v' for horizontal or vertical side by side comparison, or None to use the Editor / Diff/Merge / Orientation preference
fr: Démarrer une session diff/fusion entre le contenu de l'éditeur actuel non sauvegardé et le contenu de ce fichier sur le disque. L'orientation doit être 'h' ou 'v' pour une comparaison côte a côte horizontale ou verticale, ou None pour utiliser la préférence d'orientation de l'éditeur / Diff/Fusion
ru: Запустите сеанс сравнения/слияния между несохраненным содержимым текущего редактора и содержимым его файла на диске. Ориентация должна быть "h" или "v" для горизонтального или вертикального сравнения бок о бок, или None , чтобы использовать предпочтения редактора / различия / слияния / ориентации

source: Compare Buffer to Disk
fr: Comparer la mémoire tampon avec le disque
ru: Сравнить буфер с диском

source: Start a diff/merge session with the first/top-most two visible files.
fr: Démarrer une session diff/fusion avec les deux premiers/plus visibles fichiers.
ru: Запустите сеанс Сравнения/Слияния с первыми/самыми верхними двумя видимыми файлами.

source: Start a diff/merge session between the file or directory currently selected in the GUI and the corresponding revision in version control. Orientation should be 'h' or 'v' for horizontal or vertical side by side comparison, or None to use the Editor / Diff/Merge / Orientation preference
fr: Démarrer une session diff/fusion entre le fichier ou le répertoire actuellement sélectionné dans l'interface graphique utilisateur et la révision correspondante dans le contrôle de version. L'orientation doit être 'h' ou 'v' pour une comparaison côte a côte horizontale ou verticale, ou None pour utiliser la préférence d'orientation de l'éditeur / Diff/fusion
ru: Запустите сеанс Сравнения/Слияния между файлом или каталогом, выбранным в GUI, и соответствующей редакцией В системе управления версиями. Ориентация должна быть "h" или "v" для горизонтального или вертикального сравнения бок о бок, или None , чтобы использовать предпочтения Редактор/ различие / слияние / ориентация

source: Compare to Repository
fr: Comparer au dépôt
ru: Сравнить с Репозиторием

source: Move to next difference in current diff/merge session
fr: Se déplacer vers la différence suivante dans la session diff/fusion actuelle
ru: Перейти к следующему отличию в текущем сеансе diff / merge

source: Move to previous difference in current diff/merge session
fr: Se déplacer vers la différence précédente dans la session diff/fusion actuelle
ru: Перейти к предыдущему отличию в текущем сеансе diff / merge

source: Cancel the current diff/merge session
fr: Annuler la session actuelle de diff/fusion
ru: Отмена текущего сеанса сравнения / слияния

source: Merge the current change from file A to file B
fr: Fusionner la modification actuelle du fichier A au fichier B
ru: Слияние изменений из файла A в файл B

source: Merge the current change from file B to file A
fr: Fusionner la modification actuelle du fichier B au fichier A
ru: Слияние изменений из файла B в файл A

source: Lock or unlock scrolling when diff/merge is active. Toggles the state by default or set lock=True or lock=False to set a particular state.
fr: Verrouiller ou déverrouiller le défilement lorsque diff/fusion est actif. Bascule l'état par défaut ou affecte lock=True ou lock=False pour affecter un état particulier.
ru: Блокировать или разблокировать прокрутку, когда diff/merge активен. Переключает состояние по умолчанию или set lock=True или lock=False, чтобы установить определенное состояние.

source: Determine whether to ignore white space in differences. Toggles the state by default or set ignore=True or ignore=False to set a particular state.
fr: Détermine d'ignorer, ou non, les espaces blancs dans les différences. Bascule l'état par défaut ou affecter ignore=True ou ignore=False pour affecter une état particulier.
ru: Определите, следует ли игнорировать пробелы в различиях. Переключение состояния по умолчанию или установка ignore = True или ignore = False для установки определенного состояния.

source: Returns list of menu items for selecting recent diff/merge sessions
fr: Retourne la liste des éléments du menu pour sélectionner les sessions de diff/fusion récentes
ru: Возвращает список пунктов меню для выбора последних сеансов diff / merge

source: Returns list of menu items for selecting among active diff/merge sessions
fr: Retourne la liste des éléments du menu pour sélectionner parmi les sessions actives de diff/fusion
ru: Возвращает список пунктов меню для выбора между активными сеансами diff / merge
