Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_guimgr.po
Languages: fr

source: Select style of toolbar icons to use. By default, adjusts according to available space.
fr: Sélectionner le style d'icônes de la barre d'outils à utiliser. Par défaut, il s'ajuste selon la place disponible.

source: Primary color for icons
fr: Couleur primaire pour les icônes

source: Secondary color for icons
fr: Couleur secondaire pour les icônes

source: Tertiary color for icons
fr: Couleur tertiaire pour les icônes

source: Quaternary color for icons
fr: Couleur quaternaire pour les icônes

source: Quinary color for icons
fr: Couleur quinaire pour les icônes

source: Senary color for icons
fr: Couleur sénaire pour les icônes

source: Controls whether or not tooltips containing help are shown when the mouse hovers over areas of the user interface.
fr: Contrôle si les bulles d'aide sont affichées, ou non, lorsque la souris passe sur des zones de l'interface utilisateur.

source: The base font and size to use for the user interface's menus and labels
fr: La police et taille de base à utiliser pour les menus et les labels de l'interface utilisateur

source: Use Default
fr: Utiliser par défaut

source: Use Selected Font/Size:
fr: Utiliser la police/taille sélectionnée :

source: Controls whether the color palette is used throughout the user interface
fr: Contrôle si la palette de couleur est utilisée pour toute l’interface utilisateur

source: Controls whether project files are opened as project or as text when opened from the File menu. This does not affect opening from the Project menu.
fr: Contrôle si les fichiers de projet sont ouverts comme projet ou comme texte lorsqu'ils sont ouverts depuis le menu Fichier. Cela n'affecte pas l'ouverture depuis le menu Projet.

source: Maximum number of items to display in the Recent menus.
fr: Nombre maximum d'éléments à afficher dans les menus Récent.

source: Base Name Only
fr: Nom de base uniquement

source: Prepend Relative Path
fr: Ajouter le chemin relatif au début

source: Append Relative Path
fr: Ajouter le chemin relatif

source: Prepend Full Path
fr: Ajouter le chemin complet au début

source: Append Full Path
fr: Ajouter le chemin complet

source: Maximum size of files that Wing will try to open, in MB.
fr: Taille maximum des fichiers que Wing essaiera d'ouvrir, en MB.

source: Enable to always show the full path of a file name in the tooltips shown from the editor tabs and file selection menus. When disabled, the configured Source Title Style is used instead.
fr: Activer pour toujours afficher le chemin complet d'un nom de fichier dans les bulles d'aide affichées depuis les onglets de l'éditeur et les menus de sélection de fichier. Si désactivé, le style de titre de source est utilisé à la place.

source: Posix only: The commands used to display or edit local disk files selected from the Help menu or project files selected for external display. This is a map from mime type to a list of display commands; each display command is tried in order of the list until one works. The mime type "*" can be used to set a generic viewer, such as a web browser. Use %s to place the file name on the command lines. If unspecified then Wing will use the configured URL viewer in the environment (specified by BROWSER environment variable or by searching the path for common browsers). On Windows, the default viewer for the file type is used instead so this preference is ignored. On OS X, files are opened with "open" by default so this preference is rarely needed.
fr: Posix uniquement : les commandes utilisées pour afficher ou éditer des fichiers du disque sélectionnés depuis le menu d’aide ou des fichiers projet sélectionnés pour un affichage externe. C'est une correspondance du type mime à une liste de commandes d'affichage ; chaque commande d'affichage est essayée dans l'ordre de la liste jusqu'à ce qu'une fonctionne. Le type mime "*" peut être utilisé pour générer un visionneur générique, comme un explorateur web. Utiliser %s pour placer le nom de fichier dans les lignes de commande. Si non-spécifié alors Wing utilisera le visionneur configuré d'URL dans l'environnement (spécifié par la variable d'environnement BROWSER ou en cherchant le chemin pour des explorateurs communs). Sur Windows, le visionneur par défaut pour le type de fichier est utilisé et donc cette préférence est ignorée. Sur OS X, les fichiers sont ouverts avec « open » par défaut donc cette préférence est rarement nécessaire.

source: Mime Type
fr: Type Mime

source: Display Commands
fr: Commandes d'affichage

source: Posix only: The commands used to display URLs. This is a map from protocol type to a list of display commands; each display command is tried in order of the list until one works. The protocol "*" can be used to set a generic viewer, such as a multi-protocol web browser. Use %s to place the URL on the command lines. If unspecified then Wing will use the configured URL viewer in the environment (specified by BROWSER environment variable or by searching the path for common browsers). On Windows, the default web browser is used instead so this preference is ignored. On OS X, URLs are opened with "open" by default so this preference is rarely needed.
fr: Posix uniquement : les commandes utilisées pour afficher des URLs. C'est une correspondance du type de protocole à une liste de commandes d'affichage ; chaque commande d'affichage est essayée dans l'ordre de la liste jusqu'à ce qu'une fonctionne. Le protocole "*" peut être utilisé pour générer un visionneur générique, comme un explorateur web multi-protocoles. Utiliser %s pour placer l'URL dans les lignes de commande. Si non-spécifié alors Wing utilisera le visionneur configuré d'URL dans l'environnement (spécifié par la variable d'environnement BROWSER ou en cherchant le chemin pour des explorateurs communs). Sur Windows, le navigateur web par défaut est utilisé par défaut et donc cette préférence est ignorée. Sur OS X, les URLs sont ouvertes avec « open » par défaut donc cette préférence est rarement nécessaire.

source: Protocol
fr: Protocole

source: Controls whether or not all edited files are saved without asking before a debug run, before starting unit tests, or before a file or build process is executed.
fr: Contrôle si oui ou non tous les fichiers édités sont sauvegardés sans confirmation avant le lancement d'un débogage, avant de démarrer des tests unitaires, ou avant qu'un processus de fichier ou de construction soit exécuté.

source: Controls whether or not Wing ignores files that were not saved before starting debug or that have changed since they were loaded by the debug process. Wing normally will warn of unsynchronized files since breakpoints may not be reached and stepping through the files may not work properly if lines have moved. Checking this option turns off these warnings.
fr: Contrôle si Wing ignore ou non les fichiers qui ne sont pas sauvegardés avant de commencer le débogage ou qui ont changés depuis qu'ils avaient été chargés par le process de débogage. Wing avertit normalement que les fichiers non synchronisés depuis les points d'arrêt pourraient ne pas être atteint et avancer pas à pas à travers les fichiers pourrait ne pas fonctionner proprement si des lignes ont bougé. Valider cette option désactive ces avertissements.

source: The color used to indicate the current text selection on editable text.
fr: La couleur à utiliser pour indiquer la sélection de texte actuelle sur le texte éditable.

source: Controls whether or not the Wing Tips tool is shown automatically at startup of the IDE.
fr: Contrôle si oui ou non l'outil de Conseils Wing est montré automatiquement au démarrage de l'IDE.

source: Controls whether or not Wing shows tabs for switching between editors. When false, a popup menu is used instead.
fr: Contrôle si Wing affiche, ou non, les onglets du bloc-note pour basculer entre éditeurs. Si désactivé, un menu popup est utilisé à la place.

source: File Order
fr: Ordre des fichiers

source: Alphabetical Order
fr: Ordre alphabétique

source: Control preferred order in source index displays such as the editor browse menus. Either sort in the order found in the file or alphabetical order.
fr: Contrôle l'ordre préféré dans les affichage d'index de la source comme les menus d'explorations de l'éditeur. Trie soit dans l'ordre trouvé dans le fichier ou par ordre alphabétique.

source: Whether to show all open editors in a window in every split.
fr: Afficher ou non tous les éditeurs ouvert dans une fenêtre dans chaque division.

source: Whether to keep tabs in alphabetical order.
fr: Garder, ou non, les onglets par ordre alphabétique.

source: All
fr: Tous

source: General
fr: Général

source: Debugger
fr: Débogueur

source: Editor
fr: Éditeur

source: Search Progress
fr: Recherche en cours

source: Browser
fr: Navigateur

source: Project Manager
fr: Gestionnaire de projet

source: Source Analysis
fr: Analyse de la source

source: All Messages
fr: Tous les messages

source: Only Warnings and Errors
fr: Seulement les avertissements et les erreurs

source: Only Errors
fr: Seulement les erreurs

source: Controls the format and verbosity of messages shown to the user for each message domain in the message area. Each domain specifies the format (in Python 2.3 logging.Formatter format), and the minimum logging level that should be shown in the display. If a message domain is left unspecified, then the parent domain settings are used instead ("" is the parent of all domains).
fr: Contrôle le format et la verbosité des messages affichés à l'utilisateur pour chaque domaine de message dans la zone de message. Chaque domaine spécifie le format (en format logging.Formatter en Python 2.3), et le niveau minimum de logging qui doit être montré dans l'affichage. Si un domaine de message est laissé non spécifié, alors les configurations du domaine parent sont utilisées à la place ("" est le parent de tous les domaines).

source: Config
fr: Configuration

source: Domain
fr: Domaine

source: Max Lines
fr: Lignes max

source: Minimum Level
fr: Niveau minimum

source: Whether feedback dialog is shown to user on quit.
fr: Affichage, ou non, de la boîte de dialogue de retour d'experience à l'utilisateur lors de la sortie du programme.

source: Used internally to avoid showing the feedback dialog on exit over and over again.
fr: Utilisé en interne pour éviter d'afficher la boite de dialogue de retour d'expérience à la fermeture encore et encore.

source: Whether the error bug reporting dialog (also available from the Help menu) is shown automatically when an unexpected exception is encountered inside Wing.
fr: Affichage automatique, ou non, de la boîte de dialogue de rapport de bugs (aussi accessible depuis le menu aide) quand une exception inattendue est rencontrée dans Wing.

source: Used internally to remember which unexpected exceptions have already been reported so we only show error reporting dialog once for each.
fr: Utilisé en interne pour se rappeler quelles exceptions inattendues ont déjà été rapportées ainsi nous affichons uniquement une boîte de dialogue rapportant les erreurs une fois par erreur.

source: Maximum number of non-sticky (auto-closing) editors to keep open at one time, in addition to any that are visible on screen
fr: Nombre maximum d'éditeurs temporaires (auto-fermés) à garder ouvert en même temps, en plus de ceux qui sont visibles à l'écran

source: Email address to use by default in the Feedback and Bug Report dialogs
fr: Adresse mail à utiliser par défaut dans les boites de dialogues de retour d'expériences et de rapport de bugs

source: Both Option keys
fr: Les deux touches Option

source: Left Option key
fr: Touche Option de gauche

source: Command keys
fr: Touches de commande

source: No Alt key
fr: Pas de touche Alt

source: Selects the key to use as the Alt- modifier in key bindings. Note that the Option key is also used to enter characters, such as ® on US keyboards or ] on German keyboards. When the Option key is used for the Alt key, Alt-key bindings take precedence and thus may block entering of characters with the Option key. If both functions are needed, use the left Option key for the Alt-key and enter characters with the right Option key. If the Command keys are used for the Alt key, any Alt-key bindings will override Command-key bindings for the same key.
fr: Sélectionne la touche à utiliser comme le modificateur-Alt dans les raccourcis clavier. Notez que la touche d'Option est aussi utilisée pour entrer des caractères, comme ® sur les claviers US ou ] sur les claviers Allemands. Quand la touche Option est utilisée pour la touche Alt, les raccourcis clavier avec la touche-Alt prennent précédence et donc bloquent l'entrée de caractères avec la touche Option. Si les deux fonctions sont nécessaires, utilisez la touche Option gauche pour la touche-Alt et entrez les caractères avec la touche Option droite. Si les touches de commandes sont utilisées avec la touche Alt, tout raccourci clavier avec la touche-Alt écrasera les raccourcis clavierpour les touches-Commandes pour la même touche.

source: Specifies whether plain Alt keystrokes should be used only for accelerators. When enabled, Alt-key presses that could be for an accelerator will be used only for accelerators and never for key bindings. When disabled, Alt-key bindings take precedence over accelerators. This preference is ignored when Wing is running with native OS X display style, since in that case accelerators do not exist.
fr: Spécifie si les frappes de Alt doivent être utilisées uniquement pour les accélérateurs. Si activé, les pressions de la touche-Alt qui pourraient être pour un accélérateur seront utilisées pour des accélérateurs et jamais pour des raccourcis clavier. Si désactivé, les raccourcis clavier avec la touche-Alt ont priorité sur les accélérateurs. Cette préférence est ignorée quand Wing fonctionne avec un style d’affichage natif pour OS X, puisque dans ce cas les accélérateurs n’existent pas.

source: Controls whether names are sorted case sensitively (with all caps preceding small letters) or case insensitively
fr: Contrôle si les noms sont triés en étant sensibles à la casse (avec toutes les majuscules précédant les minuscules) ou insensible à la casse

source: Controls whether "Search in Files" dialog has an extra row of visible options as buttons.
fr: Contrôle si la boîte de dialogue "Chercher dans fichiers" a une ligne supplémentaire d'options visibles en boutons.

source: Use Default for OS
fr: Utiliser la valeur par défaut pour l’OS

source: Use for Copy/Cut/Paste
fr: Utiliser pour copier/couper/Coller

source: Use for VI Native Actions
fr: Utiliser pour les actions natives de VI

source: Controls the behavior of the Ctrl-X/C/V key bindings in vi mode. Either always use these for cut/copy/paste, use them for vi native actions such as initiate-numeric-repeat and start-select-block, or use the default by system (clipboard on win32 and other commands elsewhere).
fr: Contrôle le comportement des raccourcis clavier Ctrl-X/C/V en mode vi. Utilisez toujours ceux-ci soit pour couper/copier/coller, pour des actions natives vi comme initiate-numeric-repeat et start-select-block, ou utilisez les paramètres par défaut du système (presse-papier sur win32 et d'autres commandes ailleurs).

source: Controls whether to automatically move keyboard focus from the editor to tools when they are revealed.
fr: Contrôle si le focus du clavier est automatiquement déplacé de l'éditeur vers les outils lorsqu'ils sont révélés.

source: File Operations
fr: Opérations de fichiers

source: Clipboard
fr: Presse-papier

source: Selections
fr: Sélections

source: Project Management
fr: Gestion de projet

source: Bookmarks
fr: Signets

source: Testing
fr: Tests

source: Version Control
fr: Contrôle de version

source: Controls which groups of tools will be shown in the toolbar.
fr: Contrôle quel groupes d'outils seront affichés dans la barre d'outils.

source: Extra items to add to the tool bar.
fr: Éléments supplémentaires à ajouter dans la barre d'outils.

source: Icon
fr: Icône

source: Quit application when last document window closes
fr: Quitter l’application quand la dernière fenêtre de document se ferme

source: -- Editor has unsaved changes!
fr: -- L'éditeur a des modifications non sauvegardées !

source: These edited items have also changed on disk. Select those for which you want to discard your changes and reload from disk:
fr: Ces éléments édités ont aussi été modifiés sur le disque. Sélectionnez ceux dont vous voulez annuler vos modifications puis recharger depuis le disque :

source: Discard Changes & _Reload
fr: Annuler les modifications & _recharger

source: _Don't Reload
fr: Ne _pas recharger

source: These items, some with local edits, have changed on disk. Select those which you want to reload from disk. Any changes in the editor will be discarded:
fr: Ces éléments, avec des éditions locales, ont été modifiés sur le disque. Sélectionnez ceux que vous voulez recharger depuis le disque. Toutes modifications dans l'éditeur seront abandonnées :

source: These unedited items have changed on disk. Select those which you want to reload:
fr: Ces éléments non-édités ont changés sur le disque. Sélectionnez ceux que vous voulez recharger :

source: _Reload Selected
fr: _Recharger la sélection

source: Confirm Reload
fr: Confirmer le rechargement

source: Con_figure Reloading
fr: Con_figurer le rechargement

source: _Compare to Disk
fr: Comparer au disque

source: Use System Default (%s)
fr: Utiliser les valeurs par défaut (%s)

source: Use Preference Setting (%s)
fr: Utiliser les paramètres des préférences (%s)

source: The file %s has been modified. Save it now?
fr: Le fichier %s a été modifié. l'enregistrer maintenant ?

source: Save the following files? The selected files will be saved. You will be prompted to name any untitled files:
fr: Enregistrer le(s) fichier(s) suivant(s) ? Le(s) fichier(s) sélectionné(s) sera/seront sauvegardé(s). Vous serez sollicité pour renommer tout fichier sans nom :

source: (Could not encode)
fr: (N'a pas réussi à encoder)

source: (Changing file format)
fr: (Changement de format de fichier)

source: (Disk file is newer)
fr: (Le fichier du disque est plus récent)

source: (Host unavailable)
fr: (Hôte non disponible)

source: (Write failed)
fr: (Écriture échouée)

source: Failed to write remote file
fr: Échec d'écriture du fichier distant

source: Could Not Save Remote Files
fr: N’a pas pu enregistrer les fichiers distants

source: Save Files?
fr: Enregistrer les fichiers ?

source: _Save Selected Files
fr: _Enregistrer le(s) fichier(s) sélectionné(s)

source: _Don't Save Any Files
fr: _Ne rien enregistrer

source: Save Document As
fr: Enregistrer le document sous

source: File is open
fr: Le fichier est ouvert

source: A file named '%s' is already open for editing. Please choose a new file name or close the file and choose save as again.
fr: Un fichier nommé '%s' est déjà ouvert pour édition. Veuillez choisir un nouveau nom de fichier ou fermez le fichier et choisissez de l'enregistrer sous à nouveau.

source: Failed to inspect remote location %s before save as
fr: Échec d’inspection de l’emplacement distant %s avant d’enregistrer sous

source: File exists
fr: Le fichier existe

source: A file named '%s' exists. Do you want to replace it?
fr: Un fichier nommé '%s' existe. Voulez-vous le remplacer ?

source: Failed to write file
fr: Échec d'écriture du fichier

source: Failed to write %s. Save to another file?
fr: L'écriture de %s a échouée. Enregistrer dans un autre fichier ?

source: Disk file no longer exists
fr: Le fichier du disque n’existe plus

source: Another _File
fr: Un autre _fichier

source: Disk file is older
fr: Le fichier du disque est plus ancien

source: Disk file is newer
fr: Le fichier du disque est plus récent

source: Com_pare to Disk
fr: Comparer au disque

source: _Overwrite
fr: _Écraser

source: _Abandon
fr: _Abandonner

source: _Save Now
fr: Enregistrer maintenant

source: Could Not Write to Remote Host
fr: N’a pas pu écrire sur l’hôte distant

source: _Try Again
fr: Essayer à nouveau

source: Different file format
fr: Format de fichier différent

source: File %s doesn't match the file format being written.
fr: Le fichier %s ne correspond pas au format de fichier écrit.

source: Do you want to write changes to this file, select another target file, or cancel the save?
fr: Voulez-vous écrire les modifications dans ce fichier, sélectionner un autre fichier cible, ou annuler l'enregistrement ?

source: O_verwrite
fr: E_craser

source: _Another File
fr: Un _autre fichier

source: Could not encode file contents
fr: Impossible d'encoder le contenu du fichier

source: Could not encode.
fr: Impossible d'encoder.

source: _Save using Specified Encoding
fr: _Enregistrer en utilisant un encodage spécifié

source: Failed to Save As
fr: Échec d’"Enregistrer sous"

source: Failed to write %s. You have closed the editor window!
fr: Échec d'écriture de %s. Vous avez fermé la fenêtre de l'éditeur !

source: Conflicting Filenames
fr: Conflit de noms de fichier

source: The file %s is open in another editor. Please specify another file name to save to.
fr: Le fichier %s est ouvert dans un autre éditeur. Veuillez spécifier un autre nom de fichier pour l'enregistrer.

source: Icon Size
fr: Taille d'icône

source: Tool Style
fr: Style d'outil

source: Show Tool Tips
fr: Afficher les bulles d'aide

source: Hide this Group
fr: Masquer ce groupe

source: Groups Shown
fr: Groupes affichés

source: Customize Toolbar...
fr: Personnaliser la barre d'outils...

source: Show at startup
fr: Afficher au démarrage
