Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_proj.po
Languages: fr, ru

source: View/edit project environment
fr: Voir/éditer l'environnnement du projet
ru: Просмотр/Редактирование среды проекта

source: Unspecified Build Command
ru: Неопределенная Команда Сборки

source: Configure...
fr: Configurer...
ru: Настройка...

source: Edit command and run environment for build
fr: Éditer la commande et l'environnement d'exécution pour construire
ru: Изменить команду и запустить среду для сборки

source: Unspecified
fr: Non spécifié
ru: Неопределено

source: Unknown Command
fr: Commande Inconnue
ru: Неизвестная команда

source: Create New...
fr: Créer nouveau...
ru: Создать Новый...

source: Create new command for build
fr: Créer une nouvelle commande pour construire
ru: Создать новую команду для сборки

source: Use Project Settings and the Following Run Args:
fr: Utiliser les paramètres du projet et lancer les arguments suivants :
ru: Используйте настройки проекта и следующие действия:

source: Use Selected Launch Configuration:
fr: Utiliser le lancement de configuration sélectionné :
ru: Использовать выбранную конфигурацию запуска:

source: Select a custom launch configuration for debugging or executing this file
fr: Sélectionner un lancement de configuration personnalisé pour déboguer ou exécuter ce fichier
ru: Выберите пользовательскую конфигурацию запуска для отладки или выполнения этого файла

source: View/edit project properties
fr: Voir/éditer les propriétés du projet
ru: Просмотр/Редактирование свойств проекта

source: Edit the selected Launch Configuration
fr: Éditer le lancement de configuration sélectionné
ru: Измените выбранную конфигурацию запуска

source: _Edit
fr: _Éditer
ru: Править

source: Create and use a new Launch Configuration
fr: Créer et utiliser un nouveau lancement de configuration
ru: Создание и использование новой конфигурации запуска

source: _New
fr: _Nouveau
ru: Новый

source: Show the Launch Configuration manager to add, edit, or delete launch configurations.
fr: Afficher le gestionnaire de lancement de configuration pour ajouter, éditer, ou supprimer des lancements de configurations.
ru: Показать Диспетчер Конфигурации запуска для добавления, изменения или удаления конфигураций запуска.

source: _Manage
fr: Gérer
ru: Управлять

source: Unspecified Launch Config
fr: Lancement de configuration non spécifié
ru: Конфигурация Запуска Не Указана

source: Create Launch Configuration
fr: Créer un lancement de configuration
ru: Создать конфигурацию запуска

source: Name of the new launch configuration
fr: Nom du nouveau lancement de configuration
ru: Имя новой конфигурации запуска

source: Edit the selected Named Entry Point
fr: Éditer le point d'entrée nommé sélectionné
ru: Редактирование выбранной Именованной Точки Входа

source: Create and use a new Named Entry Point
fr: Créer et utiliser un nouveau point d'entrée nommé
ru: Создание и использование новой Именованной Точки Входа

source: Show the Named Entry Point manager to add, edit, or delete named entry points.
fr: Afficher le gestionnaire de point d'entrée nommé pour ajouter, éditer, ou supprimer des point d'entrée nommés.
ru: Показать Диспетчер Именованных точек входа для добавления, изменения или удаления именованных точек входа.

source: Create Named Entry Point
fr: Créer un point d'entrée nommé
ru: Создать Именованную Точку Входа

source: Name of the new entry point
fr: Nom du nouveau point d'entrée
ru: Имя новой точки входа

source: No Entry Point
fr: Pas de point d'entrée
ru: Нет Точки Входа

source: No entry point is selected. Please select an entry point to edit, or create a new one instead.
ru: Точка входа не выбрана. Выберите точку входа для редактирования или создайте новую.

source: Entry Point
fr: Point d'entrée
ru: Точка Входа

source: No File Name
fr: Par nom de fichier
ru: Нет имени файла

source: Please select a file before configuring the environment
fr: Veuillez sélectionner un fichier avant de configurer l'environnement
ru: Перед настройкой среды выберите файл

source: Start Debug in Current Editor File
fr: Démarrer le débogage dans le fichier de l'éditeur courant
ru: Запустить отладку в текущем файле редактора

source: Debug starts in the current file in the editor.
fr: Le débogage commence dans le fichier actuel de l'éditeur.
ru: Отладка стартует в текущем файле редактора.

source: Use Selected Entry Point:
fr: Utilise le point d'entrée sélectionné :
ru: Использовать выбранную точку входа:

source: Always start debugging with the selected named entry point.
fr: Toujours démarrer le débogage avec le point d’entrée nommé sélectionné.
ru: Всегда начинайте отладку с выбранной именованной точки входа.

source: Start Debug in Selected File:
fr: Démarrer le débogage dans le fichier sélectionné :
ru: Запуск отладки в выбранном файле:

source: Always start debugging with the selected file, using the environment configured in its File Properties.
fr: Toujours démarrer le débogage avec le fichier sélectionné, en utilisant l’environnement configuré dans ses propriétés de fichier.
ru: Всегда начинайте отладку с выбранного файла, используя среду, настроенную в его свойствах файла.

source: View/edit runtime environment
ru: Просмотр/Редактирование среда выполнения

source: Use default
fr: Utiliser les valeurs par défaut
ru: Использовать по умолчанию

source: Custom
fr: Personnaliser
ru: По выбору

source: View/edit preference setting
fr: Voir/éditer les paramètres des préférences
ru: Просмотр/Редактирование настройка параметров

source: Use project setting
fr: Utiliser les paramètres du projet
ru: Использовать настройки проекта

source: View/edit project property
fr: Voir/éditer les propriétés du projet
ru: Просмотр/редактирование свойства проекта

source: Initial directory '%s' does not exist
fr: Le répertoire initial '%s' n'existe pas
ru: Исходный каталог '%s' не существует

source: Initial directory '%s' is not a directory
fr: Le répertoire initial '%s' n'est pas un répertoire
ru: Исходный каталог '%s' не является каталогом

source: Initial directory '%s' is a partial path -- This must be a full path to avoid problems locating source files for analysis and debugging. Use ${WING:PROJECTDIR} to create paths relative to the project, or reference any environment variable with ${VAR}.
fr: Le répertoire initial '%s' est un chemin partiel -- Ce doit être un chemin complet pour éviter des problèmes pour localiser les fichiers sources pour l'analyse et le débogage. Utilisez ${WING:PROJECTDIR} pour créer des chemins relatifs au projet, ou référencez toute variable d’environnement avec ${VAR}.
ru: Исходный каталог '%s' - это частичный путь! Должен быть только полный путь, чтобы избежать проблем с поиском исходных файлов для анализа и отладки. Используйте ${WING:PROJECTDIR}, чтобы создать пути относительно проекта или ссылаться на любую переменную окружения с ${VAR}.

source: Cannot use a Named Entry Point in this version of Wing
fr: Ne peut pas utiliser un point d'entrée nommé dans cette version de Wing
ru: Нельзя использовать Именованную точку входа в этой версии Wing

source: Named Entry Point '%s' does not exist
fr: Le point d'entrée nommé '%s' n'existe pas
ru: Именованная точка входа '%s' не существует

source: Could not launch or inspect Python executable '%s'.
fr: N’a pas pu lancer ou inspecter l’exécutable Python ‘%s’.
ru: Не удалось запустить или проверить исполняемый файл Python '%s'.

source: Python executable cannot be found so must be specified here
fr: L'exécutable Python ne peut être trouvé et doit donc être spécifié ici
ru: Исполняемый файл Python не может быть найден, поэтому должен быть указан здесь

source: Python executable '%s' is not a file
fr: L'exécutable Python '%s' n'est pas un fichier
ru: Исполняемый файл Python '%s' не является файлом

source: Project Home Directory '%s' does not exist
fr: Le répertoire du projet initial '%s' n'existe pas
ru: Домашний Каталог проекта '%s' не существует

source: Project Home '%s' is not a directory
fr: Le projet initial '%s' n'est pas un répertoire
ru: Главная страница проекта '%s' не является каталогом

source: PYTHONPATH entry '%s' is a partial path -- We strongly recommend using full paths here to avoid problems locating source files for analysis and debugging.
fr: L'entrée PYTHONPATH '%s' est un chemin partiel -- Nous recommandons fortement d'utiliser des chemins complets ici pour éviter des problèmes pour localiser les fichiers sources pour l'analyse et le débogage.
ru: Запись PYTHONPATH '%s' - это частичный путь -- мы настоятельно рекомендуем использовать полные пути, чтобы избежать проблем с поиском исходных файлов для анализа и отладки.

source: PYTHONPATH entry '%s' is also a partial path
fr: L'entrée '%s' du PYTHONPATH est aussi un chemin partiel
ru: Запись PYTHONPATH '%s' также является частичным путем

source: PYTHONPATH entry '%s' does not exist or cannot be found
fr: L'entrée '%s' du PYTHONPATH n'existe pas ou ne peut pas être trouvée
ru: Запись PYTHONPATH '%s' не существует или не может быть найдена

source: PYTHONPATH entry '%s' is not a directory
fr: L'entrée «%s» du PYTHONPATH n'est pas un répertoire
ru: Запись PYTHONPATH '%s' не является каталогом

source: Environment must be in var=value form, one per line:
fr: L'environnement doit être de la forme var=valeur, un par ligne :
ru: Окружение должна быть представлено в форме var = value, по одному в строке:

source: Env entry %s is invalid
fr: L'entrée %s de l'environnement est invalide
ru: Env запись %s является недействительной

source: (from project properties)
fr: (depuis les propriétés du projet)
ru: (от свойств проекта)

source: This file is stored on remote host '%s' but the selected launch configuration %s is for a host '%s'
ru: Этот файл хранится на удаленном хосте '%s', но выбранная конфигурации запуска %s предназначена для хоста '%s'

source: This file is stored on remote host '%s' but the selected launch configuration %s is for localhost
ru: Этот файл хранится на удаленном хосте '%s' но выбранная конфигурация запуска %s предназначена для для localhost

source: This file is stored on localhost but the selected launch configuration %s is for a remote host '%s'
ru: Этот файл хранится на локальном компьютере, но и выбранная конфигурация запуска %s предназначена для удаленного хоста '%s'

source: The selected launch configuration no longer exists.
fr: Le lancement de configuration sélectionné n'existe plus.
ru: Выбранная конфигурация запуска больше не существует.

source: Single User (One File)
fr: Utilisateur simple (un fichier)
ru: Один Пользователь (Один Файл)

source: Shared (Two Files)
fr: Partagé (deux fichiers)
ru: Общий (Два Файла)

source: Type of project: Single user projects store all values in one *.wpr file, and shared projects stores the sharable configuration in *.wpr and user-specific values in *.wpu. In shared projects, the *.wpr file can be checked into revision control for sharing with other developers. Note that shared projects cannot be read byWing Personal.
ru: Тип проекта: Однопользовательские проекты хранят все значения в одном файле *.wpr, а общие настройки проекта совместного использования хранятся в *.wpr и пользовательские значения в *.wpu. В общих проектах файл *.wpr может быть проверен в контроле версий для совместного использования с другими разработчиками. Обратите внимание, что общие проекты не могут быть прочитаны byWing Personal.

source: Python Configuration
fr: Configuration Python
ru: Конфигурация Python

source: Project Properties: %s
fr: Propriétés du projet : %s
ru: Свойства проекта: %s

source: Debug Child Processes
fr: Déboguer les process enfants
ru: Отладка дочерних процессов

source: View/edit Debug Child Processes preference
ru: Просмотр/Редактирование параметров дочерних процессов отладки

source: Unbuffered (-u)
fr: Sans tampon (-u)
ru: Небуферизованный (-u)

source: Debug Server Port
fr: Port de serveur de débogage
ru: Порт Сервера Отладки

source: Automatic Perspectives
fr: Perspectives automatiques
ru: Автоматические Перспективы

source: _Debug/Execute
fr: _Déboguer/Exécuter
ru: Отладка/Выполнение

source: _Debug
fr: _Déboguer
ru: Отладка

source: E_nvironment
fr: E_nvironnement
ru: Окружение

source: Opt_ions
ru: Опции

source: E_xtensions
ru: Расширения

source: Default File Encoding
fr: Encodage du fichier par défaut
ru: Кодировка Файла По Умолчанию

source: View/edit Default Encoding Preference
fr: Voir/éditer les préférences d'encodage par défaut
ru: Просмотр/Редактирование параметров по умолчанию для кодировки

source: Location of Project File
fr: Emplacement du fichier projet
ru: Расположение файла проекта

source: Specified Directory:
fr: Répertoire spécifié :
ru: Указанный каталог:

source: Preferred Line Ending
fr: Fin de ligne Préférée
ru: Предпочтительное Окончание Строки

source: View/edit Line Ending preference
fr: Voir/éditer les préférences de fin de ligne
ru: Просмотр/Редактирование араметров окончания строки

source: Line Ending Policy
fr: Politique de fin de ligne
ru: Политика Завершения Строки

source: Preferred Indent Style
fr: Style d'indent préféré
ru: Предпочтительный Стиль Отступа

source: View/edit Indent Style preference
fr: Voir/éditer les préférences de style d'indent
ru: Просмотр/Редактирование параметров стиля отступов

source: Indent Style Policy
fr: Politique de style d'indent
ru: Политика Стиля Отступов

source: Strip Trailing White Space
fr: Enlever les espaces blancs de fin de chaîne
ru: Стрип-трейлинг пробелов

source: View/edit Strip Trailing White Space preference
ru: Просмотр/Редактирование параметра Стрип-трейлинг пробелов

source: Enable Django Template Debugging
fr: Activer le débogage de modèle Django
ru: Включить отладку шаблонов Django

source: Help
fr: Aide
ru: Помощь

source: Show Django setup How-To in the help viewer
fr: Afficher le guide pratique d'installation Django dans le visionneur de l'aide
ru: Показать инструкции по установке Django в средстве просмотра справки

source: Matplotlib Event Loop Support
fr: Support de boucle d'événement Matplotlib
ru: Поддержка Цикла Событий Matplotlib

source: Show Matplotlib How-To in the help viewer
fr: Afficher le guide pratique de Matplotlib dans le visionneur de l'aide
ru: Показать инструкции Matplotlib в средстве просмотра справки

source: Show Zope setup How-To in the help viewer
fr: Afficher le guide pratique d'installation Zope dans le visionneur de l'aide
ru: Показать инструкции по настройке Zope в средстве просмотра справки

source: Add Zope Files?
fr: Ajouter des fichiers Zope ?
ru: Добавить файлы Zope?

source: Would you like to automatically add Zope source files to your project? Select the directories to include:
fr: Voulez-vous ajouter automatiquement les fichiers sources Zope à votre projet ? Sélectionner les répertoires à inclure :
ru: Вы хотите автоматически добавить исходные файлы Zope в свой проект? Выберите каталоги для включения:

source: _Add Files
fr: _Ajouter des fichiers
ru: Добавить файлы

source: Do_n't show this notice again
fr: Ne plus afficher cette notice à nouveau
ru: Не показывать это уведомление еще раз.

source: Could not install WingDBG
fr: N'a pas pu installer WingDBG
ru: Не удалось установить WingDBG

source: Could not install WingDBG because an exception occurred. Please check that %s is writable and %s exists
fr: N'a pas pu installer WingDBG car une exception est survenue. Veuillez vérifier que %s peut être écrit et que %s existe
ru: Не удалось установить WingDBG, поскольку произошло исключение. Убедитесь, что %s доступен для записи, а %s существует

source: Could not install WingDBG. Please check that %s is writable and %s exists
fr: N'a pas pu installer WingDBG. Veuillez vérifier que %s peut être écrit et que %s existe
ru: Не удалось установить WingDBG. Убедитесь, что %s доступен для записи, а %s существует

source: Install Zope Debugging Support?
fr: Installer le support de débogage Zope ?
ru: Установить Поддержку Отладки Zope?

source: Wing could not find the WingDBG product in the selected Zope installation. Debugging will not work without it. Would you like to install WingDBG in %s?
fr: Wing n'a pas pu trouver le produit WingDBG dans l'installation Zope sélectionnée. Le débogage ne fonctionnera pas sans cela. Voulez-vous installer WingDBG dans %s ?
ru: Wing не могло найти продукт WingDBG в выбранной установке Zope. Отладка не будет работать без него. Хотите установить WingDBG в %s?

source: _Install WingDBG
fr: Installer WingDBG
ru: Установка WingDBG

source: Version Control
fr: Contrôle de version
ru: Контроль версий

source: Show Preferences
fr: Afficher les préférences
ru: Показать Настройки

source: Carriage Return \r (Mac OS <= 9)
fr: Retour chariot \r (Mac OS <= 9)
ru: Возврат каретки \r (Mac OS <= 9)

source: Carriage Return + Line Feed \r\n (Windows)
fr: Retour chariot et saut de ligne \r\n (Windows)
ru: Возврат Каретки + Перевод Строки \r\n (Windows)

source: The type of end-of-line characters to use in this file. Changing this value will cause the file's existing line endings to be translated in the editor. Save the editor to change the file on disk.
fr: Le type de caractères de fin-de-ligne à utiliser dans ce fichier. Changer cette valeur provoquera le changement des fin-de-ligne existantes de ce fichier dans l'éditeur. Enregistrer l'éditeur pour modifier le fichier sur le disque.
ru: Тип символов конца строки для использования в этом файле. Изменение этого значения приведет к переводу существующих окончаний строк файла в редакторе. Сохраните редактор, чтобы изменить файл на диске.

source: The file type to use for this file. This affects how Wing sees the file for source analysis and how it is syntax highlighted.
fr: Le type de fichier à utiliser pour ce fichier. Cela affecte comment Wing voit le fichier pour l'analyse de la source et comment la syntaxe est surlignée.
ru: Тип файла, используемый для этого файла. Это влияет на то, как Wing видит файл для анализа источника и как он выделен синтаксисом.

source: Sets whether or not this file is read-only on disk. Be cautious with this option if you are using a revision control system that relies on file permissions for locking.
fr: Fixe, ou non, ce fichier en lecture seule sur le disque. Soyez prudent avec cette option si vous utilisez un système de contrôle de révision qui se fie aux permissions de fichier pour bloquer.
ru: Определяет, доступен ли этот файл только для чтения на диске. Будьте осторожны с этим параметром, если вы используете систему управления версиями, которая полагается на права доступа к файлам для блокировки.

source: Could not convert encoding
fr: N'a pas pu convertir l'encodage
ru: Не удалось преобразовать кодировку

source: Encoding of this file cannot be set here because the file contains a comment specifying '%s' encoding. Please edit the comment instead.
fr: L'encodage de fichier ne peut pas être fixé ici car le fichier contient un commentaire '%s' spécifiant l'encodage. Veuillez plutôt éditer ce commentaire.
ru: Кодировка этого файла не может быть установлена, так как файл содержит комментарий, указывающий кодировку '%s'. Вместо этого отредактируйте комментарий.

source: Reload file with new encoding?
fr: Recharger avec un nouvel encodage ?
ru: Перезагрузите файл с новой кодировкой?

source: "set by preference"
fr: "affecté par les préférences"
ru: "установить по параметру"

source: You have changed the encoding of this file from %s to %s. Would you like to discard changes and reload the file now using the new encoding, or just save the current editor's content using the new encoding the next time it is saved? You should reload if the file was not opened correctly with the old encoding.
fr: Vous avez changé l'encodage de ce fichier de %s à %s. Voulez vous annulez ces modifications et recharger le fichier maintenant en utilisant le nouvel encodage, ou juste enregistrer le contenu de l'éditeur en utilisant le nouvel encodage la prochaine fois qu'il sera sauvegardé ? Vous devriez le recharger si le fichier n'a pas été ouvert correctement avec l'ancien encodage.
ru: Вы изменили кодировку этого файла с %s на %s. Вы хотите отменить изменения и перезагрузить файл, используя новую кодировку, или просто сохранить содержимое текущего редактора, используя новую кодировку при следующем сохранении? Вы должны выполнить перезагрузку, если файл не был открыт правильно со старой кодировкой.

source: Abandon Changes?
fr: Abandon des modifications ?
ru: Отменить изменения?

source: Do you really want to abandon your changes and reread this file from disk?
fr: Voulez vous vraiment abandonner vos modifications et relire ce fichier depuis le disque ?
ru: Вы действительно хотите отказаться от своих изменений и перечитать этот файл с диска?

source: _Abandon Changes
fr: _Abandon des modifications
ru: Отменить изменения

source: File Properties: %s
fr: Propriétés du fichier : %s
ru: Свойства файла: %s

source: Set by Encoding Comment (%s)
fr: Affecté par le commentaire d'encodage (%s)
ru: Задать кодировку по комментарию (%s)

source: Plain Text
fr: Texte plein
ru: Простой текст

source: By File Name (%s)
fr: Par nom de fichier (%s)
ru: По имени файла (%s)

source: File Type
fr: Type du fichier
ru: Тип файла

source: Encoding
fr: Encodage
ru: Кодировка

source: View/edit Default Text Encoding preference
fr: Voir/éditer les préférences d'encodage du texte par défaut
ru: Просмотр/Редактирование параметра Кодировка Текста по умолчанию

source: Line Ending Style
fr: Style de fin de ligne
ru: Стиль Конца Строки

source: Indent Style
fr: Style d'indent
ru: Стиль Отступов

source: Convert Indents
fr: Convertir les indents
ru: Преобразовать Отступы

source: Display the indentation conversion tool
fr: Afficher l'outil de conversion d'indentation
ru: Отобразить инструмент преобразования отступа

source: Read-only on Disk
fr: Lecture seule sur le disque
ru: Только для чтения на диске

source: Show White Space
fr: Afficher les espaces blancs
ru: Показать Пробелы

source: View/edit Show Whitespace preference
fr: Voir/éditer l'affichage des préférences des espaces
ru: Просмотр/Редактирование параметра Показать пробелы

source: Show EOL
fr: Afficher les fin de ligne
ru: Показать EOL

source: View/edit Show EOL preference
fr: Voir/éditer l'affichage des préférences de fin de lignes
ru: Просмотр/Редактирование параметр Показывать EOL

source: Show Indent Guides
fr: Afficher les guides d'indents
ru: Показать линии Отступов

source: View/edit Show Indent Guides preference
fr: Voir/éditer Afficher les préférences des guides d'indent
ru: Просмотр/Редактирование параметра Показать Линии Отступов

source: Ignore Indent Errors
fr: Ignorer les erreurs d'indents
ru: Игнорировать Ошибки Отступов

source: Ignore EOL Errors
fr: Ignorer les erreurs de fin de ligne
ru: Игнорировать ошибки EOL

source: Ensure Ending EOL
fr: Assurer les fins EOL
ru: Обеспечить Окончание EOL

source: View/edit Ensure Ending EOL When Saving preference
ru: Просмотр/Редактирование обеспечения окончания EOL при сохранении параметров

source: _File Attributes
fr: Attibuts du _fichier
ru: Атрибуты файлов

source: _Editor
fr: _Éditeur
ru: Редактор

source: _Environment
fr: _Environnement
ru: Окружение

source: Name of directory
fr: Nom du répertoire
ru: Имя каталога

source: Check this to scan all sub-directories recursively.
fr: Cocher ceci pour scanner tous les sous-répertoires récursivement.
ru: Проверьте это, чтобы рекурсивно сканировать все подкаталоги.

source: The filter that specifies which of the directory's files should be included in the project. This should be an fnmatch/glob style pattern (such as '*' or '*.py') or the name of a Filter configured in preferences. Use the button to configure Filters.
ru: Фильтр, указывающий, какие файлы каталога должны быть включены в проект. Это должен быть шаблон стиля fnmatch/glob (например, '*' или '*.py') или имя фильтра, настроенного в настройках. Используйте кнопку для настройки фильтров.
