Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_guimgr.po
Languages: fr

source: Cancel Diff/Merge Session
fr: Annuler la session de Diff/fusion

source: Python Environment
fr: Environnement Python

source: Project Properties
fr: Propriétés du projet

source: Run
fr: Démarrage

source: Break
fr: Sortir

source: Debug
fr: Débogage

source: Step Into
fr: Un pas en profondeur

source: Debug To Cursor
fr: Déboguer jusqu'au curseur

source: Stop
fr: Arrêter

source: Restart
fr: Redémarrage

source: Step Over
fr: Un pas en avant

source: Step Out
fr: Un pas en dehors

source: Up Stack
fr: En haut dans la pile

source: Show Position
fr: Afficher la position

source: Down Stack
fr: En bas dans la pile

source: Run Tests
fr: Lancer les tests

source: Abort Tests
fr: Abandonner les tests

source: Run All Tests
fr: Lancer tous les tests

source: Debug Tests
fr: Déboguer les tests

source: Debug All Tests
fr: Déboguer tous les tests

source: Update
fr: Mise à jour

source: View Diffs
fr: Voir les différences

source: Status
fr: Statuts

source: Create Bookmark
fr: Créer un signet

source: Remove Bookmark
fr: Enlever un signet

source: Goto Bookmark
fr: Aller au signet

source: Go to selected bookmark
fr: Aller au signet sélectionné

source: Previous Bookmark
fr: Signet précédent

source: Next Bookmark
fr: Signet suivant

source: Search in Files
fr: Chercher dans fichiers

source: Pause Search
fr: Suspendre la recherche

source: Previous Match
fr: Correspondance précédente

source: Next Match
fr: Correpondance suivante

source: Previous
fr: Précédent

source: Next
fr: Suivant

source: Contents
fr: Contenus

source: Close
fr: Fermer

source: Table of Contents
fr: Table des matières

source: Wing Tips
fr: Astuces Wing

source: Select from recently visited documents
fr: Sélectionner parmi les documents récemment visités

source: History
fr: Historique

source: Help
fr: Aide

source: Wing Help
fr: Aide Wing

source: Could not find document section %s: Please report this error to bugs@wingware.com
fr: Impossible de trouver la section %s du document : Veuillez rapporter cette erreur à bugs@wingware.com

source: Could not find document
fr: Impossible de trouver le document

source: Copy Text to Clipboard
fr: Copier le texte vers le presse-papier

source: Copy HTML to Clipboard
fr: Copier le HTML vers le presse-papier

source: Smaller Font
fr: Police plus petite

source: Larger Font
fr: Police plus grande

source: Help view state
fr: Aide de l'état du visionneur

source: Wing: Submit Bug Report
fr: Wing : Soumettre un rapport de bugs

source: Wing: Please Send Feedback
fr: Wing : Veuillez envoyer votre retour d'expérience

source: _Do Later
fr: _Faire plus tard

source: Configure Proxy...
fr: Configurer le proxy...

source: _Submit Now
fr: _Soumettre maintenant

source: Show this dialog on unexpected errors
fr: Afficher cette boite de dialogue lors d'erreurs inattendues

source: Show this dialog when quitting
fr: Afficher cette boite de dialogue lors de la fermeture

source: Include error log: %s (%i KB)
fr: Inclure le log d'erreur : %s (%i KB)

source: Please provide as much information as possible about what caused the bug that you are reporting.
fr: Veuillez fournir autant d'informations que possible au sujet de ce qui a causé le bug que vous rapportez.

source: An unexpected error occurred. Please submit this bug report to us, with as much additional information as possible about what caused the problem. Sorry for this inconvenience -- submitting a report will help us to fix the problem sooner.
fr: Une erreur inattendue est survenue. Veuillez nous soumettre un rapport de bug, avec autant d'informations additionnelles que possible sur ce qui a causé ce bug. Nous nous excusons pour ces désagréments -- Soumettre un rapport de bug nous permettra de corriger ce problème dès que possible.

source: Please tell us what you think! Your feedback drives our product development.
fr: Dites nous ce que vous pensez s'il vous plait ! Vos retours d'expériences guident le développement de notre produit.

source: Summary:
fr: Objet :

source: Details:
fr: Détails :

source: Where did you hear about Wing?
fr: Où avez vous entendu parler de Wing ?

source: If you want us to respond, please include a valid email address:
fr: Si vous souhaitez que nous vous répondions, veuillez inclure une adresse mail valide :

source: You can also do this later from the Help menu.
fr: Vous pouvez aussi faire ça plus tard depuis le menu d'aide.

source: Submitting
fr: Soumission

source: Submitting to wingware.com. Please wait
fr: Soumission à wingware.com. Veuillez patienter

source: Collecting Data
fr: Collecte de données

source: Nothing to Submit
fr: Rien à Soumettre

source: Nothing was entered in summary or detail.
fr: Rien n'a été entré dans le sommaire ou dans les détails.

source: Encoding Data
fr: Encodage des données

source: Creating Request
fr: Création de la requête

source: Opening Connection
fr: Ouverture de la connexion

source: Reading Reply
fr: Lecture de la réponse

source: Closing Connection
fr: Fermeture de la connexion

source: Submit Error
fr: Erreur de soumission

source: Received unexpected response. There may be a network problem: %s
fr: Une réponse inattendue a été reçue. Il y a peut-être un problème réseau : %s

source: Bug Report Submitted
fr: Rapport de bug envoyé

source: Thanks for your bug report. It has been submitted to wingware.com and will be emailed to our software development staff.
fr: Merci pour votre rapport de bug. Il a été envoyé à wingware.com et sera transmis à notre équipe de développement logiciel.

source: Feedback Submitted
fr: Retour d'expérience soumis

source: Thanks for your feedback. It has been submitted to wingware.com and will be emailed to our software development staff.
fr: Merci pour votre retour d'expérience. Il a été soumis à wingware.com et sera transmis à notre équipe de développement.

source: Cancel Bug Report?
fr: Annuler ce rapport de bug ?

source: Cancel Feedback?
fr: Annuler le retour d'expérience ?

source: Are you sure you want to cancel? Any text you have entered will be lost.
fr: Êtes-vous sûr de vouloir annuler ? Tout le texte que vous avez entré sera perdu.

source: No Project
fr: Pas de projet

source: (r/o)
fr: (lecture seule)

source: Failed language change
fr: Le changement de langage a échoué

source: Failed to remove %s -- the language cannot be changed until this file can be removed.
fr: La suppression de %s a échoué -- le langage ne peut être modifié jusqu'à ce que ce fichier soit supprimé.

source: Failed to write %s -- the language cannot be changed until this file can be written.
fr: L'écriture dans %s a échoué -- le langage ne peut être modifié jusqu'à ce que ce fichier soit écrit.

source: The new font size may not apply successfully to all of the GUI until you restart Wing.
fr: La nouvelle taille de police ne s'appliquera peut être pas avec succès à toute l'Interface Utilisateur (GUI) jusqu'au redémarrage de Wing.

source: _Restart
fr: Redémarrage

source: Restart Wing?
fr: Redémarrer Wing ?

source: _Restart Now
fr: _Redémarrer maintenant

source: _Show Preferences
fr: Afficher les préférences

source: Installed updates: %s
fr: Mises-à-jours installées : %s

source: Cannot Open Remote File
fr: N'a pas pu ouvrir un fichier distant

source: This version of Wing cannot open remote files like %s
fr: Cette version de Wing ne peut pas ouvrir des fichiers distants comme %s

source: Document Open Failed
fr: Ouverture du document échouée

source: Failed to open document '%s'
fr: Impossible d'ouvrir le document '%s'

source: Could not show panel
fr: Impossible d'afficher le panneau

source: Could not display requested panel of type '%s' (unknown panel type)
fr: Impossible d'afficher le panneau demandé de type '%s' (type de panneau inconnu)

source: No Project Open
fr: Aucun projet ouvert

source: Wing Menu: %s
fr: Menu Wing : %s

source: The file to select
fr: Le fichier à sélectionner

source: Select file:
fr: Sélectionner un fichier :

source: General failure obtaining application-wide visual state
fr: Échec général en cherchant l'état visuel de l'application

source: No windows in application-wide state
fr: Pas de fenêtres dans l'état application-wide

source: Creating window
fr: Création de la fenêtre

source: Creating window #%i...
fr: Création de la fenêtre #%i...

source: Configuring window...
fr: Configuration de la fenêtre...

source: Configuring window (%i)...
fr: Configuration de la fenêtre (%i)...

source: Could not set tool window visual state: No notebook view
fr: Impossible d'affecter l'état visuel de la fenêtre-outil : Pas de vue du bloc-note

source: General failure in setting application-wide state
fr: Échec général en affectant l'état visuel de l'application

source: Auto-Save Files Before Debug or Execute
fr: Auto-enregistrement des fichiers avant débogage ou Exécution

source: Default Project
fr: Projet par défaut

source: Waiting for Remote Agent
fr: Attente de l’agent distant

source: Add Directory to Project?
fr: Ajouter un répertoire au projet ?

source: Would you like to add %s to your project?
fr: Voulez vous ajouter %s à votre projet ?

source: _Add Directory
fr: Ajouter un répertoire

source: Add Directories to Project?
fr: Ajouter des répertoires au projet ?

source: Please select directories to add to the project:
fr: Veuillez sélectionner les répertoires à ajouter au projet :

source: _Add Selected Dirs
fr: Ajouter les répertoires sélectionnés

source: Wing: %s (r/o)
fr: Wing : %s (l/s)

source: Failed to set panel window state:
fr: Échec en affectant l'état de la fenêtre :

source: Toolbox: %s: Wing
fr: Boîte à outils : %s : Wing

source: Toolbox: Wing
fr: Boîte à outils : Wing

source: Failed to save portions of visual state for %s:
fr: Échec en sauvegardant des portions de l'état visuel pour %s :

source: Really Restore Default Tools?
fr: Vraiment restaurer les outils par défaut ?

source: This command will close all currently open tools and restore the factory default tool set for the perspective '%s'. Are you sure you want to do this?
fr: Cette commande va fermer tous les outils actuellement ouverts et restaurer la configuration d'usine de l'ensemble des outils par défaut pour la perspective '%s'. Êtes-vous sur de vouloir faire cela ?

source: This command will close all currently open tools and restore the factory default tool set for user-defined perspectives. Are you sure you want to do this?
fr: Cette commande va fermer tous les outils actuellement ouverts et restaurer l'ensemble des outils de la configuration d'usine par défaut pour les perspectives définies par l'utilisateur. Êtes-vous sur de vouloir faire cela ?

source: This command will close all currently open tools and restore the factory default tool set. Are you sure you want to do this?
fr: Cette commande va fermer tous les outils actuellement ouverts et restaurer l'ensemble des outils de la configuration d'usine par défaut. Êtes-vous sur de vouloir faire cela ?

source: _Yes
fr: Oui

source: _No
fr: _Non

source: (named entry point)
fr: (point d'entrée nommé)

source: Left
fr: de gauche

source: Right
fr: de droite

source: Bottom
fr: du bas

source: Top
fr: du haut

source: %sToolbox
fr: Boîte à outils %s

source: %sToolbox Split #%i
fr: Division #%i de la boite à outils %s

source: Insert Tool
fr: Insérer un outil

source: New Window
fr: Nouvelle fenêtre

source: Window %s
fr: Fenêtre %s

source: Move %s to
fr: Déplacer %s vers

source: Remove %s
fr: Enlever %s

source: %s Key Binding
fr: Raccourci clavier %s

source: Key binding used to show the most recently accessed %s
fr: Raccourci clavier utilisé pour afficher l'élément accédé le plus récent %s

source: Set Key Binding for %s...
fr: Affecter un raccourci clavier pour %s...

source: Put Toolbox Back Into %s
fr: Remettre la boite à outils dans %s

source: Move Toolbox to Right
fr: Déplacer la boite à outils à droite

source: Move Toolbox to Left
fr: Déplacer la boite à outils à gauche

source: Move Toolbox to Top
fr: Déplacer la boite à outils en haut

source: Move Toolbox to Bottom
fr: Déplacer la boite à outils en bas

source: Move Toolbox to New Window
fr: Déplacer la boite à outils dans une nouvelle fenêtre

source: Move Toolbox Split #%i to New Window
fr: Déplacer la division #%i de la boite à outils vers une nouvelle fenêtre

source: Add Toolbox Split
fr: Ajouter une division de boite à outils

source: Remove Toolbox Split
fr: Enlever cette division de boite à outils

source: Hide Toolbox
fr: Masquer la boite à outils

source: Use Above and Below Splits
fr: Utiliser les divisions haut et bas

source: Use Side by Side Splits
fr: Utiliser les divisions côte à côte

source: Place Tabs at Bottom
fr: Placer les onglets en bas

source: Place Tabs at Top
fr: Placer les onglets en haut

source: Place Tabs at Right
fr: Placer les onglets à droite

source: Place Tabs at Left
fr: Placer les onglets à gauche

source: The window title (blank for internal default)
fr: Le titre de la fenêtre (vide par défaut)

source: Set Window Title...
fr: Affecter le titre de la fenêtre...

source: Keep Window on Top
fr: Garder la fenêtre au-dessus

source: Failed to set colors
fr: Impossible d'affecter les couleurs

source: Failed to set selected colors because the file %s could not be written
fr: Impossible d'affecter les couleurs sélectionnées parce que le fichier %s ne peut pas être écrit

source: _Continue Working
fr: _Continuer de travailler

source: Wing requires a restart to reinitialize its display to match the current display preferences. You may either quit now or continue working without all the preferences applied.
fr: Wing nécessite d'être redémarré pour réinitialiser l'affichage avec les préférences d'affichage actuelles. Vous pouvez soit quitter maintenant soit continuer à travailler sans que toutes les préférences soient effectives.

source: Restart for Display Changes
fr: Redémarrer pour les modifications d'affichage

source: _Tab Key Action
fr: Action de la touche de _tabulation

source: _Enable Auto-Editing
fr: _Activer l'auto-édition

source: Please select your preferred editor behaviors. Hover over the fields for additional documentation.
fr: Veuillez sélectionner vos comportements d'éditeur préférés. Passez au dessus des champs pour de la documentation additionnelle.

source: You can alter these settings later in Preferences or by using the Edit > Keyboard Personality menu.
fr: Vous pouvez modifier ces paramètres plus tard dans Préférences ou en utilisant le menu Éditer > Personnalité du Clavier.

source: Use Wing _Defaults
fr: Utiliser les éléments Wing par _défaut

source: Use _These Settings
fr: Utiliser ces paramètres

source: Select Initial Preferences
fr: Sélectionner les préférences initiales

source: Configuring window %i...
fr: Configuration de la fenêtre %i...

source: %s: Undefined key sequence
fr: %s : Séquence de touche indéfinie

source: Unavailable commands: %s
fr: Commande(s) indisponible(s) : %s

source: Failed to save portion of editor state for %s
fr: Échec pour enregistrer une partie de l'état de l'éditeur pour %s

source: Failed to restore portions of editor state for %s:
fr: Échec pour restaurer des portions de l'état de l'éditeur pour %s :

source: [not unique]
fr: [non unique]

source: [no match]
fr: [pas de correspondance]

source: Repeat:
fr: Répéter :

source: Count:
fr: Compter :

source: general
fr: général

source: editor
fr: éditeur

source: debugger
fr: débogueur

source: search
fr: chercher

source: transient
fr: éphémère

source: project
fr: projet

source: browser
fr: navigateur

source: analysis
fr: analyse

source: Wing Sub-System Messages
fr: Sous-système de messages de Wing

source: Error
fr: Erreur

source: Messages visual state
fr: État visuel des messages

source: Show Messages:
fr: Afficher les messages :

source: Failed to save portions of visual state for editor %s:
fr: Échec pour enregistrer des portions de l'état visuel pour l’éditeur %s :

source: Switch between open files
fr: Inversion entre les fichiers ouverts

source: This editor is locked and will not be used to open other files. Click the lock icon to change modes.
fr: Cet éditeur est verrouillé et ne sera pas utilisé pour ouvrir d'autres fichiers. Cliquez sur l'icône de verrou pour le changer de mode.

source: This file is sticky and will remain open until closed. Click the stick pin icon to change modes.
fr: Ce fichier est permanent et restera ouvert jusqu'à ce qu'il soit fermé. Cliquez sur l'icône de la punaise pour changer de mode.

source: This file is non-sticky and will auto-close when hidden. Click the stick pin icon to change modes.
fr: Ce document est temporaire et sera fermé automatiquement lorsqu'il sera masqué. Cliquez sur l'icône de la punaise pour pour changer de mode.

source: Right-click for menu of recently visited documents.
fr: Clic-droit pour le menu des documents récemment visités.

source: Configure...
fr: Configurer...

source: Next visit in history (%s)
fr: Visite suivante dans l'historique (%s)

source: Next visit in history
fr: Visite suivante dans l'historique

source: Previous visit in history (%s)
fr: Visite précédente dans l'historique (%s)

source: Previous visit in history
fr: Visite précédente dans l'historique

source: Code warnings
fr: Avertissements de code

source: Diff/Merge session options
fr: Options de la session de Diff/fusion

source: Navigate to bookmarks in this file
fr: Naviguer vers les signets dans ce fichier

source: Close Document
fr: Fermer le document

source: Document View Options
fr: Options de Vue du document

source: No warnings
fr: Pas d’avertissements

source: Code Warnings:
fr: Avertissements de code :

source: More...
fr: Plus…

source: Bookmarks:
fr: Signets :

source: General failure getting multi-editor visual state
fr: Erreur générale en récupérant l'état visuel du multi-éditeur

source: Current editor file
fr: Fichier de l'éditeur actuel

source: General failure setting multi-editor visual state
fr: Erreur générale en affectant l'état visuel du multi-éditeur

source: Could not open %s. Please check the filename.
fr: Impossible d'ouvrir %s. Veuillez vérifier le nom du fichier.

source: File open failed
fr: Échec d'ouverture du fichier

source: Move %s to New Window
fr: Déplacer %s vers une nouvelle fenêtre

source: Close %s
fr: Fermer %s

source: Close Others
fr: Fermer les autres onglets

source: Close All
fr: Tout fermer

source: Copy File Path
fr: Copier le chemin du fichier

source: Show in Explorer
fr: Afficher dans l'Explorateur

source: Show in Finder
fr: Afficher dans le Finder

source: Show Directory
fr: Afficher le répertoire

source: Show in Project
fr: Afficher dans le projet

source: Split Top and Bottom
fr: Diviser haut et bas

source: Split Side by Side
fr: Diviser côte à côte

source: Join all Splits
fr: Fusionner toutes les divisions

source: Show All Files in All Splits
fr: Afficher tous les fichiers dans toutes les divisions

source: Hide Notebook Tabs
fr: Masquer les onglets du bloc-note

source: Show Notebook Tabs
fr: Afficher les onglets du bloc-note

source: Keep Tabs Alphabetized
fr: Garder les onglets par ordre alphabétique

source: Add New Tabs on Left
fr: Ajouter de nouveaux onglets à gauche

source: Sort Symbol Menus Alphabetically
fr: Trier les menus de symboles alphabétiquement

source: Sort Symbol Menus in File Order
fr: Trier les menus de symboles dans l'ordre du fichier

source: General failure getting paned editor state
fr: Échec général en récupérant l'état de l'éditeur embarqué

source: Currently open editor files
fr: Fichiers actuellement ouvert dans l'éditeur

source: General failure setting paned editor state
fr: Échec général en affectant l'état de l'éditeur embarqué

source: Could not read key map
fr: Impossible de lire la disposition clavier

source: The key map file '%s' could not be found or is not readable. Attempting to fall back to internal defaults. Please restore the missing file or change the User Interface / Advanced / Key Map File preference.
fr: Le fichier de disposition clavier '%s' ne peut être trouvé ou n'est pas lisible. Nous tentons d'utiliser les valeurs internes par défaut. Veuillez restaurer le fichier manquant ou modifier les préférences interface Utilisateur / Avancé / Fichier de raccourcis clavier.

source: Combined Toolbox and Editor Windows
fr: Fenêtres de boite à outils et d'éditeur combinées

source: Separate Toolbox Windows
fr: Fenêtres de boite à outils séparées

source: Defines location of the keymap override file. Use None for default according to configured editor personality. See the Wing Manual for details on building your keymap override file -- in general this is used only in development or debugging keymaps; use the keymap-override preference instead for better tracking across Wing versions.
fr: Définit l'emplacment du fichier d'écrasement de correspondance de touches. Utiliser None par défaut en accord avec la personnalité d'éditeur configurée. Voir le Manuel Wing pour des détails sur la construction de votre fichier d'écrasement de correspondance de touches -- en général c'est utilisé uniquement en développement ou pour le débogage de correspondance de touches ; utiliser plutôt la préférence d'écrasement de correspondance de touches pour un meilleur suivi à travers les versions de Wing.

source: Override with selected:
fr: Écraser avec la sélection :

source: Use Default for Personality
fr: Utiliser la personnalité par défaut

source: Override key bindings in the keymap. To enter the key, place focus on the entry area and type the key combination desired. The command is one of those documented in the user manual's Command Reference, or the name of any user scripts that have been loaded into the IDE. Leave the command name blank to remove the default binding for a key (this is useful when adding multi-key bindings that conflict with a default).
fr: Écrase les raccourcis clavier dans les correspondances de touches. Pour entrer la touche, placer le focus dans la zone d'entrée et taper la combinaison de touches désirée. La commande est une de celle documentée dans Command Reference du manuel utilisateur, ou le nom de n'importe quel script utilisateur qui avait été chargé dans l'IDE. Laisser le nom de la commande vierge pour enlever le raccourci clavier par défaut pour une touche (c'est utile lors de l'ajout de raccourcis clavier multi-touches qui sont en conflit avec ceux par défaut).

source: Key
fr: Touches

source: Command
fr: Commande

source: Rectangle to use for the IDE work area on screen. All windows open within this area. Format is (x, y, width, height), or use None for full screen.
fr: Le rectangle à utiliser pour la zone de travail de l'IDE sur l'écran. Toutes les fenêtres s'ouvriront dans cette zone. Le format est (x, y, largeur, hauteur), ou utilisez None pour le plein écran.

source: Full Screen
fr: Plein écran

source: Height
fr: Hauteur

source: This Rectangle:
fr: Ce rectangle :

source: Width
fr: Largeur

source: Whether toolbar is shown in any window.
fr: La barre d'outils est affichée dans toutes les fenêtres.

source: Auto-Size
fr: Taille automatique

source: Tiny (Text Height)
fr: Mini (hauteur de texte)

source: Small
fr: Petite

source: Medium
fr: Moyenne

source: Large
fr: Grande

source: Extra Large
fr: Très grande

source: System Default
fr: Valeur par défaut

source: Sets size of the toolbar icons. By default, adjusts according to available space.
fr: Fixe la taille des icônes de la barre d'outils. Par défaut, elle est ajustée en fonction de l'espace disponible.

source: Adjust for Size
fr: Ajuster pour la taille

source: Icon Only
fr: Icônes seulement

source: Text Only
fr: Texte seulement

source: Icon and Text Below
fr: Icône et texte en dessous

source: Icon and Text to Side
fr: Icône et texte à côté
