Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_versioncontrol.po
Languages: ru

source: List of recent locations
ru: Список последних locations

source: Whether to display unregistered files in status displays
ru: Отображать ли незарегистрированные файлы в индикаторах состояния

source: Use Preference Settings
ru: Использовать Настройки Предпочтений

source: Disable
ru: Отключать

source: Enable and Configure Here
ru: Включить и настроить здесь

source: Configures VCS systems for this project
ru: Настройки системы VCS для этого проекта

source: _Annotate
ru: Пометить

source: Project Status
ru: Статус проекта

source: Commit Project
ru: Зафиксировать(Commit) Проект

source: Merge Entire Branch
ru: Слить Всю Ветку

source: Push Entire Branch
ru: Протолкнуть Всю Ветку

source: Add
ru: Добавить

source: Remove
ru: Удалить

source: Configure...
ru: Конфигурировать...

source: Merge entire branch
ru: Слияние всей ветки

source: Merge from
ru: Слить из

source: Merge
ru: Слияние

source: Push entire branch
ru: Протолкнуть(Push) целую ветвь

source: Push to
ru: Протолкнуть до

source: _Push
ru: Протолкнуть

source: Extra arguments to pass to every command.
ru: Дополнительные аргументы для передачи каждой команде.

source: CVS Update
ru: Обновление CVS

source: CVS Executable
ru: CVS Исполняемая команда

source: Extra Global Arguments
ru: Дополнительные глобальные аргументы

source: Checkout working copy
ru: Проверить рабочую копию

source: Checkout
ru: Проверка

source: Module
ru: Модуль

source: Missing module
ru: Отсутствует модуль

source: The module name must be specified
ru: Имя модуля должно быть указано

source: Use --porcelain output for git status
ru: Использовать --porcelain для вывода статуса git

source: _Project Status
ru: Статус проекта

source: C_ommit Project
ru: Зафиксировать Проект

source: List _Branches
ru: Список ветвей

source: S_witch Branch
ru: Переключатель Ветви

source: _Fetch Repository Changes
ru: Извлечение изменений в репозитории

source: P_ull Branch Changes
ru: Втянуть(Pull) Изменения Ветви

source: Pus_h Branch Changes
ru: Протолкнуть(Push) изменения в ветви

source: _Add
ru: Добавить

source: _Remove
ru: Удалить

source: %s Executable
ru: %s Исполняемый файл

source: Use --porcelain
ru: Использовать --porcelain

source: Failed to run git command
ru: Не удалось выполнить команду git

source: Could not find git working directory
ru: Не могу найти рабочий каталог git

source: Pull from repository
ru: Вытянуть(Pull) из репозитория

source: Pull from
ru: Вытянуть(Pull) из

source: _Pull
ru: Вытянуть

source: Branch name
ru: Имя Ветки

source: Working directory
ru: Рабочий каталог

source: _Switch Branch
ru: Переключить Ветку

source: Missing locations
ru: Отсутствующие места

source: Both the working directory and the branch must be specified
ru: Необходимо указать как рабочий каталог, так и ветку

source: Push branch to repository
ru: Отправить ветку в репозиторий

source: Fetch changes from repository
ru: Извлечение изменений из репозитория

source: Fetch from
ru: Извлечь из

source: _Fetch
ru: Извлечь

source: Don't find unregistered files when scanning for file status. This can substantially reduce the time to scan large repositories.
ru: Не просматривать незарегистрированные файлы при проверке состояния файла. Это может существенно сократить время сканирования больших хранилищ.

source: _Commit Project
ru: Пофиксить проект

source: P_ull Changes
ru: Вытянуть(Pull) Изменения

source: Up_date
ru: Обновить

source: _Merge
ru: Слияние (Merge)

source: Pu_sh Changes
ru: Протолкнуть(Push) Изменения

source: Remo_ve
ru: Удалить(Сбросить)

source: Don't Find Unregistered Files
ru: Не искать незарегистрированные файлы

source: Pull All Changes
ru: Втянуть(Pull) Все Изменения

source: Pull From
ru: Втянуть(Pull) из

source: Pull
ru: Втянуть(Pull)

source: Update
ru: Обновить

source: Push all changes
ru: Протолкнуть(Push ) все изменения

source: Cannot find single hg working directory root
ru: Не удается найти корневой рабочий каталог hg

source: Perforce Sync
ru: Принудительная Синхронизация

source: Perforce
ru: Принудительно

source: Perforce Executable
ru: Принудительно Выполнить

source: Executable command to run svn
ru: Исполняемая команда для запуска svn

source: SVN Update
ru: Обновление SVN

source: SVN Executable
ru: SVN Исполняемая команда

source: SVN Admin Executable
ru: SVN Admin Исполняемая команда

source: Tools
ru: Инструменты

source: Window
ru: Окно

source: Help
ru: Справка

source: Auto-refresh %s Status
ru: Автообновление %s Статус

source: No %s %s
ru: Нет %s %s

source: %(identifier)s does not support a %(name)s command. The files were %(past_tense)s on disk, but new files and directories were not added and version control history was not copied.
ru: %(identifier)s не поддерживает команду %(name)s. Файлы были %(past_tense)s на диске, но новые файлы и каталоги не были добавлены и история управления версиями не была скопирована.

source: Failed to inspect remote files
ru: Не удалось проверить удаленные файлы

source: Enable the integrated version control system.
ru: Включите интегрированную систему контроля версий.

source: Save without prompting before running version control commands.
ru: Сохранить без запроса перед выполнением команд управления версиями.

source: Maximum number of completed commands to store in the version control tool.
ru: Максимальное количество завершенных команд для хранения в инструменте управления версиями.

source: Watch disk for version control changes and refresh the Project view and Project Status accordingly.
ru: Отслеживать диск для изменений контроля версий и обновлять представление проекта и состояние проекта соответственно.

source: Track file add, remove, and rename operations made with Wing's Project view into the version control repository.
ru: Отслеживание операций добавления, удаления и переименования файлов, выполненных с помощью представления "Проект Wing", в хранилище управления версиями.

source: Log all commands to ide.log in the user settings directory.
ru: Запись всех команд в ide.log в каталог пользовательских настроек.

source: Always Active
ru: Всегда Активен

source: Active if used by project directories
ru: Активен, если используется каталогами проекта

source: Not active
ru: Не активен

source: Active
ru: Активный

source: [command terminated]
ru: [команда завершена]

source: Executable command to run %s
ru: Исполняемая команда для запуска %s

source: When %s version control support is active
ru: Когда %s поддержка управления версиями активна

source: History of remote locations
ru: История удаленных местоположений

source: Cannot commit because the commit message is empty
ru: Не удается зафиксировать (commit) , так как сообщение фиксации пусто

source: Save without _prompting
ru: Сохранить без запроса

source: Commit selected files
ru: Зафиксировать(Commit ) выбранные файлы

source: Commit all project files
ru: Зафиксировать(Commit) все файлы проекта

source: Show differences between files in working directory and last committed version
ru: Показать различия(differences) между файлами в рабочем каталоге и последней зафиксированной версией

source: View status for entire project
ru: Просмотр состояния всего проекта

source: Show preferences page for selected VCS
ru: Показать страницу настроек для выбранного VCS

source: View status of the selected files in the working directory
ru: Просмотр состояния выбранных файлов в рабочем каталоге

source: Revert selected files
ru: Восстановить выбранные файлы

source: Discard Changes in Files?
ru: Отменить изменения в файлах?

source: Are you sure you want to discard your changes to %s and revert to the current state on this branch in %s?
ru: Вы действительно хотите отменить свои изменения в %s и вернуться к текущему состоянию в этой ветке в %s?

source: Show blame / praise / annotate for selected files
ru: Показать blame / praise / annotate для выбранных файлов

source: Add the files to %(label)s
ru: Добавьте файлы в %(label) s

source: Remove files
ru: Удалить файлы

source: Remove Files?
ru: Удалить файлы?

source: Are you sure you want to remove the following? %s
ru: Вы действительно хотите удалить следующее? %s

source: Ou_tput
ru: Результат

source: Cance_l
ru: Отмена

source: Run Again
ru: Запустить еще раз

source: Failed to run: %s</span>
ru: Не удалось запустить: %s</span>

source: Goto Source
ru: Перейти к источнику

source: Copy
ru: Копия

source: Select All
ru: Выбрать все

source: C_onsole
ru: Консоль

source: _Copy
ru: Копировать

source: Select _All
ru: Выбрать Все

source: Failed to find source
ru: Не удалось найти источник

source: Failed to find filename in diff output
ru: Не удалось найти имя файла для сравнения файлов

source: Hide Unregistered
ru: Скрыть Незарегистрированные

source: Show Unregistered
ru: Показать Незарегистрированный

source: View as List
ru: Просмотреть как список

source: View as Tree
ru: Посмотреть как дерево

source: No modified files
ru: Нет измененных файлов

source: No %s files in project
ru: Нет файлов %s в проекте

source: _Output
ru: Вывести

source: Status
ru: Статус

source: Auto-refresh
ru: Автообновление

source: Refresh
ru: Обновление

source: Running status
ru: Рабочее состояние

source: _Message
ru: Сообщение

source: _Diffs
ru: Разница (сравнение)

source: _Files
ru: Файлы

source: _Commit
ru: Фиксировать

source: Nothing to commit
ru: Нечего Фиксировать

source: Committing
ru: Фиксировать изменения

source: Commit succeeded
ru: Фиксация выполнена успешно

source: Commit failed
ru: Ошибка коммита

source: Command completed: Output displayed in scratch editor.
ru: Команда завершена: Результат отображается во временном редакторе.

source: _Locations
ru: Местоположение

source: Repository
ru: Репозиторий

source: Both the repository and the working directory must be specified
ru: Необходимо указать как репозиторий, так и рабочий каталог

source: Configure %s
ru: Конфигурировать %s

source: Display Documentation
ru: Показать документацию

source: Show Scope
ru: Показать Область

source: Hide Scope
ru: Скрыть Область

source: Show Console
ru: Показать Консоль

source: Hide Console
ru: Скрыть Консоль
