Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_diff.po
Languages: fr

source: Diff/Merge
fr: Diff/fusion

source: Difference and Merge
fr: Différence et fusion

source: Wrapped to diff number %i
fr: Emballé au numéro de différence %i

source: Displaying diff number %i
fr: Affiche le numéro de différence %i

source: Diff/merge panel state
fr: État du panneau Diff/fusion

source: Dummy
fr: Factice

source: %s Lines
fr: %s lignes

source: Changed
fr: Modifié

source: Compare Failed
fr: Comparaison échouée

source: No Differences Found
fr: Pas de différences trouvées

source: One or more diff/merge sessions are now empty because white space differences are being ignored.
fr: Une ou plusieurs sessions de diff/fusion sont vides maintenant car les différences d'espaces blancs sont ignorées.

source: Failed to set up the diff session
fr: Échec pour établir la session de différence

source: Diff Failed::Diff failed: %s
fr: Différences échouées::Différences échouées : %s

source: Compare to Repositor_y
fr: Comparer au _dépôt

source: Compare to Directory...
fr: Comparer au répertoire...

source: Compare to File...
fr: Comparer au fichier...

source: There are no differences
fr: Il n'y a pas de différences

source: Session Contains Only White Space Changes
fr: La session contient seulement des modifications d'espaces blancs

source: This diff/merge session contains only white space changes but white space is being ignored.
fr: Cette session de diff/fusion contient uniquement des modifications d'espaces blancs mais ceux-ci sont actuellement ignorés.

source: Don't show this message again
fr: Ne pas afficher ce message à nouveau

source: Create Directories?
fr: Créer des répertoires ?

source: The enclosing directories for this file do not exist but must be created before performing this merge. Should Wing create the following directories or cancel the merge operation?
fr: Les répertoires inclus pour ce fichier n'existent pas mais doivent être créés avant d'effectuer cette fusion. Est-ce que Wing doit créer les répertoires suivants ou annuler l'opération de fusion ?

source: Line %s: Changed %s Lines%s
fr: Ligne %s : %s ligne(s) modifiée(s)%s

source: Line %s: Deleted %s Lines%s
fr: Ligne %s : %s ligne(s) supprimée(s)%s

source: Line %s: Inserted %s Lines%s
fr: Ligne %s : %s ligne(s) Insérée(s)%s

source: Terminate Diff/Merge Session
fr: Terminer la session de Diff/fusion

source: Lock Scrolling
fr: Bloquer le défilement

source: Ignore Whitespace
fr: Ignorer les espaces blancs

source: Could not open one or both editors
fr: N'a pas pu ouvrir un ou les deux éditeurs

source: Revision
fr: Révision

source: %s does not exist
fr: %s n'existe pas

source: %s is not a directory
fr: %s n'est pas un répertoire

source: %s is not a file
fr: %s n'est pas un fichier

source: Changes
fr: Modifications

source: Filename
fr: Nom de fichier

source: Could not find version control system for %s
fr: N'a pas pu trouver un système de contrôle de version pour %s

source: Version control system determination still pending for %s
fr: Détermination du système de contrôle de version encore en attente pour %s

source: Could not obtain revision information from %s
fr: N'a pas pu obtenir d'information de révision depuis %s

source: No Differences::There are no differences in directory %s
fr: Pas de différences::Il n'y a pas de différences dans le répertoire %s

source: Disk File: %s
fr: Fichier du disque : %s

source: Version control system determination still in progress for %s
fr: Détermination du système de contrôle de version encore en progression pour %s

source: Fetching revision...
fr: Apporte la révision...

source: Failed to inspect %s
fr: Échec d'inspection de %s

source: Encoding Error::The encoding of the differences received from the version control system does not seem to match the file's encoding (%s). Unidentifiable characters have been replaced with '?'
fr: Erreur d'encodage::L'encodage des différences reçues depuis le système de contrôle de révisions ne semble pas correspondre à l'encodage du fichier (%s). Les caractères non identifiables ont été remplacés avec '?'

source: No differences::There are no differences in %s
fr: Pas de différences::Il n'y a pas de différences dans %s

source: Side by Side
fr: Côte à côte

source: Top and Bottom
fr: Haut et bas

source: Orientation of difference/merge views: Side-by-side or top/bottom
fr: Orientation des vues de différence/fusion : côte a côte ou haut/bas

source: Controls whether scrolling of the diff/merge editors is locked to synchronize the editor scroll positions.
fr: Contrôle que le défilement des éditeurs de diff/fusion est verrouillé pour synchroniser les positions de défilement d'éditeur.

source: Controls whether differences will ignore changes that alter white space only.
fr: Contrôle si les différences ignoreront les modifications qui altèrent uniquement des espaces blancs.

source: Controls whether to warn when changing white space filtering causes sessions to become empty of changes.
fr: Contrôle l'avertissement lors du changement du filtrage d'espaces blancs qui provoque des sessions sans modifications.
