Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_proj.po
Languages: fr, ru

source: Interpreter:
fr: Interpréteur :
ru: Интерпретатор:

source: Effective Python Path:
fr: Chemin Python effectif :
ru: Эффективный Путь Python:

source: Change Settings
fr: Modifier les paramètres
ru: Изменить настройки

source: Close
fr: Fermer
ru: Закрыть

source: Python Environment
fr: Environnement Python
ru: Python Окружение

source: <untitled>
fr: <sans-titre>
ru: <неозаглавленный >

source: <not found>
fr: <non trouvé>
ru: <не найдено>

source: These settings are being determined by the configured environment for the main entry point "%s". Use the button below to alter settings for that named entry point.
ru: Эти настройки определяются настройками среды для основной точки входа "%s". Используйте кнопку ниже, чтобы изменить настройки для этой именованной точки входа.

source: The list of files in the project
fr: La liste des fichiers dans le projet
ru: Список файлов в проекте

source: The list of directories in the project
fr: La liste des répertoires dans le projet
ru: Список каталогов в проекте

source: The type of project file: shared or unshared
fr: Le type de fichier projet : partagé ou non partagé
ru: Тип файла проекта: общий или незащищенный

source: Arguments to pass to the Python interpreter when debugging. The default -u provides for unbuffered output; prompts for keyboard input may not appear without this option.
fr: Arguments à passer à l'interpréteur Python lors du débogage. Le -u par défaut est fourni pour les sorties sans mise en mémoire tampon ; invite pour les entrées clavier pourraient ne pas apparaître sans cette option.
ru: Аргументы для передачи интерпретатору Python при отладке. По умолчанию -u обеспечивает небуферизованный вывод; подсказки для ввода с клавиатуры могут не отображаться без этой опции.

source: Command to execute before running the debug process.
fr: Commande à exécuter avant de lancer le processus de débogage.
ru: Команда для выполнения перед запуском процесса отладки.

source: The environment to use by default when debugging or executing this file. Either use the project-defined environment with given run args or select a launch configuration.
ru: Среда, используемая по умолчанию при отладке или выполнении этого файла. Используйте среду, определяемую проектом, с заданными параметрами запуска или выберите конфигурацию запуска.

source: Environment variables to set before running the debug process or other sub-processes started from Wing. Some tools, such as the Snippets tool also use the environment specified here. Entries are in "name=value" format, one per line. Use "name=" (without a value) to unset and remove an inherited environment value.
fr: Variables d'environnement à fixer avant le lancement du processus de débogage ou des sous-processus démarrés depuis Wing. Certains outils, comme l'outil Bouts de code utilisent aussi l'environnement spécifié ici. Les entrées sont dans le format "name=value", une par ligne. Utiliser "name=" (sans valeur) pour désactiver et retirer la valeur héritée d'environnement.
ru: Переменные среды, которые нужно задать перед запуском процесса отладки или других подпроцессов, запущенных из Wing. Некоторые инструменты, например инструмент Фрагменты, также используют заданную здесь среду. Записи д.б. в формате "имя = значение", по одному на строку. Используйте "name=" (без значения), чтобы отменить и удалить унаследованное значение среды.

source: The base directory for the project. This overrides the project file location as the directory on which to base relative paths shown in the Project view and elsewhere. It is also used as the directory in which the Python Shell subprocess is launched and for the starting directory when the Default Directory Policy preference is set to Current Project.
ru: Базовый каталог для проекта. Переопределяет расположение файла проекта как каталог, в котором должны основываться относительные пути, показанные в представлении проекта и в другом месте. Он также используется в качестве каталога, в котором запущен подпроцесс оболочки Python, и для начального каталога, когда параметром Политики Каталогов по Умолчанию установлен текущий проект.

source: The main entry point for debugging, either a Python file or a named entry point. When not specified, debugging starts in the current file in the environment specified in its File Properties under Debug/Execute.
ru: Основная точка входа для отладки - файла Python, либо именованной точки входа. Если не указано, отладка начинается в текущем файле в среде, указанной в Свойствах Файла в разделе «Отладка/Выполнение».

source: Use Preferences Setting
fr: Utiliser les paramètres des préférences
ru: Использовать Настройки Свойств

source: Always Debug Child Processes
fr: Toujours déboguer les process enfant
ru: Всегда Отлаживать Дочерние Процессы

source: Never Debug Child Processes
fr: Jamais déboguer les process enfant
ru: Никогда не отлаживать дочерние процессы

source: Controls whether to automatically debug child processes spawned by a debug process.
ru: Определяет, следует ли автоматически отлаживать дочерние процессы, порожденные процессом отладки.

source: Used internally to track the project type at creation time.
ru: Используется внутренне для отслеживания типа проекта во время создания.

source: A list of modifications to the default set of attributes that are stored in the project files's shared layer (*.wpr). Each item is +package.attrib-name to add a shared attrib or -package.attrib-name to move an attrib to the per-user file (*.wpu) so it is not shared with other users.
ru: Список изменений набора атрибутов по умолчанию, которые хранятся в общем слое файлов проекта (*.wpr). Каждый элемент + package.attrib-name, чтобы добавить общий атрибут или -package.attrib-name, чтобы переместить атрибут файла для каждого пользователя (* .wpu), чтобы он не использовался совместно с другими пользователями.

source: Line Feed \n (Posix/Unix/OS X)
fr: Saut de ligne \n (Posix/Unix/OS X)
ru: Перевод Строки \n (Posix/Unix/OS X)

source: Carriage Return \r (Mac OS <=9)
fr: Retour chariot \r (Mac OS <= 9)
ru: Возврат Каретки \r (Mac OS <=9)

source: Carriage Return and Line Feed \r\n (Windows)
fr: Retour chariot et saut de ligne \r\n (Windows)
ru: Возврата каретки и перевода строки \r\n (Windows)

source: Preferred line ending style to use with this project. This overrides the default line ending set in preferences.
fr: Utiliser le style de fin de ligne préféré avec ce projet. Cela écrase la fin de ligne par défaut fixée dans préférences.
ru: Предпочтительный стиль окончания строки для использования в этом проекте. Переопределяет конец строки по умолчанию, заданный в настройках.

source: Ignore Conflicts
fr: Ignorer les conflits
ru: Игнорировать Конфликты

source: Warn About Conflicts
fr: Avertir sur les conflits
ru: Предупреждать О Конфликтах

source: Auto-convert on Open
fr: Auto-conversion à l'ouverture
ru: Автопреобразование при открытии

source: Policy for treating files that are opened if the line endings in the file do not match the preferred line ending style
fr: Politique pour traiter les fichiers qui sont ouverts si les fins de ligne dans le fichier ne correspondent pas au style préféré de fin de ligne
ru: Политика обработки файлов при открытии, если окончание строки в файле не соответствует предпочитаемому стилю окончания строки

source: Spaces Only
fr: Espaces uniquement
ru: Только пробелы

source: Tabs Only
fr: Tabulations uniquement
ru: Только Табуляция

source: Mixed Tabs and Spaces
fr: Tabulations et espaces mixés
ru: Смесь Табуляций и Пробелов

source: Preferred indentation style to use with this project. This overrides the default indentation style set in preferences.
fr: Style d'indentation préféré à utiliser avec ce projet. Cela écrase le style d'indentation par défaut fixé dans les préférences.
ru: Предпочтительный стиль отступов для использования с этим проектом. Переопределяет стиль отступов по умолчанию, заданный в настройках.

source: Policy for treating files that are opened if the indent style in the file does not match the preferred indent style
fr: Politique pour traiter les fichiers qui sont ouverts si les styles d'indents dans le fichier ne correspondent pas au style préféré d'indent
ru: Политика обработки файлов при открытии, если стиль отступа в файле не соответствует предпочитаемому стилю отступа

source: Controls whether to automatically strip trailing white space in the editor. May be enabled for all files or only files that are part of the project.
ru: Определяет, следует ли автоматически удалять пробелы в конце строк в редакторе. Может быть включено для всех файлов или только тех, которые являются частью проекта.

source: Use Preference Setting
fr: Utiliser les paramètres des préférences
ru: Использовать Настройки Параметров

source: The default encoding to use for text files opened in the source editor and other tools, when an encoding for that file cannot be determined by reading the file. Other encodings may also be tried. This also sets the encoding to use for newly created files.
fr: L'encodage par défaut à utiliser pour les fichiers texte ouvert dans l'éditeur de sources et les autres outils, quand un encodage pour ce fichier ne peut pas être déterminé en lisant le fichier. D'autres encodages pourrant aussi être essayés. Cela fixe aussi l'encodage à utiliser pour les nouveaux fichiers créés.
ru: Кодировка по умолчанию для текстовых файлов, открытых в исходном редакторе и других инструментах, когда кодировка для этого файла не может быть определена путем чтения файла. Другие кодировки также могут быть опробованы. Также устанавливает кодировку для вновь создаваемых файлов.

source: Enables Zope2/Plone support
fr: Active le support de Zope2/Plone
ru: Включает поддержку Zope2/Plone

source: Enables checking for and offering to auto-add files when a new Zope Home is set
ru: Включает проверку и предложение для автоматического добавления файлов при установке нового Zope Home

source: Zope2 instance directory (or Zope installation for Zope 2.6.x and earlier). When altered, Wing will check and offer to install WingDBG, the debugger support product.
fr: Le répertoire d'instance Zope2 (ou l'installation Zope pour Zope 2.6.x et précédent). Lorsque modifié, Wing vérifiera et proposera d'installer WingDBG, le produit de support du débogueur.
ru: Каталог экземпляра Zope2 (или установка Zope для Zope 2.6.x и более раних). При изменении Wing проверит и предложит установить WingDBG, продукт поддержки отладчика.

source: Zope2 host (if remote). This is used to find the Debugger / Local/Remote / Location Map value to use on file names read from the zope.conf file. It should be left blank if your Zope instance is on the same machine as Wing.
fr: Hôte Zope2 (si distant). C'est utilisé pour trouver la valeur Débogueur / Externe/Distant / Carte de localisation à utiliser sur les noms de fichier lus depuis le fichier zope.conf. Ce doit être laissé blanc si votre instance Zope est sur la même machine que Wing.
ru: Хост Zope2 (если удаленный). Используется для определения значения параметра Debugger/Local/Remote/Location Map для использования в именах файлов, считанных из файла zope.conf. Он должен быть пустым, если ваш экземпляр Zope находится на той же машине, что и Wing.

source: Enable debugging of Django template files, so setting breakpoints, stepping, and viewing data will work in template files as well as Python code.
fr: Activer le débogage des fichiers de modèles Django, de placer des points d'arrêts, avancer pas à pas, et voir les données qui fonctionneront dans les fichiers modèles comme dans le code Python.
ru: Включите отладку файлов шаблонов Django, чтобы настройка точек останова, пошагового выполнения и просмотра данных работала в файлах шаблонов, а также в коде Python.

source: A container in which scripts can store information in the project file.
fr: Un conteneur dans lequele les scripts peuvent stocker des informations dans le fichier du projet.
ru: Контейнер, в котором скрипты могут хранить информацию в файле проекта.

source: Determines the TCP/IP port on which the IDE will listen for the connections from externally launched debug processes. This needs to be unique for each IDE instance running on a host. The externally launched debug process needs to be told the value specified here using kWingHostPort inside wingdbstub.py or by WINGDB_HOSTPORT environment variable before importing wingdbstub in the debug process.
ru: Определяет порт TCP/IP, на котором IDE будет прослушивать соединения из процессов отладки, запускаемых извне. Это должно быть уникальным для каждого экземпляра IDE, запущенного на хосте. В процессе отладки с внешним запуском должно быть указано значение, указанное здесь, с использованием функции kWingHostPort внутри wingdbstub.py или переменной WINGDB_HOSTPORT перед импортом wingdbstub в процесс отладки.

source: _Sort Alphabetically
fr: Trier Alphabétiquement
ru: Сортировать по алфавиту

source: Sort items alphabetically rather than in the order found in the file
fr: Ranger les items alphabétiquement plutôt que dans l’ordre trouvé dans le fichier
ru: Сортировать элементы в алфавитном порядке, а не в порядке, найденном в файле

source: Include _Args in Search
ru: Включать аргументы в поиск

source: Include the text of function arguments in the text on which to search
ru: Включить текст аргументов функции в текст для поиска

source: Click to open recent projects
fr: Cliquer pour ouvrir les projets récents
ru: Нажмите, чтобы открыть последние проекты

source: _Options
ru: Опции

source: Follow Selection
fr: Suivre la sélection
ru: Следить за выбранным

source: Follow Current Editor
fr: Suivre l'éditeur courant
ru: Следить в Текущем Редакторе

source: View As Tree
fr: Voir comme une Arborescence
ru: Посмотреть Как Дерево

source: View As Flattened Tree
fr: Voir comme une Arborescence Aplatie
ru: Вид Как Уплощенное Дерево

source: When checked, the project selection is visited in a non-sticky editor that auto-closes when hidden. Double clicking always opens a sticky file for editing.
fr: Lorsque coché, la sélection du projet est visitée dans un éditeur temporaire qui se ferme automatiquement lorsqu'elle est cachée. Double cliquer ouvre toujours un fichier permanent pour l'éditer.
ru: Если этот флажок установлен, выбор проекта просматривается в не липком редакторе, который автоматически закрывается при скрытии. Двойной щелчок всегда открывает липкий файл для редактирования.

source: When checked, project tree expansion is automatically changed to show the file in the current editor.
fr: Lorsque coché, l'expansion de l'arbre projet est automatiquement changée pour afficher le fichier de l'éditeur actuel.
ru: Если флажок установлен, расширение дерева проектов автоматически изменяется для отображения файла в текущем редакторе.

source: Sort By Name
fr: Trier par nom
ru: Сортировать по Имени

source: Sort By Mime Type
fr: Trier par type Mime
ru: Сортировка По Mime-Типу

source: Sort By Extension
fr: Trier par extension
ru: Сортировать По Расширению

source: List Files Before Directories
fr: Lister les fichiers avant les répertoires
ru: Список Файлов Перед Каталогами

source: Show Project _Documentation
fr: Afficher la _documentation du projet
ru: Показать документацию проекта

source: Project: %s%s [%i files / %i dirs]
fr: Projet : %s%s [%i fichier(s) / %i répertoire(s)]
ru: Проект: %s%s [%i files / %i dirs]

source: Project
fr: Projet
ru: Проект

source: Project Manager
fr: Gestionnaire de projets
ru: Менеджер проекта

source: Project: <none>
fr: Projet : <aucun>
ru: Проект: <none>

source: Project: %s
fr: Projet : %s
ru: Проект: %s

source: Project panel state
fr: Panneau d'état du projet
ru: Состояние панели проекта

source: Directory P_roperties...
fr: Propriétés du répertoire...
ru: Свойства Каталога...

source: File P_roperties...
fr: P_ropriétés du fichier...
ru: Свойства Файла...

source: _Copy Filenames
fr: _Copier les noms de fichiers
ru: Копировать Имена Файлов

source: Show in Explorer
fr: Afficher dans l'Explorateur
ru: Показать в проводнике

source: Show in Finder
fr: Afficher dans le Finder
ru: Показать в поисковике

source: Show Directory
fr: Afficher le répertoire
ru: Показать каталог

source: Open in External _Viewer
fr: Ouvrir dans le _visionneur externe
ru: Открыть во внешнем средстве просмотра

source: _Search in Selected
fr: _Chercher dans la sélection
ru: Поиск в выбранном

source: _Name Selected File Set...
fr: _Nommer l’Ensemble de fichiers sélectionné…
ru: Имя Выбранного Набора Файлов...

source: _Debug Selected
fr: _Déboguer la sélection
ru: Отладка выбранного

source: E_xecute Selected
fr: E_xécuter la sélection
ru: Выполнить выбранное

source: Re_move/Exclude From Project
fr: Enl_ever/Exclure du projet
ru: Удалить/Исключить Из Проекта

source: _Add Existing File...
fr: _Ajouter un fichier existant...
ru: Добавить Существующий Файл...

source: Add Existing D_irectory...
fr: Ajouter un _répertoire existant...
ru: Добавить Существующий Каталог...

source: Res_can Directory
fr: Res_canner le répertoire
ru: Повторное Сканирование Каталога

source: Dele_te
fr: Suppri_mer
ru: Удалить

source: Move To _Trash
fr: Déplacer vers la _corbeille
ru: Переместить В Корзину

source: Renam_e...
fr: Renomm_er...
ru: Переименовать...

source: _Create New File...
fr: _Créer un nouveau fichier...
ru: Создать новый файл...

source: Create Ne_w Directory...
fr: Créer un nou_veau répertoire...
ru: Создать новый каталог...

source: Create Ne_w Package...
fr: Créer un nou_veau Package...
ru: Создать новый пакет...

source: Configure Menu...
fr: Configurer le menu...
ru: Настройка Меню...

source: Project File
fr: Fichier projet
ru: Файл проекта

source: New name for the directory
fr: Nouveau nom pour le répertoire
ru: Новое имя для каталога

source: New Directory Name
fr: Nouveau nom de répertoire
ru: Имя нового каталога

source: New name for the file
fr: Nouveau nom pour le fichier
ru: Новое имя файла

source: New File Name
fr: Nouveau nom de fichier
ru: Новое имя файла

source: Move to Trash Failed
fr: Échec de déplacement vers la corbeille
ru: Ошибка перемещения в корзину

source: The following items could not be moved to the trash:
fr: Les éléments suivants ne peuvent pas être déplacés dans la corbeille :
ru: Следующие элементы не удалось переместить в корзину:

source: Recycle Selected Files and Directories?
fr: Recycler les fichiers et répertoires sélectionnés ?
ru: Утилизировать выбранные файлы и каталоги?

source: Are you sure you want to move the selected files, directories, and all contents of the directories to the recycling bin?
fr: Êtes-vous sûr de vouloir déplacer les fichiers, les répertoires sélectionnés et tous les fichiers contenus dans ceux-ci vers la corbeille ?
ru: Вы уверены, что хотите переместить выбранные файлы, папки, и все содержимое директории в корзину?

source: _Recycle Selected Files and Directories
fr: _Recycler les fichiers et répertoires sélectionnés
ru: Утилизация выбранных файлов и каталогов

source: Move Selected Files and Directories to Trash?
fr: Déplacer les fichiers et répertoires sélectionnés vers la corbeille ?
ru: Переместить выбранные файлы и каталоги в корзину?

source: Are you sure you want to move the selected files, directories, and all contents of the directories to the trash?
fr: Êtes-vous sûr de vouloir déplacer les fichiers, répertoires, et tous les contenus de tous les répertoires sélectionnés vers la corbeille ?
ru: Вы уверены, что хотите переместить выбранные файлы, папки, и все содержимое директории в корзину?

source: _Move Selected Files and Directories to Trash
fr: _Déplacer les fichiers et répertoires sélectionnés vers la corbeille
ru: Переместить выбранные файлы и каталоги в корзину

source: Recycle Selected Files?
fr: Recycler le(s) fichier(s) sélectionné(s) ?
ru: Утилизировать Выбранные Файлы?

source: Are you sure you want to move the selected files to the recycling bin?
fr: Êtes-vous sûr de vouloir déplacer le(s) fichier(s) sélectionné(s) vers la corbeille ?
ru: Вы уверены, что хотите переместить выбранные файлы в корзину?

source: _Recycle Selected Files
fr: _Recycler le(s) fichier(s) sélectionné(s)
ru: Утилизировать Выбранные Файлы

source: Move Selected Files to Trash?
fr: Déplacer le(s) fichier(s) sélectionné(s) dans la corbeille ?
ru: Переместить выбранные файлы в корзину?

source: Are you sure you want to move the selected files to the trash?
fr: Êtes-vous sûr de vouloir déplacer le(s) fichier(s) sélectionné(s) vers la corbeille ?
ru: Вы уверены, что хотите переместить выбранные файлы в корзину?

source: _Move Selected Files to Trash
fr: _Déplacer le(s) fichier(s) sélectionné(s) vers la corbeille
ru: Переместить выбранные файлы в корзину

source: Recycle Selected Directories?
fr: Recycler les répertoires sélectionnés ?
ru: Утилизировать Выбранные Каталоги?

source: Are you sure you want to move the selected directories and all files within them to the recycling bin?
fr: Êtes-vous sûr de vouloir déplacer les répertoires sélectionnés et tous les fichiers contenus dans ceux-ci vers la corbeille ?
ru: Вы уверены, что хотите переместить выбранные каталоги и все файлы в них в корзину?

source: _Recycle Selected Directories
fr: _Recycler les répertoires sélectionnés
ru: Перезапуск Выбранных Каталогов

source: Move Selected Directories to Trash?
fr: Déplacer les répertoires sélectionnés vers la corbeille ?
ru: Переместить выбранные каталоги в корзину?

source: Are you sure you want to move the selected directories and all files within them to the trash?
fr: Êtes-vous sûr de vouloir déplacer les répertoires sélectionnés et tous les fichiers qui y sont inclus vers la corbeille ?
ru: Вы уверены, что хотите переместить выбранные каталоги и все файлы в них в корзину?

source: _Move Selected Directories to Trash
fr: _Déplacer les répertoires sélectionnés vers la corbeille
ru: Переместить выбранные каталоги в корзину

source: _Cancel
fr: _Annuler
ru: Отмена

source: Serious error writing the user branch of project file %s: File may be corrupted. Please report this problem to support@wingware.com
fr: Erreur sérieuse en écrivant la branche utilisateur du fichier projet %s : Le fichier peut être corrompu. Veuillez reporter ce problème à support@wingware.com
ru: Серьезная ошибка при записи пользовательской ветви файла проекта %s: файл может быть поврежден. Пожалуйста, сообщите об этой проблеме support@wingware.com

source: Failed to write parts of the user branch of the project file:
ru: Не удалось записать части пользовательской ветви файла проекта:

source: Move Selected Files?
fr: Déplacer le(s) fichier(s) sélectionné(s) ?
ru: Переместить Выбранные Файлы?

source: Are you sure you want to move the following items to %s ?
fr: Êtes-vous sûr de vouloir déplacer les éléments suivants vers %s ?
ru: Вы уверены, что хотите переместить следующие элементы в %s ?

source: Copy Selected Files?
fr: Copier le(s) fichier(s) sélectionné(s) ?
ru: Копировать Выбранные Файлы?

source: Are you sure you want to copy the following items to %s ?
fr: Êtes-vous sûr de vouloir copier les éléments suivants vers %s ?
ru: Вы уверены, что хотите скопировать следующие элементы в %s ?

source: Cancel
fr: Annuler
ru: Отмена

source: _Don't show this dialog again
fr: _Ne plus afficher cette notice à nouveau
ru: Не показывать этот диалог еще раз.

source: main entry point
fr: point d’entrée principal
ru: главная точка входа

source: . (project home directory)
fr: . (répertoire du projet initial)
ru: . (домашний каталог проекта)

source: Choose file to create
fr: Choisir le fichier à créer
ru: Выберите файл для создания

source: Select file to add to project
fr: Sélectionnez un fichier à ajouter au projet
ru: Выберите файл для добавления в проект
