Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_proj.po
Languages: fr, ru

source: Remote Inspect Failed::The selected directory %s remote inspect failed and has not been added to the project
ru: Ошибка удаленной проверки:: ошибка удаленной проверки выбранного каталога %s, который не был добавлен в проект

source: Does not Exist::The selected directory %s does not exist and has not been added to the project
ru: Не существует:: выбранный каталог %s не существует и не был добавлен в проект

source: Select Directory to Remove
fr: Sélectionner le répertoire à enlever
ru: Выберите каталог для удаления

source: Invalid selection
fr: Sélection invalide
ru: Недопустимый выбор

source: Sorry, %s is not a directory.
fr: Désolé, %s n'est pas un répertoire.
ru: К сожалению, %s не является каталогом.

source: Cannot Copy Files
fr: Impossible de copier les fichiers
ru: Не Удается Скопировать Файлы

source: %s::Remote inspect of %s failed.
ru: %s::Удаленный осмотр %s не удался.

source: %s::The directory %s already exists. Please remove or rename it first.
fr: %s::Le répertoire %s existe déjà. Veuillez le retirer ou le renommer en premier.
ru: %s::Каталог %s уже существует. Сначала удалите или переименуйте его.

source: Cannot Move Files
fr: Impossible de déplacer les fichiers
ru: Невозможно Переместить Файлы

source: Replace existing files?
fr: Remplacer les fichiers existant ?
ru: Заменить существующие файлы?

source: The following files already exist. Do you want to replace the selected files?
fr: Le(s) fichier(s) suivant(s) existe(nt) déjà. Voulez vous remplacer le(s) fichier(s) sélectionné(s) ?
ru: Следующие файлы уже существуют. Вы хотите заменить выбранные файлы?

source: Could not inspect remote target file
ru: Не удалось проверить удаленный целевой файл

source: Target file already exists
fr: Le fichier cible existe déjà
ru: Целевой файл уже существует

source: Could not Move
fr: N'a pas pu déplacer
ru: Не удалось переместить

source: Some of the selected items could not be moved on disk. Please check their permissions and try again.
fr: Certains des éléments sélectionnés ne pourront pas être déplacés sur le disque. Veuillez vérifier leurs permissions et essayer de nouveau.
ru: Некоторые из выбранных элементов не удалось переместить на диск. Проверьте их разрешения и повторите попытку.

source: Could not Copy
fr: N'a pas pu copier
ru: Не удалось скопировать

source: Some of the selected items could not be copied on disk. Please check their permissions and try again.
fr: Certains des éléments sélectionnés ne pourront pas être copiés sur le disque. Veuillez vérifier leurs permissions et essayer de nouveau.
ru: Некоторые из выбранных элементов не могут быть скопированы на диск. Проверьте их разрешения и повторите попытку.

source: Errors:
fr: Erreurs :
ru: Ошибки:

source: Open Project
fr: Ouvrir un projet
ru: Открыть проект

source: Select project to open
fr: Sélectionner un projet à ouvrir
ru: Выберите проект для открытия

source: Converting project...
fr: Convertit le projet...
ru: Преобразовать проект...

source: Project Conversion Options
fr: Options de Conversion du projet
ru: Параметры Преобразования Проекта

source: Would you like to convert this project to use the new auto-updating directory style available in Wing 3+? Doing so may include more files than were shown in your Wing 2.x project display. Alternatively, you may convert the project as a static list of files. You will be able to modify the project contents after conversion in either case. The converted project will be opened as a new untitled project.
ru: Вы хотите преобразовать этот проект, чтобы использовать новый стиль каталога автоматического обновления, доступный в Wing 3+? Это может включать в себя больше файлов, чем было показано в Вашем Wing 2.x отображение проекта. Также можно преобразовать проект в статический список файлов. Вы сможете изменить содержимое проекта после преобразования в любом случае. Преобразованный проект будет открыт как новый проект без названия.

source: Creating project instance...
fr: Création d'une instance de projet...
ru: Создание экземпляра проекта...

source: Close prior project...
fr: Fermeture du projet antérieur...
ru: Закрыть предыдущий проект...

source: Project opened
fr: Projet ouvert
ru: Проект открыт

source: Reading project...
fr: Lit le projet...
ru: Чтение проекта...

source: Failed to load project
fr: Le chargement du projet a échoué
ru: Не удалось загрузить проект

source: Could not open project file '%s': it may be unreadable or in an invalid file format. Try opening it from the File menu to inspect the contents of the file.
fr: N'a pas pu ouvrir le fichier projet '%s' : ce peut être illisible ou un format de fichiers invalide. Essayez de l'ouvrir depuis le menu Fichier pour inspecter le contenu du fichier.
ru: Не удалось открыть файл проекта '%s': Возможно он нечитаемый или имеет недопустимый Формат. Попробуйте открыть его из меню Файл, чтобы проверить содержимое файла.

source: Failed to save portions of visual state:
fr: Échec pour enregistrer des portions d'état visuel :
ru: Не удалось сохранить части визуального состояния:

source: Creating GUI...
fr: Création de l'Interface Graphique Utilisateur...
ru: Создание GUI...

source: Update command GUI...
ru: Обновить команду GUI...

source: Converted version %s project::This Wing version %s project file has been converted to Wing %s.x auto-updating project file format. You may want to trim what Wing has added to the project. Then save it to a new file name, since Wing %s.x project files cannot be opened with older versions of Wing.
ru: Проект преобразован из версии %s::эта версия Wing %s файла проекта была преобразован в Wing %s.x авто-обновлением файла формата проекта. Вы можете обрезать то, что Wing добавил в проект. Затем сохраните его с новым именем файла, начиная с Wing %s.x файлы проекта не могут быть открыты более старыми версиями Wing.

source: Converted version %s project::This Wing version %s project file has been converted to Wing %s.x project file format with a static list of files. To add auto-updating directories, use Add Directory in the Project menu. Please save the project to a new file name, since Wing %s.x project files cannot be opened with older versions of Wing.
ru: Конвертированная версия %s project:: этот файл проекта Wing версии %s был преобразован в Wing %s.x Формат файла проекта со статическим списком файлов. Чтобы добавить каталоги автоматического обновления, используйте команду Добавить Каталог в меню проект. Сохраните проект под новым именем, начиная с Wing %s.x файлы проекта не могут быть открыты с более старыми версиями Wing.

source: Converted version %s project::This Wing version %s project file has been converted to Wing %s.x project file format. Please save it to a new file name, since Wing %s.x project files cannot be opened with older versions of Wing.
fr: Version convertie %s du projet. Cette version %s de fichier projet de Wing a été convertie au format de fichier projet Wing %s.x. Veuillez l'enregistrer sous un nouveau nom de fichier, car les fichiers projet Wing %s.x ne peuvent pas être ouverts avec des versions plus anciennes de Wing.
ru: Проект преобразован версии %s::это Wing версии %s файл проекта был преобразован в Wing %s.x Формат файла проекта. Сохраните его в новом имени файла, начиная с Wing %s.x файлы проекта не могут быть открыты с более старыми версиями Wing.

source: Save Project As
fr: Enregistrer le projet Comme
ru: Сохранить Проект Как

source: _Open Selected
fr: Ouvrir la _sélection
ru: Открыть Выбранные

source: Select Project File to Open
fr: Sélectionner un fichier projet à ouvrir
ru: Выберите файл проекта для открытия

source: _Goto Definition
fr: Aller à la définition
ru: Перейти к определению

source: Find Symbol in Project
fr: Trouver un symbole dans le projet
ru: Найти символ в проекте

source: Enter fragments separated by spaces:
fr: Entrer des fragments séparés par des espaces :
ru: Введите фрагменты, разделенные пробелами:

source: Match on _Full Path
ru: Сопоставить по полному пути

source: The type of project you wish to create. Some project types prompt for different initial values.
fr: Le type de projet que vous souhaitez créer. Certains types de projet demandent des valeurs initiales différentes.
ru: Тип проекта, который вы хотите создать. Некоторые типы проектов запрашивают различные начальные значения.

source: The primary source directory to add to the project. Other directories can be added later in the Project tool.
fr: Le répertoire source primaire à ajouter au projet. D’autres répertoires pourront être ajoutés plus tard dans l’outil Projet.
ru: Основной исходный каталог для добавления в проект. Другие каталоги могут быть добавлены позже в инструменте проекта.

source: This can be changed later in Project Properties.
fr: Cela peut être changé plus tard dans les propriétés du projet.
ru: Это можно изменить позже в свойствах проекта.

source: The Python executable to use with this project.
fr: L'exécutable Python à utiliser avec ce projet.
ru: Исполняемый файл Python для использования с этим проектом.

source: The python.exe to use with this project.
fr: Le python.exe à utiliser avec ce projet.
ru: Python.exe для использования в этом проекте.

source: Python Executable
fr: Exécutable Python
ru: Исполняемый файл Python

source: Project Created
fr: Projet Créé
ru: Проект Создан

source: A new untitled project has been created. You can now:
fr: Un nouveau projet a été créé. Vous pouvez maintenant :
ru: Создан новый проект Без названия. Теперь вы можете:

source: Drag files and directories onto the Project tool
fr: Faites glisser fichiers et répertoires sur l’outil de Projet
ru: Перетащите файлы и каталоги в инструмент проекта

source: Configure Project Properties from the Project menu
fr: Configurer les propriétés du projet depuis le menu Projet
ru: Настроить свойства проекта в меню «Проект»

source: Save the project to disk
fr: Enregistrer le projet sur le disque
ru: Сохранить проект на диске

source: Remote
fr: Distant
ru: Удаленный

source: Name
fr: Nom
ru: Имя

source: Store Project File on Remote Host
ru: Хранить файл проекта на удаленном хосте

source: Please choose a different Identifier to avoid overwriting the existing but different shared host configuration %s
ru: Выберите Другой Идентификатор, чтобы избежать перезаписи существующей, но другой конфигурации общего узла %s

source: Remote Project Created
fr: Projet distant créé
ru: Создан Удаленный Проект

source: Add files and directories from the remote host
fr: Ajouter des fichiers et répertoires depuis l'hôte distant
ru: Добавление файлов и каталогов с удаленного хоста

source: Save Remote Project
fr: Enregistrer le projet distant
ru: Сохранить Удаленный Проект

source: Select the location to store the new project.
fr: Sélectionnez l'emplacement où enregistrer le nouveau projet.
ru: Выберите место для хранения нового проекта.

source: Source Directory
fr: Répertoire source
ru: Исходный каталог

source: The given source directory does not exist or is not a directory
fr: Le répertoire source donné n'existe pas ou n'est pas un répertoire
ru: Данный исходный каталог не существует или не является каталогом

source: Scanning Directory
fr: Scanner le répertoire
ru: Сканирование Каталога

source: Scanning the disk for project files. Please wait.
fr: Scanne le disque pour les fichiers projet. Veuillez patienter.
ru: Сканирование диска для файлов проекта. Пожалуйста, подождите.

source: Choose project type. These values can be changed later with Project Properties in the Project menu:
fr: Choisir le type de projet. Ces valeurs peuvent être changées plus tard dans les propriétés du projet dans le menu Projet:
ru: Выберите тип проекта. Эти значения могут быть изменены позже с помощью «Свойства проекта» в меню «Проект»:

source: New Project
fr: Nouveau projet
ru: Новый проект

source: _New Project
fr: _Nouveau projet
ru: Новый проект

source: Invalid Values
fr: Valeurs invalides
ru: Недопустимые значения

source: Some values are invalid:
fr: Certaines valeurs sont invalides :
ru: Некоторые значения недействительны.

source: Generic Python
fr: Python Générique
ru: Общий Python

source: Project Type
fr: Type de projet
ru: Тип проекта

source: Controls whether any files open in an editor are also closed when a project file is closed
fr: Contrôle si les fichiers ouverts dans un éditeur sont aussi fermés quand un fichier projet est fermé
ru: Управляет закрытием файлов, открытых в редакторе, при закрытии файла проекта

source: Controls whether or not the IDE will follow the current project manager selection by opening the corresponding source file in a non-sticky (auto-closing) editor. In either case, the project manager will always open a file in sticky mode when an item is double clicked or the Goto Source context menu item is used.
fr: Contrôle si l'IDE, ou non, suivra la sélection du gestionnaire de projet actuel en ouvrant le fichier source correspondant dans un éditeur temporaire (auto-fermant). Dans tous les cas, le gestionnaire de projet ouvrira toujours un fichier en mode non-éphémère quand un élément est double cliqué ou que l'élément du menu contextuel Aller à la source est utilisé.
ru: Управляет тем, будет ли IDE следовать текущему выбору менеджера проектов, открыв соответствующий исходный файл в нелипком (автоматическом закрываемом) редакторе. В любом случае менеджер проекта всегда будет открывать файл в липком режиме, когда элемент дважды щелкнут или используется контекстный пункт меню «Перейти к источнику».

source: Controls whether or not the IDE will follow the current editor by expanding the project tree to show the file open in the editor.
fr: Contrôle si l'IDE, ou non, suivra la sélection de l'éditeur courrant en développant l'arbre du projet pour afficher le fichier ouvert dans l'éditeur.
ru: Определяет, будет ли среда IDE следовать за текущим редактором, развернув дерево проекта для отображения файла, открытого в редакторе.

source: Controls whether or not the IDE will confirm file copy/move operations initiated by dragging items around on the Project view.
fr: Contrôle si l'IDE, ou non, confirmera les opérations de copie/déplacement de fichier initiées par le glissement d'éléments autour de la vue du projet.
ru: Контролирует, будет ли IDE подтверждать операции копирования/перемещения файлов, инициированные перетаскиванием элементов в представлении Project.

source: Match fragments to full path of the file name, rather than just the file name. Full path matching still occurs when the path separation character is included in the search pattern.
ru: Сопоставьте фрагменты с полным путем имени файла, а не только с именем файла. Полное соответствие пути сохраняется, когда символ разделения пути включен в шаблон поиска.

source: Clipboard
fr: Presse-papier
ru: Буфер обмена

source: Navigation
ru: Навигация

source: Debug/Test
fr: Débogage/Test
ru: Отладка/Тест

source: Revision Control
fr: Contrôle de révision
ru: Контроль версий

source: Project Management
fr: Gestion de projet
ru: Управление проектами

source: File Management
fr: Gestion de fichier
ru: Управление файлами

source: Script-Defined Items
fr: Éléments définis-par-scripts
ru: Script-Defined Элементы

source: Controls which groups of menu items will be shown in the Project tool's context menu.
ru: Управляет тем, какие группы пунктов меню будут отображаться в контекстном меню "Инструменты проекта".

source: Extra menu items to add to the Project tool context menu.
fr: Éléments supplémentaires du menu à ajouter au menu contextuel de l'outil Projet.
ru: Дополнительные пункты меню для добавления в контекстное меню "Инструмента проекта".

source: Command
fr: Commande
ru: Команда

source: Item Name
fr: Nom d'élément
ru: Имя элемента

source: Whether to show New Project dialog when creating projects. When this is disabled, a blank project is created and can be configured and saved from the Project menu.
ru: Должен ли отображаться диалог «Новый проект» при создании проектов. Когда это отключено, создается пустой проект, который можно настроить и сохранить из меню «Проект».

source: Build Command
fr: Commande de construction
ru: Команда Сборки

source: Launch Config
fr: Lancer configurations
ru: Запуск Конфигурации

source: New Project #%d.wpr
fr: Nouveau projet #%d.wpr
ru: Новый проект #%d.wpr

source: Project locked by: hostname=%s, user=%s, process_id=%s.
fr: Projet verrouillé par : hostname=%s, user=%s, process_id=%s.
ru: Проект заблокирован: hostname=%s, user=%s, process_id=%s.

source: Note: Could not read lock file. Reason: %s
fr: Note : N'a pas pu lire le fichier verrou. Raison : %s
ru: Примечание: не удалось прочитать файл блокировки. Причина: %s

source: Project Opened Read-Only
fr: Projet ouvert en Lecture seule
ru: Проект Открыт Только Для Чтения

source: This project is already open in another instance of Wing so has been opened read-only. Use Save Project As to save any changes to another project file. Overriding the lock is also possible but may lose project data written by the other instance of Wing.%s
fr: Ce projet est déjà ouvert dans une autre instance de Wing et a donc été ouvert en lecture-seule. Utiliser 'Enregistrer le projet sous' pour sauvegarger toute modification dans un autre fichier projet. Écraser le verrou est aussi possible mais pourra perdre des données du projet écrites dans l'autre instance de Wing. %s
ru: Этот проект уже открыт в другом экземпляре Wing, поэтому был открыт только для чтения. Используйте команду "Сохранить Проект Как" для сохранения изменений в другом файле проекта. Переопределение блокировки также возможно, но может привести к потере данных проекта, записанные другим экземпляром Wing.%s

source: Failed to Override Lock::The lock could not be overridden for remote file %s
fr: Écrasement du verrou échoué::Le verrou n'a pas pu être écrasé pour le fichier distant %s
ru: Не удалось Переопределить блокировку:: не удалось переопределить блокировку для удаленного файла %s

source: Failed to Override Lock::The lock could not be overridden. Please check whether the lock file %s is read-only.
fr: Écrasement du verrou échoué::Le verrou n'a pas pu être écrasé. Veuillez vérifier si le fichier verrouillé %s est en lecture seule.
ru: Не удалось Переопределить блокировку::Блокировка не может быть переопределена. Пожалуйста, проверьте, является ли файл блокировки %s доступным только для чтения.

source: Choose Other Project...
fr: Choisir un autre projet…
ru: Выбрать другой проект...

source: O_pen Other
fr: Ouvrir les autres
ru: Открыть другой

source: O_verride Lock
fr: Écraser le Verrou
ru: Переопределить Блокировку

source: Could not open project::Failed to open remote project file
ru: Не удалось открыть проект::Не удалось открыть файл удаленного проекта

source: Could not open project::Cannot open version 1.0 projects from a remote location
ru: Не удалось открыть проект::Не удается открыть проекты версии 1.0 из удаленного расположения

source: Could not open project::Failed to open user branch of remote project file
ru: Не удалось открыть проект::Не удалось открыть ветку пользователя удаленного файла проекта

source: Could not read per-user project data in '%s'
fr: N'a pas pu lire les données projet par-utilisateur dans '%s'
ru: Не удалось прочитать данные проекта для каждого пользователя в '%s'

source: Could not open per-user project data in '%s': it may be unreadable or in an invalid file format. Try opening it from the File menu to inspect the contents of the file.
fr: N'a pas pu lire les données projet par-utilisateur dans '%s' : elles peuvent être illisible ou dans un format de fichier invalide. Essayez de les ouvrir depuis le menu Fichier pour inspecter le contenu du fichier.
ru: Не удалось открыть данные проекта для каждого пользователя в '%s': он может быть нечитаемым или в недопустимом формате файла. Попробуйте открыть его из меню «Файл», чтобы проверить содержимое файла.

source: Project Write Failed::Failed to write remote project file %s:
ru: Ошибка Записи Проекта::Не удалось записать файл удаленного проекта %s:

source: General write error
fr: Erreur d'écriture générale
ru: Общая ошибка записи

source: Unexpected failure to save project file %s: Please submit a bug report from the Help menu.
fr: Erreur imprévue pour enregistrer le fichier projet %s : Veuillez envoyer un Retour de bugs depuis le menu Aide.
ru: Непредвиденный сбой при сохранении файла проекта %s: отправьте сообщение об ошибке из меню Справка.

source: Failed to write parts of the project file:
fr: Échec de l'écriture d'une partie du fichier projet:
ru: Не удалось записать части файла проекта:

source: Cannot add Unsaved Files
fr: Impossible d'ajouter des fichiers non sauvegardés
ru: Невозможно добавить несохраненные файлы

source: Sorry, you cannot add an unsaved file. Please save the file before adding it to the project.
fr: Désolé, vous ne pouvez pas ajouter un fichier non sauvegardé. Veuillez enregistrer le fichier avant de l'ajouter au projet.
ru: Извините, Вы не можете добавить несохраненный файл. Сохраните файл перед добавлением в проект.

source: Run Arguments
fr: Arguments d'exécution
ru: Аргументы Запуска

source: Enter any run arguments here
ru: Введите сюда любые аргументы запуска

source: Show this dialog before each run
fr: Afficher cette boite de dialogue avant chaque exécution
ru: Показывать это диалоговое окно перед каждым запуском

source: Environment
fr: Environnement
ru: Окружение

source: Project Home Directory
fr: Répertoire du projet initial
ru: Домашний Каталог Проекта

source: Python _Executable
fr: _Exécutable Python
ru: Исполняемый файл Python

source: Main Entry Point
fr: Point d'entrée principal
ru: Главная точка входа

source: Initial Directory
fr: Répertoire initial
ru: Начальный Каталог

source: Python Options
fr: Options Python
ru: Параметры Python

source: Use inherited environment
fr: Utiliser l'environnement hérité
ru: Использовать унаследованную среду

source: Use the environment values inherited from the system & user settings and configure python dialog without any changes
fr: Utilise les valeurs d'environnement héritées par le système & des préférences utilisateur et configure la boite de dialogue python sans aucune modification
ru: Использовать значения среды, унаследованные от системы & пользовательские настройки и настроить диалог python без каких-либо изменений

source: Add to inherited environment
fr: Ajouter à l'environnement hérité
ru: Добавить в унаследованную среду

source: Add the values listed below to the environment values inherited from the system and user settings
fr: Ajoute les valeurs listées ci-dessous aux valeurs héritées de l'environnement du système et des préférences de l'utilisateur
ru: Добавьте перечисленные ниже значения к значениям среды, унаследованным от системных и пользовательских настроек

source: Use project values
fr: Utiliser les valeurs du projet
ru: Использовать значения проекта

source: Use the environment values set by the project. Use the Project Properties page to modify these values
fr: Utilise les valeurs de l'environnement fixées par le projet. Utiliser la page des propriétés du projet pour modifier ces valeurs
ru: Используйте значения среды, заданные в проекте. Используйте страницу «Свойства проекта», чтобы изменить эти значения

source: Add to project values
fr: Ajouter dans les valeurs du projet
ru: Добавить к значениям проекта

source: Add the values listed below to the values set by the project
fr: Ajouter les valeurs listées ci-dessous aux valeurs fixées par le projet
ru: Добавьте значения, перечисленные ниже, к значениям, установленным проектом

source: Use the environment values inherited from the system and user settings without any changes
fr: Utilise les valeurs d'environnement héritées par le système et des préférences utilisateur sans aucune modification
ru: Используйте значения среды, унаследованные от системы и пользовательских настроек без каких-либо изменений
