Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_process.po
Languages: fr

source: License missing required %s
fr: Licence manquante requise %s

source: Failed to package host information
fr: Échec pour empaqueter l'information hôte

source: Contains invalid characters: %s
fr: Contient des caractères invalides : %s

source: Wrong length (should contain 20 non-hyphen characters)
fr: Mauvaise longueur (devrait contenir 20 caractères sans tirets)

source: Invalid first character: Should be one of %s
fr: Premier caractère invalide : ce devrait être un de %s

source: an unknown product
fr: un produit inconnu

source: Your license is for %s, but you are currently running %s. Please download the correct product from https://wingware.com/downloads or upgrade your license at https://wingware.com/store/upgrade
fr: Votre licence est pour %s, mais vous utilisez actuellement %s. Veuillez télécharger le produit correct depuis https://wingware.com/downloads ou mettre-à-jour votre licence sur https://wingware.com/store/upgrade

source: Request code should start with R
fr: Le code requête devrait commencer avec un R

source: Invalid second character: Should be one of %s
fr: Second caractère invalide : Ce devrait être un de %s

source: Invalid third character: Should be one of %s
fr: Troisième caractère invalide : Ce devrait être un de %s

source: Invalid prefix: Should be '%s'
fr: Préfixe invalide : Ce devrait être '%s'

source: License is valid.
fr: Licence valide.

source: License file not found or could not be read.
fr: Fichier de licence non trouvé ou n'a pas pu être lu.

source: Activation key not valid for this license:
fr: Clé d'activation invalide pour cette licence :

source: The license has expired.
fr: La licence a expiré.

source: The maximum number of users for this license has been reached.
fr: Le nombre maximum d'utilisateurs pour cette licence a été atteint.

source: License OS does not match current OS.
fr: L’OS de la licence ne correspond pas à l’OS actuel.

source: License does not match this product or product level.
fr: La licence ne correspond pas à ce produit ou ce niveau de produit.

source: License does not match this host's identity.
fr: La licence ne correspond pas à l'identité de l'hôte.

source: An internal error occurred:
fr: Une erreur interne est survenue :

source: Unknown error
fr: Erreur inconnue

source: Other users are:
fr: Les autres utilisateurs sont :

source: (%s) on host %s (%s) process id %s
fr: (%s) sur l'hôte %s (%s) id de processus %s

source: No other users at this time.
fr: Pas d'autres utilisateurs en ce moment.

source: Current OS '%s' is not supported
fr: L’OS '%s' actuel n'est pas supporté

source: License OS '%s' does not match current OS '%s'
fr: L’OS '%s' de la licence ne correspond pas à l’OS '%s' actuel

source: expired
fr: expiré

source: Missing a required line %s
fr: Il manque une ligne requise %s

source: Invalid license activation
fr: Activation de licence invalide

source: unlimited
fr: illimité

source: Invalid date or termdays in file
fr: Date ou durée de validité invalide dans le fichier

source: days left
fr: jours restants

source: _Accept
fr: Accepter

source: _Decline
fr: Refuser

source: Unable to read End User License Agreement from %s. Please check your Wing installation.
fr: Impossible de lire le Contrat de Licence Utilisateur Final depuis %s. Veuillez vérifier votre installation de Wing.

source: _Exit Wing
fr: Quitter Wing

source: Unable to read EULA
fr: Impossible de lire le CLUF

source: License product '%s' is not a valid product code.
fr: La licence du produit '%s' n'est pas un code de produit valide.

source: License is for Wing %s and cannot be used with Wing %s
fr: La licence est pour Wing %s et ne peut pas être utilisée avec Wing %s

source: License is for version %s: An upgrade is needed to run %s
fr: La licence est pour la version %s : Une mise à niveau est nécessaire pour lancer %s

source: No valid license file was found. The following errors occurred:
fr: Aucun fichier de licence valide n'a été trouvé. Les erreurs suivantes sont survenues :

source: Wing Pro Trial: %i Days Left
fr: Version d'essai de Wing Pro : %i jour(s) restant(s)

source: License Expiring: %i Days Left
fr: Expiration de la licence : %i jour(s) restant(s)

source: If you are ready, please purchase a license at %s.
fr: Si vous êtes prêt, merci d'acheter une licence à %s.

source: Thanks for using Wing Pro!
fr: Merci d'utiliser Wing Pro !

source: _Purchase License
fr: Achat de licence

source: This annual license will expire in %s days.
fr: Cette licence annuelle expirera dans %s jours.

source: You can renew at https://wingware.com/store/upgrade/license-ids=%s.
fr: Vous pouvez renouveler à https://wingware.com/store/upgrade/license-ids=%s.

source: _Renew License
fr: Renouveler la licence

source: The free license you are using will expire in %s days.
fr: La licence gratuite que vous utilisez va expirer dans %s jours.

source: If you still qualify for a free license, you may reapply at https://wingware.com/store/free.
fr: Si vous êtes toujours éligibles pour une licence gratuite, vous pouvez resoumettre une demande à l'adresse https://wingware.com/store/free.

source: Otherwise, please purchase a license at %s
fr: Dans le cas contraire, merci d'acheter une licence à l'adresse %s

source: The trial license you are using will expire in %s days.
fr: La licence d'essai que vous utilisez va expirer dans %s jours.

source: Otherwise, you can extend your trial twice for a total evaluation period of 30 days. For a longer trial please email support@wingware.com.
fr: Autrement, vous pouvez prolonger votre licence d'essai pour une durée totale maximale de 30 jours. Pour une période plus longue, vous pouvez envoyer un mail à support@wingware.com.

source: _Continue Working
fr: Continuer à travailler

source: Expired Trial
fr: Version d'essai expirée

source: The free trial period for Wing has ended. Please purchase a license from %s
fr: La période d’essai gratuite pour Wing est terminée. Veuillez acheter une licence depuis %s

source: No Valid License
fr: Pas de licence valide

source: _Show Store
fr: Afficher le magasin

source: Just _Quit
fr: Seulement quitter

source: Unable to create the required directory %s because the disk is read-only or a file of the same name already exists.
fr: Impossible de créer le répertoire requis %s car le disque est en lecture seule ou un fichier du même nom existe déjà.

source: Failed to use activated license
fr: Échec de l'utilisation de la licence activée

source: The following errors occurred while copying the license activation file into place:
fr: Les erreurs suivantes sont survenues lors de la copie du fichier d'activation de la licence à l'emplacement :

source: The following exception occurred while copying the license activation file into place:
fr: Les exceptions suivantes sont survenues lors de la copie du fichier d'activation de la licence à l'emplacement :

source: Trial License Generated
fr: Licence d'essai générée

source: Your 10-day trial license has been created and activated. If this is your first trial, you will be able to extend the license term twice for up to 30 days. Thanks for trying Wing!
fr: Votre licence d'essai de 10 jours a été créée et activée. Si c'est votre premier essai, vous pourrez prolonger votre licence deux fois jusqu'à une durée totale de 30 jours. Merci d'essayer Wing !

source: License Activated
fr: Licence activée

source: License activation succeeded. Your license is valid for another %s days. Thanks for using Wing Pro!
fr: Activation de la licence réussie. Votre licence est valide pour encore %s jours. Merci d'utiliser Wing Pro !

source: License activation succeeded. Thanks for using Wing Pro!
fr: Activation de la licence réussie. Merci d'utiliser Wing Pro !

source: Unexpected License Activation Error
fr: Erreur imprévue lors de l'activation de la licence

source: A validated license was corrupted during copying. Please send email to support@wingware.com
fr: Une licence validée a été corrompue durant la copie. Veuillez envoyer un mail à support@wingware.com

source: Con_tinue
fr: Continuer

source: _Cancel
fr: Annuler

source: No License Found
fr: Pas de licence trouvée

source: Purchase License
fr: Acheter une licence

source: Trial licenses can be obtained directly from Wing and last for 10 days. When the license expires, you can renew it twice for a total of 30 days. Please email support@wingware.com if you need more time than that.
fr: Des licences d'essai peuvent être obtenues directement depuis Wing et durent 10 jours. Une fois que la licence expire, vous pouvez la renouveller deux fois pour une durée totale maximale de 30 jours. Si vous avez besoin de plus de temps que cela, vous pouvez écrire à support@wingware.com.

source: Obtain or extend a trial license
fr: Obtenir ou prolonger une licence d'essai

source: Permanent and annual licenses can be purchased from wingware.com
fr: Des licences permanentes et annuelles peuvent être achetées sur wingware.com

source: Purchase a license
fr: Acheter une licence

source: Wing requires that you activate each license before using it. If you run out of activations, please email your license to sales@wingware.com.
fr: Wing requiert que vous activiez chaque licence avant de l'utiliser. Si vous êtes à court d'activations et que vous êtes un utilisateur licencié, veuillez nous contacter à sales@wingware.com.

source: Activate your pre-loaded license:
fr: Activer votre licence pré-chargée :

source: Activate a purchased license. Enter license id:
fr: Activer une licence permanente. Entrez le numéro de licence :

source: You can try Wing for a short period of time without any license. At the end of the allocated time, this dialog will reappear and you will be given the option to start a trial, purchase a license, or quit Wing after saving changes.
fr: Vous pouvez essayer Wing pour une courte période de temps sans aucune licence. A la fin du temps alloué, cette boite de dialogue réapparaîtra et vous aurez l'option d'obtenir une licence d'essai, acheter une licence, ou quitter Wing après avoir enregistré vos modifications.

source: 10 minute emergency session
fr: Session d'urgence de 10 minutes

source: You have used up the time period during which Wing will run without any license. You must now start a 30-day trial, purchase a license, or quit after saving changes.
fr: Vous avez déjà utilisé la période de temps durant laquelle Wing fonctionne sans licence. Vous devez maintenant soit commencer une période d'essai de 30 jours, acheter une licence, ou quitter après avoir enregistré vos modifications.

source: Exit after saving changes
fr: Quitter après avoir enregistré les modifications

source: Choose your preferred method of license activation:
fr: Choisissez votre méthode préférée d'activation de licence :

source: This is the easiest way to activate your license. Wing sends your license and your request code to our server to complete the activation process.
fr: C'est la façon la plus simple d'activer votre nouvelle licence. Wing envoie votre numéro de licence et votre code de requête à notre serveur pour terminer le processus d'activation.

source: Configure Proxy...
fr: Configurer le proxy...

source: Recommended: Connect Wing directly to wingware.com
fr: Recommandé : se connecter directement à wingware.com

source: If your machine does not have a network connection that can access port 80 (http) on wingware.com, you will need to activate your license manually by entering your license id and request code on a machine that does have network access. If you cannot browse the web at all, email the information to us at support@wingware.com and we will email you the activation code.
fr: Si votre machine n'a pas une connection réseau pouvant accéder au port 80 (http) sur wingware.com, vous devrez activer votre licence manuellement en entrant votre numéro de licence et le code de requête sur une machine qui a un accès réseau. Si vous ne pouvez absolument pas naviguer sur internet, envoyer nous un email avec les informations à support@wingware.com et nous vous enverrons un email avec le code d'activation.

source: Optional user identity to use for lost license recovery:
fr: Identité d’utilisateur optionnelle à utiliser pour la récupération d’une licence perdue :

source: Licensed user
fr: Utilisateur licencié

source: Phone
fr: Téléphone

source: To change to another license, you may now:
fr: Pour changer vers une autre licence, vous pouvez maintenant :

source: Change License
fr: Changer de licence

source: Wing is running without a valid license. You may now:
fr: Wing fonctionne sans licence valide. Vous pouvez maintenant :

source: Your trial license has been created. To activate it you can:
fr: Votre licence d'essai a été créée. Pour l'activer vous pouvez :

source: Activate Trial License
fr: Activer la licence d'essai

source: Please choose your preferred method of license activation:
fr: Veuillez choisir votre méthode préférée d'activation de licence :

source: Activate License
fr: Activer la licence

source: Or: Activate manually at https://wingware.com/activate. You will need your license id %s and request code %s. Then enter the provided activation key here:
fr: Ou : activer manuellement sur https://wingware.com/activate. Vous aurez besoin de votre numéro de licence %s et votre code de requête %s. Puis entrez ici la clé d'activation fournie :

source: Opening Browser
fr: Ouverture du navigateur

source: Click OK to open https://wingware.com/store in a web browser. Once you have purchased a license, return here to activate it.
fr: Cliquer sur OK pour ouvrir https://wingware.com/store dans un navigateur internet. Une fois que vous avez acheté une licence, revenez ici pour l'activer.

source: You cannot enter a trial license id here
fr: Vous ne pouvez pas entrer un numéro de licence d’essai ici

source: Invalid license id: %s. Please check and correct it. Errors found were: %s
fr: Numéro de licence invalide : %s. Veuillez le vérifier et le corriger. Les erreurs trouvées sont : %s

source: Invalid License ID
fr: Numéro de licence invalide

source: Invalid activation key: %s. Please check and correct it. Errors found were: %s
fr: Clé d'activation invalide : %s. Veuillez la vérifier et la corriger. Erreurs trouvées : %s

source: Invalid activation key: %s. Please check and correct it.
fr: Clé d'activation invalide : %s. Veuillez la vérifier et la corriger.

source: Validation errors were: %s
fr: Les erreurs de validation étaient : %s

source: Activating
fr: En cours d'activation

source: Submitting activation request. Please wait
fr: Envoi de la requête d'activation. Patientez s'il vous plait

source: Connecting to wingware.com
fr: Connexion à wingware.com

source: Preparing activation
fr: Préparation de l'activation

source: Waiting for Reply
fr: Attente de la réponse

source: Reading Reply
fr: Lecture de la réponse

source: Could not obtain activation key
fr: Impossible d'obtenir une clé d'activation

source: Add Activations
fr: Ajouter des activations

source: Upgrade
fr: Mise à niveau

source: Validating Activation Key
fr: Validation de la clé d'activation

source: Internal activation error: %s. Please report this to support@wingware.com.
fr: Erreur interne d'activation : %s. Veuillez signaler ceci à support@wingware.com.

source: Writing Activation File
fr: Écriture du fichier d’activation

source: Invalid license
fr: Licence invalide

source: The license code you provided is invalid for this product
fr: Le code de licence que vous avez fourni est invalide pour ce produit

source: Validating License
fr: Validation de la licence

source: The license code you provided is invalid -- please check it and try again
fr: Le code de licence que vous avez fourni est invalide -- veuillez le vérifier et essayer à nouveau

source: The license code you provided not valid for this operating system
fr: Le code de licence que vous avez fourni n'est pas valide pour ce système d'exploitation

source: Creating Activation
fr: Création de l'activation

source: Validating Activation
fr: Validation de l'activation

source: Internal error (missing field)
fr: Erreur interne (champ manquant)

source: Internal error (invalid license)
fr: Erreur interne (licence invalide)

source: Internal error (invalid request code)
fr: Erreur interne (code de requête invalide)

source: You have exceeded the allowed number of trial licenses on this machine. Please email your license id %s to support@wingware.com if you need more time. Sorry about the inconvenience, and thanks for trying Wing Pro!
fr: Vous avez dépassé le nombre autorisé de licences d'essais sur cette machine. Veuillez envoyer un email de votre id %s de licence à support@wingware.com si vous avez besoin de plus de temps. Désolé pour le dérangement, et merci d'essayer Wing Pro !

source: You have exceeded your allowed number of license activations. You can increase activation limits at https://wingware.com/license or by emailing your license id %s to support@wingware.com. Sorry for the inconvenience and thanks for using Wing Pro!
fr: Vous avez dépassé votre nombre d'activations de licences autorisé. Vous pouvez augmenter vos limites d'activation sur https://wingware.com/license ou en envoyant un email avec votre numéro de licence %s à support@wingware.com. Désolé pour le désagrément et merci d'utiliser Wing Pro !

source: That license has expired. Please contact sales@wingware.com.
fr: Cette licence a expiré. Veuillez contacter sales@wingware.com.

source: This annual license has expired. Please renew at https://wingware.com/store/upgrade&license-id=%s
fr: Cette licence annuelle a expirée. Veuillez la renouveler sur https://wingware.com/store/upgrade&license-id=%s

source: That license id %s cannot be activated on additional operating systems. Please contact sales@wingware.com if you wish to upgrade your license.
fr: Cet id %s de licence ne peut être activé sur des systèmes d'exploitation additionnels. Veuillez contacter sales@wingware.com si vous souhaitez mettre à niveau votre licence.

source: We have no record of that license id %s. Please check it and try again.
fr: Nous n'avons pas d'enregistrements concernant la licence numéro %s. Veuillez le vérifier and essayer de nouveau.

source: Internal error (unexpected server return value). This may indicate network problems such as a misconfigured proxy server.
fr: Erreur interne (valeur de retour du serveur inattendue). Cela peut indiquer des problèmes de réseau tel qu'une mauvaise configuration du serveur proxy.

source: That license id %s can only be activated on specially patched versions of Wing. Please contact your vendor or sales@wingware.com.
fr: Le numéro de %s peut être seulement activé sur une version spécialement adaptée de Wing. Veuillez contacter votre vendeur ou sales@wingware.com.

source: This license is not valid for this version of Wing. Please upgrade at https://wingware.com/store/upgrade&license-id=%s
fr: Cette licence n'est pas valide pour cette version de Wing. Veuillez la mettre à jour sur https://wingware.com/store/upgrade&license-id=%s

source: Unknown activation error code %s
fr: Code d'erreur d'activation inconnu %s

source: Received an invalid activation key "%s" from the server. This may indicate network problems such as a misconfigured proxy server. Errors found were: %s
fr: Une clé d'activation invalide "%s" a été reçue du serveur. Cela peut indiquer des problèmes de réseau comme un serveur proxy mal configuré. Les erreurs trouvées étaient : %s

source: License Agreement
fr: Contrat de licence

source: Wing is licensed software. Its use is subject to the terms and conditions of the following license agreement:
fr: Wing est un logiciel sous licence. Son utilisation est sujette aux termes et condition du contrat de licence suivant :

source: If you accept the terms of this license agreement, press 'Accept'. Otherwise, press 'Decline.'
fr: Si vous acceptez les termes de ce contrat de licence, appuyez sur 'Accepter'. Sinon, appuyez sur 'Refuser'
