Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_debug_client.po
Languages: fr

source: Your debug process has raised an exception. Use the <literal>Stack Data</literal> and other debugger tools to inspect the program state. <strong>IMPORTANT:</strong> Wing tries to report only unhandled exceptions, but for clarity will also report any exception you step over in the debugger. If you reach an exception that you do not see running outside of the debugger, it may mean that Wing was unable to find the handler. These exceptions can be ignored in the <literal>Exceptions</literal> tool. Other exception handling modes are also available. To get the most out of Wing, it is a good idea to read <literal>Managing Exceptions</literal> in the manual.
fr: Votre processus de débogage a rencontré une exception. Utiliser la <literal>Pile de données</literal> et les autres outils de débogage pour inspecter l'état du programme. <strong>IMPORTANT :</strong> Wing essaie de rapporter seulement les exceptions non gérées, mais pour plus de clarté rapportera aussi toute exception que vous rencontrerez dans le débogueur. Si vous rencontrez une exception que vous ne voyez pas fonctionner en dehors du débogueur, cela peut indiquer que Wing n'a pas été capable de trouver le gestionnaire (d'erreurs). Ces exceptions peuvent être ignorées dans l'outil. <literal>Exceptions</literal>. D'autres modes de gestion d'exceptions sont aussi disponibles. Pour tirer le meilleur de Wing, ce peut être une bonne idée de lire <literal>Managing Exceptions</literal> dans le manuel.

source: Don't show this notice again
fr: Ne plus afficher cette note à nouveau

source: [omitting some output]
fr: [omet quelques sorties]

source: truncated
fr: tronqué

source: Save Session
fr: Enregistrer la session

source: Choose file to which to save the session:
fr: Choisir le fichier dans lequel enregistrer la session :

source: Select _All
fr: Tout sélectionner

source: C_opy
fr: Copier

source: _Paste
fr: Coller

source: Print...
fr: Imprimer...

source: Send _NUL (0x00)
fr: Envoyer NUL (0x00)

source: Shell state for %s
fr: État du shell pour %s

source: Save Selection?
fr: Enregistrer la sélection ?

source: Would you like to save only the current selection?
fr: Voulez vous sauvez seulement la sélection actuelle ?

source: Save _Selection
fr: Enregistrer la sélection

source: Save _All
fr: Enregistrer tout

source: Stack Data
fr: Pile de données

source: Debug Process Stack Data
fr: Pile de données du processus de débogage

source: _Continue Debugging
fr: Continuer le débogage

source: _Stop Debugging
fr: Arrêter le débogage

source: _Pause Debug Process
fr: Mettre en pause le processus de débogage

source: _Start Debugging
fr: Lancer le débogage

source: Attach to Process...
fr: Attacher au processus...

source: _Accept Debug Connections
fr: Accepter les connexions de débogage

source: No Active Process
fr: Pas de process actif

source: No debug process is running
fr: Pas de processus de débogage en cours

source: (terminated)
fr: (terminé)

source: Thread #0
fr: Tâche #0

source: Debug process is running
fr: Processus de débogage en cours

source: (first to stop)
fr: (premier à s'arrêter)

source: (running)
fr: (en fonctionnement)

source: Debug process threads
fr: Tâches de processus de débogage

source: <no debug process stack>
fr: <pas de pile de processus de débogage>

source: , line
fr: , ligne

source: Note: Debug connection closed while polling for server messages
fr: Note : la connection de débogage s'est fermée lors d'une scrutation pour des messages du serveur

source: <no valid stack frame>
fr: <pas d'élément de pile valide>

source: <network timeout during evaluate>
fr: <délai réseau dépassé durant l'évaluation>

source: Error: The debug connection closed unexpectedly while sending message with type %s to server:
fr: Erreur : la connection de débogage s'est fermée de façon innatendue lors de l'envoi de message de type %s au serveur :

source: Error: The debug connection closed unexpectedly while waiting for reply type %s after message type %s:
fr: Erreur : la connection de débogage s'est fermée de façon innatendue lors de l'attente pour un type de réponse %s après un type de message %s :

source: Error: The debug connection was closed after failing to unpack reply type %s after message type %s:
fr: Erreur : la connection de débogage s'est fermée de façon innatendue après avoir échoué de dépaqueter un type de réponse %s après un type de message %s :

source: Error: The debug connection timed out after %s seconds while waiting for reply type %s after message type %s. You may need to increase the value of debug.network-timeout preference.
fr: Erreur : la connection de débogage a expirée après %s secondes en attendant pour un type de réponse %s après un type de message %s. Vous pourriez avoir besoin d'augmenter la valeur de la préférence debug.network-timeout.

source: Filter:
fr: Filtre :

source: Nothing selected
fr: Rien de sélectionné

source: Could not obtain data
fr: Ne peut pas obtenir de données

source: Attribute
fr: Attribut

source: Loading...
fr: Chargement en cours…

source: Case Sensitive
fr: Sensible à la casse

source: Text Search
fr: Recherche de texte

source: Search All Columns
fr: Chercher dans toutes les colonnes

source: No Data
fr: Pas de données

source: Value Errors Cleared
fr: Erreurs de valeurs effacées

source: Warning: Timeout During Evaluation
fr: Avertissement : Délai dépassé durant l'évaluation

source: Warning: Huge Value Encountered
fr: Avertissement : Très grande valeur Rencontrée

source: Cannot access data
fr: Impossible d'accéder aux données

source: _Text
fr: Texte

source: _Expand More
fr: Développer plus

source: _Collapse More
fr: Réduire plus

source: Watch by _Symbolic Path
fr: Surveiller par chemin symbolique

source: Watch by Direct _Reference
fr: Surveiller par référence directe

source: Watch by _Parent Slot
fr: Surveiller par emplacement parent

source: Watch by _Module Slot
fr: Surveiller par emplacement de module

source: _Force Reload
fr: Forcer le rechargement

source: %s(): %s, line %i
fr: %s() : %s, ligne %i

source: %s(): %s, line %s
fr: %s() : %s, ligne %s

source: %s, line %s
fr: %s, ligne %s

source: No symbolic path available
fr: Pas de chemin symbolique disponible

source: <no debug process>
fr: <pas de processus de débogage>

source: <error evaluating>
fr: <erreur en évaluant>

source: <timeout>
fr: <délai dépassé>

source: <undefined>
fr: <indéfini>

source: Could not obtain symbolic path, err=%s
fr: N'a pas pu obtenir un chemin symbolique, err=%s
