Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_guimgr.po
Languages: fr

source: Set this to cause Wing to automatically change perspectives to "debug" whenever debugging is started. The previous perspective ("edit" by default) is restored after debugging has stopped.
fr: Affecter ceci pour que Wing change automatiquement de perspectives vers "debug" dès qu'un débogage est lancé. La perspective précédente ("edit" par défaut) est restaurée après l'arrêt du débogage.

source: Can't access %s
fr: Impossible d'accéder à %s

source: The user settings directory %s is read-only or cannot be accessed. Wing cannot run without write access to this directory.
fr: Le répertoire des préférences utilisateur %s est en lecture seule ou n'est pas accessible. Wing ne peut pas fonctionner sans accès en écriture à ce répertoire.

source: Can't create %s
fr: Impossible de créer %s

source: Unable to create a %s directory because the disk is read-only or a file of the same name already exists. Wing cannot run without write access to this directory.
fr: Impossible de créer un répertoire %s parce que le disque est en lecture seule ou qu'un fichier du même nom existe déjà. Wing ne peut pas fonctionner sans accès en écriture à ce répertoire.

source: Create a new file set
fr: Créer un nouvel ensemble de fichiers

source: Delete the selected file set
fr: Supprimer l'ensemble de fichiers sélectionné

source: New
fr: Nouveau

source: Delete
fr: Supprimer

source: _Show Docs...
fr: Afficher la documentation...

source: _Load
fr: Ouvrir

source: _Close
fr: _Fermer

source: Key Binding
fr: Raccourci clavier

source: Shared
fr: Partagé

source: Name
fr: Nom

source: Right click on the list for additional operations
fr: Clic droit sur la liste pour des opérations additionnelles

source: Manage File Sets
fr: Gestion des ensembles de fichiers

source: Replace Existing File Set?
fr: Remplacer l'emsemble de fichiers existant?

source: That fileset already exists. Are you sure you want to replace the existing fileset '%s'?
fr: Ce jeu de fichiers existe déjà. Êtes-vous sûr de vouloir remplacer le jeu de fichier '%s' existant ?

source: _Cancel
fr: Annuler

source: Confirm File Set Delete
fr: Confirmer la suppression de l'ensemble de fichiers

source: Are you sure you want to delete file set '%s'?
fr: Êtes-vous sûr de vouloir supprimer l'ensemble de fichier '%s' ?

source: Open This File Set
fr: Ouvrir cet ensemble de fichier

source: New...
fr: Nouveau...

source: Delete...
fr: Supprimer...

source: Set Key Binding...
fr: Attribuer un raccourci clavier...

source: Update with Currently Opened Files
fr: Mettre à jour avec les fichiers ouverts actuellement

source: File Set Key Binding
fr: Raccourci clavier pour un ensemble de fichier

source: The key binding to assign to the file set. When pressed, this causes Wing to open all the files in the file set.
fr: Le raccourci clavier à associer au jeu de fichiers. Lorsque pressé, Wing ouvre tous les fichiers de l'ensemble de fichier.

source: Save current GUI State?
fr: Enregistrer l'état actuel de l'interface graphique utilisateur ?

source: Do you want to save the current GUI state for the perspective %s before changing to perspective %s?
fr: Voulez-vous enregistrer l'état actuel de l'interface graphique utilisateur pour la perspective %s avant de changer vers la perspective %s ?

source: _Save State
fr: Enregistrer l'état

source: _Abandon State
fr: Abandonner l'état

source: Auto-Perspectives Enabled
fr: Auto-perspectives activé

source: Wing has turned on auto-perspectives for this project and has changed to the perspective '%s'.
fr: Wing est passé en auto-perspectives pour ce projet et a changé vers la perspective '%s'.

source: Auto-Perspectives Disabled
fr: Auto-perspectives désactivé

source: Wing has turned off auto-perspectives for this project and has changed to the default perspective 'user'.
fr: Wing a arrêté les auto-perspectives pour ce projet et a changé vers la perspective 'user' par défaut.

source: The previously current perspective '%s' has been saved and can be restored from the Tools menu.
fr: La perspective en cours précédente '%s' a été sauvegardée et peut être restaurée depuis le menu Outils.

source: Create a new perspective
fr: Créer une nouvelle perspective

source: Duplicate the selected perspective
fr: Dupliquer la perspective sélectionnée

source: Delete the selected perspective
fr: Supprimer la perspective sélectionnée

source: Duplicate
fr: Dupliquer

source: _Preferences...
fr: _Préférences...

source: Auto-save
fr: Enregistrement automatique

source: Manage Perspectives
fr: Gérer les perspectives

source: Cannot Rename Built-in Perspective
fr: Ne peut pas renommer une perspective prédéfinie

source: The perspective '%s' is a built-in perspective and cannot be renamed.
fr: La perspective '%s' est une perspective prédéfinie et ne peut pas être renommée.

source: Overwrite Existing Perspective?
fr: Écraser la perspective existante ?

source: That perspective already exists. Are you sure you want to overwrite the existing perspective '%s'?
fr: Cette perspective existe déjà. Êtes-vous sûr de vouloir écraser la perspective '%s' existante ?

source: Cannot Delete Built-in Perspective
fr: Ne peut pas supprimer une perspective prédéfinie

source: The perspective '%s' is a built-in perspective and cannot be deleted.
fr: La perspective '%s' est une perspective prédéfinie et ne peut pas être supprimée.

source: Confirm Perspective Delete
fr: Confirmer la suppression de perspective

source: Are you sure you want to delete perspective '%s'? The stored state will be lost.
fr: Êtes-vous sûr de vouloir effacer la perspective '%s' ? L'état stocké sera perdu.

source: _New...
fr: _Nouveau...

source: D_uplicate...
fr: _Dupliquer...

source: _Delete...
fr: Supprimer...

source: Set _Key Binding...
fr: Affecter un raccourci clavier...

source: Update with _Current State
fr: Mettre à jour avec l'état actuel

source: _Restore Saved State
fr: Restaurer l'état sauvegardé

source: Perspective Key Binding
fr: Raccourci clavier de perspective

source: The key binding to assign to the perspective. When pressed, this causes Wing to change to that perspective and restore the GUI state associated with it.
fr: Le raccourci clavier à associer à la perspective. Lorsque pressé, Wing applique cette perspective et restaure l'état de l'interface graphique utilisateur qui lui est associé.

source: _Dark Mode
fr: Mode sombre

source: _Keyboard Personality
fr: Personnalité du _clavier

source: Confi_gure Tab Key...
fr: Configurer la touche tabulation...

source: Configure Auto-_Completion...
fr: Configurer l'auto-complétion…

source: Configure Auto-_Editing...
fr: Configurer l'auto-édition...

source: Show _Line Numbers
fr: Afficher les numéros de lignes

source: Show _White Space
fr: Afficher les espaces

source: _Other Preferences...
fr: Autres préférences...

source: Add Selection for Next Occurrence
fr: Ajouter la sélection de la prochaine occurence

source: Drop Current and Add Next Occurrence
fr: Laisser l’actuelle et ajouter la prochaine occurence

source: Drop Extra Selections
fr: Enlever les sélections supplémentaires

source: Add All in File
fr: Ajouter les sélections du fichier

source: Add All in Class
fr: Ajouter les sélections de la classe

source: Add All in Function / Method
fr: Ajouter les sélections de la fonction / méthode

source: Add All in Block
fr: Ajouter les sélections du bloc

source: Case-Sensitive Matching
fr: Correspondances sensibles à la casse

source: Match Whole Word
fr: Correspondance avec des mots entiers

source: Show Selections Window
fr: Afficher la fenêtre de sélections

source: Hide Selections Window
fr: Masquer la fenêtre de sélections

source: Configure Selections Window
fr: Configurer la fenêtre de sélections

source: Multiple Selections
fr: Sélections multiples

source: _File
fr: _Fichier

source: _Debug
fr: _Débogage

source: _Project
fr: _Projet

source: Testi_ng
fr: Tests

source: W_indow
fr: Fenêtre

source: _Recent
fr: _Récent

source: Debug _Recent
fr: Débogages _récents

source: Debug Named Entry Point
fr: Déboguer le point d'entrée nommé

source: Execute Re_cent
fr: Exécutions ré_centes

source: Execute Named Entry Point
fr: Exécuter le point d'entrée nommé

source: Recen_t
fr: Récent

source: New Panel Window
fr: Nouvelle fenêtre de panneau

source: Compare Files...
fr: Comparer les fichiers...

source: Compare Directories...
fr: Comparer les répertoires...

source: Compare Visible Files
fr: Comparer les fichiers visibles

source: Compare Buffer with Disk
fr: Comparer l'état actuel avec le fichier sauvegardé

source: Compare Recent
fr: Comparaisons récentes

source: Compare to Repository
fr: Comparer au dépôt

source: Next Difference
fr: Différence suivante

source: Previous Difference
fr: Différence précédente

source: Merge Change A->B
fr: Fusionner les modifications A->B

source: Merge Change B->A
fr: Fusionner les modifications B->A

source: Terminate Session
fr: Terminer la session

source: Lock Scrolling
fr: Verrouiller le défilement

source: Ignore Whitespace
fr: Ignorer les espaces

source: _New
fr: _Nouveau

source: _Open...
fr: _Ouvrir...

source: Open from _Project...
fr: Ouvrir un fichier du _projet...

source: Open from _Keyboard
fr: Ouvrir (saisie _clavier)

source: File Sets
fr: Ensembles de fichiers

source: Name Set of Open Files...
fr: Nommer l'ensemble de fichiers ouverts...

source: Name Set of Selected Files...
fr: Nommer l'ensemble de fichiers sélectionnés…

source: Manage File Sets...
fr: Gestion des ensembles de fichiers...

source: Clos_e All
fr: Tout fer_mer

source: Close O_thers
fr: Fermer tous les autres onglets

source: _Save
fr: _Enregistrer

source: Save _As...
fr: Enregistrer sous...

source: Save A_ll
fr: Tout enregistrer

source: Revert to _Disk
fr: Recharger

source: _Insert File...
fr: _Insérer un fichier...

source: _Print...
fr: Imprimer...

source: Pa_ge Setup...
fr: Mise en pa_ge...

source: _Quit
fr: _Quitter

source: Configure Auto-Editing...
fr: Configurer l'auto-édition...

source: Configure Tab Key...
fr: Configurer la touche tabulation...

source: _Undo
fr: Annuler

source: _Redo
fr: _Refaire

source: Cu_t
fr: Couper

source: _Copy
fr: _Copier

source: _Paste
fr: Coller

source: C_lear
fr: Effacer

source: C_opy Filenames
fr: C_opier les noms de fichiers

source: S_elect
fr: S_électionner

source: Select _All
fr: Tout _sélectionner

source: Select _More
fr: Sélectionner plus

source: Select _Less
fr: Sélectionner moins

source: Select _Block
fr: Sélectionner le _bloc

source: Select Ne_xt Block
fr: Sélectionner le bloc suivant

source: Select Pre_vious Block
fr: Sélectionner le bloc précédent

source: Select S_cope
fr: Sélectionner la portée

source: Select Nex_t Scope
fr: Sélectionner la portée suivante

source: Select Prev_ious Scope
fr: Sélectionner la portée précédente

source: S_election Mode
fr: Mode de sélection

source: _Characters
fr: _Caractères

source: _Line
fr: _Ligne

source: _Block
fr: _Bloc

source: Ca_ncel
fr: Annuler

source: _Multiple Selections
fr: Sélections _multiples

source: _Search and Replace
fr: Chercher et remplacer

source: _Search
fr: Chercher

source: _Replace
fr: _Remplacer

source: Search for Selection F_orward
fr: Chercher le texte sélectionné vers l'_avant

source: Search for Selection _Backward
fr: Chercher le texte sélectionné vers l'a_rrière

source: _Next Match
fr: Correspondance suivante

source: _Previous Match
fr: Correspondance _précédente

source: Search in _Files
fr: Chercher dans des _fichiers

source: R_eplace in Files
fr: R_emplacer dans des fichiers

source: Mini-searc_h
fr: Mini-recherc_he

source: _Forward
fr: Avant

source: _Backward
fr: Arrière

source: Selection For_ward
fr: Sélection vers l'avant

source: Selection Bac_kward
fr: Sélection vers l'arrière

source: Rege_x Forward
fr: E_xpression régulière vers l'avant

source: Regex Ba_ckward
fr: Expression régulière vers l'arrière

source: _Query/Replace
fr: Chercher/remplacer

source: Q_uery/Replace Regex
fr: Chercher/remplacer une expression _régulière

source: _Replace String
fr: Texte de _remplacement

source: R_eplace Regex
fr: Remplace une expression régulière

source: _Goto Line...
fr: _Aller à la ligne...

source: Show L_ine Numbers
fr: Afficher les numéros de l_ignes

source: Hide L_ine Numbers
fr: Masquer les numéros de li_gnes

source: Zoom In
fr: Zoom avant

source: Zoom Out
fr: Zoom arrière

source: Reset Zoom
fr: Réinitialiser le zoom

source: Start _Macro Record
fr: Démarrer l'enregistrement de la _macro

source: Stop _Macro Record
fr: Arrêter l'enregistrement de la _macro

source: E_xecute Macro
fr: E_xécuter la macro

source: Reload All Scripts
fr: Recharger tous les scripts

source: Command by _Name
fr: Commande par _nom

source: Configure P_ython...
fr: Configurer P_ython...

source: Pre_ferences...
fr: Préférences…

source: Enclose with ()
fr: Entourer avec ()

source: Enclose with []
fr: Entourer avec []

source: Enclose with {}
fr: Entourer avec {}

source: Enclose with ''
fr: Entourer avec ''

source: Enclose with ""
fr: Entourer avec ""

source: Enclose with <>
fr: Entourer avec <>

source: Change to Lower Case
fr: Transformer en minuscules

source: Change to Upper Case
fr: Transformer en capitales

source: Change to Title Case
fr: Transformer en titre

source: Toggle Symbol Case
fr: Changer la casse de la première lettre

source: Reformat File for PEP 8
fr: Reformater le fichier pour PEP 8

source: Reformat Selection for PEP 8
fr: Reformater la sélection pour PEP 8

source: Configure Auto-Formatting...
fr: Configurer l'auto-formattage…

source: _Rename Symbol
fr: _Renommer un symbole

source: _Move Symbol
fr: _Déplacer le symbole

source: E_xtract Function / Method
fr: Extraire une fonction / méthode

source: _Introduce Variable
fr: _Introduire une variable

source: Re_wrap Text
fr: Passa_ge à la ligne du texte

source: _Match Braces
fr: _Correspondances d'accoldes

source: Insert _Tab Character
fr: Insérer un caractère _tabulation

source: _Show Auto-completer
fr: Afficher l'auto-compléteur

source: _Evaluate File in Python Shell
fr: _Évaluer le fichier dans le Shell Python

source: E_valuate Selection in Python Shell
fr: É_valuer la sélection dans le Shell Python

source: Toggle Block _Comment
fr: Basculer en bloc de _commentaires

source: _Goto Selected Symbol Defn
fr: _Aller à la définition du symbole sélectionné

source: Find Points of _Use
fr: Trouver des points d'_utilisation

source: Find Points of _Use in Current File
fr: Trouver les points d'utilisation dans le fichier actuel

source: _Find Symbol
fr: _Trouver un symbole

source: Find S_ymbol in Project
fr: Trouver un symbole dans le projet

source: Toggle _Bookmark
fr: _Basculement de signet

source: Set _Named Bookmark...
fr: Affecter un signet _nommé...

source: G_oto Bookmark...
fr: _Aller au signet...

source: Traverse Bookmarks
fr: Traverser les signets

source: _Next Bookmark
fr: Sig_net suivant

source: _Previous Bookmark
fr: Signet _précédent

source: Ne_xt Bookmark in Current File
fr: Signet suivant dans le fichier actuel

source: Pre_vious Bookmark in Current File
fr: Signet précédent dans le fichier actuel

source: Show Bookmar_ks Tool
fr: Afficher l’outil de signets

source: In_dent Line(s) to Match
fr: Ajuster l'In_dentation des lignes

source: _Indent
fr: _Indenter

source: _Outdent
fr: _Désindenter

source: Indentation _Manager
fr: _Gestionnaire d'indentation

source: Line Editing
fr: Édition de ligne

source: New Line Above
fr: Nouvelle ligne au-dessus

source: New Line Below
fr: Nouvelle ligne en-dessous

source: Duplicate Lines Above
fr: Dupliquer les lignes au-dessus

source: Duplicate Lines Below
fr: Dupliquer les lignes en-dessous

source: Move Lines Up
fr: Déplacer les lignes en haut

source: Move Lines Down
fr: Déplacer les lignes en bas

source: Delete Lines
fr: Suppression des lignes

source: Swap Lines
fr: Inversion des lignes

source: Enclose
fr: Entourer

source: _Folding
fr: _Repliement

source: _Toggle Current Fold
fr: _Basculer le repliement actuel

source: _Collapse Current More
fr: _Réduire un niveau de plus

source: _Expand Current More
fr: _Développer un niveau de plus

source: C_ollapse Current Completely
fr: Réduire tous les sous blocs

source: E_xpand Current Completely
fr: Développer tous les sous blocs

source: Collapse _All
fr: Tout réduire

source: Ex_pand All
fr: Tout dévelo_pper

source: Fold Python _Methods
fr: Replier les _méthodes Python

source: Fold Python _Classes
fr: Replier les _classes Python

source: Fold Python Classes and _Defs
fr: Replier les classes Python et les _définitions

source: Difference and Merge
fr: Différences et fusion

source: Change Case
fr: Changer la casse

source: Show _Python Environment...
fr: Afficher l'environnement _Python...

source: Current File P_roperties...
fr: P_ropriétés du fichier actuel...

source: _New Project...
fr: _Nouveau projet…

source: _Open Project...
fr: _Ouvrir un projet...

source: _Save Project
fr: _Enregistrer le projet

source: Save Project _As...
fr: S_auvegarder le projet sous...

source: _Close Project
fr: Fermer le projet

source: Add Existing _Directory...
fr: Ajouter un _répertoire existant...

source: Add C_urrent File
fr: Ajo_uter le fichier actuel

source: Add Existing _File...
fr: Ajouter un fichier existant...

source: Add New F_ile
fr: Ajouter un nouveau f_ichier

source: Remove Selected _Entry
fr: Enlever l'entrée sélectionnée

source: Show Current File in Project Tool
fr: Afficher le fichier actuel dans l'outil Projet

source: _Configure Project for Django
fr: _Configurer le projet pour Django

source: Start _Django Project
fr: _Démarrer un projet Django

source: Remote _Hosts...
fr: _Hôtes distants…

source: _Launch Configurations...
fr: _Lancement des configurations...

source: Project P_roperties...
fr: Propriétés du projet...

source: _Start / Continue
fr: Démarrer / continuer

source: Debug _To Cursor
fr: Déboguer jusqu'au curseur

source: Debug Current _File
fr: Déboguer le _fichier actuel

source: _Attach to Process...
fr: _Attacher au processus...

source: Det_ach from Process
fr: Dét_acher du processus

source: S_top Debugging
fr: Arrêter le débogage

source: Restart Debu_gging
fr: Redémarrer le débogage

source: Step _Into
fr: Un pas en profondeur

source: Step Over _Instruction
fr: Un pas au delà de l’instruction

source: Step Over _Block
fr: Un pas au delà du bloc

source: Step _Over
fr: Un pas en avant

source: Step O_ut
fr: Un pas en dehors

source: Step Out to He_re
fr: Passer en dehors d’Ici

source: U_p Stack
fr: En haut dans la pile

source: Dow_n Stack
fr: En bas dans la pile

source: S_how Original Position
fr: Afficher la position d’origine

source: Add _Breakpoint
fr: Ajouter un _point d'arrêt

source: Remove _Breakpoint
fr: Enlever le _point d'arrêt

source: Remo_ve All Breakpoints
fr: Enle_ver tous les points d'arrêts

source: Brea_kpoint Options
fr: Options des points d'arrêts

source: Set _Temporary Breakpoint
fr: Établir un point d'arrêt temporaire

source: Set _Conditional Breakpoint...
fr: Établir un point d'arrêt _conditionnel...

source: Edit Breakpoint C_ondition...
fr: Éditer la condition de point d'arrêt...

source: _Disable Breakpoint
fr: _Désactiver le point d'arrêt

source: _Enable Breakpoint
fr: Activer le point d'arrêt

source: Disable _All Breakpoints
fr: Désactiver tous les points d'arrêts

source: Enable _All Breakpoints
fr: _Activer tous les points d'arrêts

source: Set Breakpoint I_gnore Count...
fr: Établir un point d'arrêt avec compteur d’ignorance...

source: Named Entry Point_s...
fr: Point_s d'entrée nommés...

source: E_xecute Current File
fr: E_xécuter le fichier actuel

source: Clear Ignored Exceptions
fr: Effacer les exceptions ignorées

source: Clear Stored Value Errors
fr: Effacer les valeurs d'erreur stockées

source: Debug Environment...
fr: Environnement de débogage...

source: Run _All Tests
fr: L_ancer tous les tests

source: Run Tests in Current _File
fr: Lancer les tests dans le _fichier actuel

source: Run Tests at _Cursor
fr: Lancer les tests au _curseur

source: Run Fa_iled Tests
fr: Lancer les tests _échoués

source: Run T_ests Again
fr: Lancer les t_ests à nouveau

source: _Abort Running Tests
fr: _Abandonner les tests en cours

source: Debug _All Tests
fr: Déboguer _tous les tests

source: Debug Tests in Current _File
fr: Déboguer les tests dans le _fichier actuel

source: Debug Tests at _Cursor
fr: Déboguer les tests au _curseur

source: Debug Fa_iled Tests
fr: Déboguer les tests échoués

source: De_bug T_ests Again
fr: Déboguer les _tests à nouveau

source: Add Files from _Project...
fr: Ajouter les fichiers du projet...

source: Add Single Fi_le...
fr: Ajouter un seul fichier...

source: A_dd Current File
fr: Ajouter le fichier actuel

source: _Save All Results...
fr: _Enregistrer tous les résultats...

source: _Load Results...
fr: _Charger des résultats...

source: Next Tool
fr: Outil suivant

source: Previous Tool
fr: Outil précédent

source: _Load Perspective
fr: Charger une perspective

source: Enable Auto-Perspectives
fr: Activer les auto-perspectives

source: Disable Auto-Perspectives
fr: Désactiver les auto-perspectives

source: _Manage Perspectives...
fr: Gérer les _perspectives...

source: Restore Default T_ool Set
fr: Restaurer les outils par _défaut

source: Start _Terminal
fr: Démarrer le terminal

source: New _Document Window
fr: Nouvelle fenêtre de document

source: New _Tool Window
fr: Nouvelle fenêtre d’outil

source: _Next Window
fr: Fe_nêtre suivante

source: Ne_xt Document
fr: Document _suivant

source: Pre_vious Document
fr: Document _précédent

source: _Most Recent Document
fr: Docu_ment le plus récent

source: Move _Focus
fr: Déplacer le _focus

source: Next Visit in _History
fr: Visite suivante dans l’historique

source: Previous Visit in H_istory
fr: Visite précédente dans l’historique

source: Wing _Manual
fr: _Manuel Wing

source: Tut_orial
fr: Tut_oriel

source: _Quick Start Guide
fr: Guide de démarrage rapide

source: _How-Tos
fr: _Guides pratiques

source: _Search Help
fr: _Chercher dans l'aide

source: Des_cribe Key...
fr: Décrire des touches (Raccourcis)…

source: Wing _Tips...
fr: _Conseils Wing...

source: _Python Manual (HTML)...
fr: Manuel Python (HTML)…

source: Python _Website...
fr: Site Python…

source: Ask Questions...
fr: Poser des questions…

source: Submit _Feedback...
fr: Soumettre un _retour d'expérience...

source: Submit _Bug Report...
fr: Soumettre un rapport de bug...

source: Technica_l Support...
fr: Support _technique...

source: Check for _Updates...
fr: Chercher des mises a jo_ur...

source: Apply Update...
fr: Applique la mise-à-jour…

source: _About...
fr: _À propos de...

source: _Edit
fr: _Éditer

source: _Refactor
fr: _Refactoriser

source: _Tools
fr: Ou_tils

source: _Help
fr: Aide

source: Open...
fr: Ouvrir...

source: Save
fr: Enregistrer

source: Save the active document
fr: Enregistrer le document actuel

source: Save All
fr: Tout enregistrer

source: Cut
fr: Couper

source: Copy
fr: Copier

source: Paste
fr: Coller

source: Undo
fr: Annuler

source: Redo
fr: Refaire

source: Goto Definition
fr: Aller à la définition

source: Search
fr: Chercher

source: Execute Toolbar Search
fr: Exécuter la recherche de la barre d’outils

source: Indent
fr: Indenter

source: Indent the selected region one level
fr: Indenter la région sélectionnée d'un niveau

source: Dedent
fr: Désindenter

source: Un-indent the selected region one level
fr: Dés-indenter la région sélectionnée d'un niveau

source: Match Indent
fr: Ajuster l'indentation

source: Adjust selected region indent to match context, or one level higher if already matching
fr: Ajuste l'indentation de la région sélectionnée au contexte, ou décale d'un niveau si elle est déjà adaptée

source: Diff/Merge
fr: Diff/fusion

source: Difference/Merge
fr: Différences/fusion

source: Merge A->B
fr: Fusionner A->B

source: Merge B->A
fr: Fusionner B->A
