Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_cache.po
Languages: fr

source: Error
fr: Erreur

source: File
fr: Fichier

source: Failed to read %s: %s
fr: Echec de lecture de %s : %s

source: Could not read file due to remote agent abort
fr: N’a pas pu lire le fichier à cause l’interruption de l’agent distant

source: Codec not found
fr: Codec non trouvé

source: Could not convert file %s when reading it -- the codec for the '%s' text encoding could not be found. Trying default encoding '%s' instead.
fr: N'a pas pu convertir le fichier %s lors de sa lecture -- le codec pour l'encodage de texte '%s' n'a pas pu être trouvé. Essayez plutôt l'encodage '%s'.

source: Could not convert from encoding
fr: N'a pas pu convertir depuis l'encodage

source: Could not convert all characters in %s when reading it as a %s encoded file. Replacing unmappable characters with ?'s so saving the file may result in a corrupted file. You may want to right click on the file and set encoding in the file's properties, or reopen it after changing the Files / Default Encoding preference.
fr: N'a pas pu convertir tous les caractères dans %s lors de la lecture comme un fichier encodé %s. Remplaçant les caractères indécodables avec des ? ; enregistrer le fichier pourrait en faire un fichier corrompu. Vous pouvez souhaiter faire un clic droit sur le fichier et fixer son encodage dans les propriétés du fichiers, ou le re-ouvrir après avoir modifié sa préférence de Fichier / Encodage par défaut.

source: Could not convert any characters in file
fr: N'a pas pu convertir de caractères dans le fichier

source: Failed to convert any characters in %s when reading it as a %s encoded file. Reading it as a latin-1 encoded file instead which will probably result in the wrong characters being displayed. You probably want to right click on the file and set encoding in the file's properties, or reopen it after changing the Files / Default Encoding preference.
fr: Échec de conversion de tout caractère dans %s lors de la lecture comme un fichier encodé %s. Le lisant comme un fichier encodé en latin-1 va probablement résulter dans l’affichage de mauvais caractères. Vous pouvez souhaiter re-ouvrir le fichier en utilisant un autre encodage.

source: Could not read file
fr: Ne peut pas lire le fichier

source: Read failed because characters could not be read in %s when reading it as a %s encoded file.
fr: La lecture a échoué à cause de caractères qui n’ont pas pu être lus dans %s en le lisant comme un fichier encodé %s.

source: Unsupported encoding '%s' found in encoding comment -- Wing cannot write this file until the comment is changed
fr: Encodage '%s' non supporté trouvé dans le commentaire d'encodage -- Wing ne peut pas écrire ce fichier tant que le commentaire n'est pas modifié

source: Could not convert text "%s" on line %d to the %s encoding
fr: N'a pas pu convertir le texte "%s" à la ligne %d dans l'encodage %s

source: Could not convert file contents to the %s encoding
fr: N'a pas pu convertir le contenu du fichier dans l'encodage %s

source: General write error
fr: Erreur d'écriture générale

source: Encoding of %s changed to %s
fr: Encodage de %s changé en %s
