Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_debug_client.po
Languages: fr

source: Another configuration for that remote host already exists. Are you sure you want to overwrite the existing remote host configuration '%s'?
fr: Une autre configuration pour cet hôte distant existe déjà. Êtes-vous sûr de vouloir écraser la configuration existante pour cet hôte distant '%s' ?

source: Remote Host: %s
fr: Hôte distant : %s

source: Recent Hosts
fr: Hôtes récents

source: General
fr: Général

source: Advanced
fr: Avancé

source: Preference setting (%s)
fr: Paramètre de préférence (%s)

source: Host Name
fr: Nom d’hôte

source: The remote host's DNS name or IP address. This may include the user name in the form user@hostname or user@ipaddress.
fr: Le nom DNS ou l’adresse IP de l’hôte distant. Cela peut inclure le nom d’utilisateur sous la forme utilisateur@nomdhote ou utilisateur@adresseip.

source: Automatic
fr: Automatique

source: Python Executable
fr: Executable Python

source: SSH Port
fr: Port SSH

source: Use specified port:
fr: Utiliser un port spécifié :

source: Private Key
fr: Clé privée

source: Use private key file:
fr: Utiliser le fichier de clé privée :

source: Remote Agent Port
fr: Port d’agent distant

source: The TCP/IP port to use for the remote agent, on the remote end of the SSH tunnel. If unspecified, a random port will be used but availability of that port is not guaranteed.
fr: Le port TCP/IP à utiliser pour l’agent distant, sur la fin distante du tunnel SSH. Si non spécifié, un port aléatoire sera utilisé mais la disponibilité de ce port ne sera pas garantie.

source: Use Random Port
fr: Utiliser un port aléatoire

source: Remote Debug Ports
fr: Ports de débogage distant

source: Use Random Ports
fr: Utiliser des ports Aléatoires

source: Start with this port:
fr: Commencer avec ce port :

source: File Encoding
fr: Encodage du fichier

source: I/O Encoding
fr: Encodage des E/S

source: The encoding to use for I/O when debugging or executing code on the remote host.
fr: L’encodage à utiliser pour les E/S lors du débogage ou l’exécution de code sur l’hôte distant.

source: Show I/O Encoding Preference
fr: Afficher les préférences d'encodage des E/S

source: You must specify the remote host name or IP address.
fr: Vous devez spécifier le nom d'hôte distant ou une adresse IP.

source: Cannot evaluate: no debug program
fr: Impossible d'évaluer : pas de programme en cours de débogage

source: Cannot evaluate: debug program is running
fr: Impossible d'évaluer : un programme est en cours de débogage

source: Right-click for option menu
fr: Clic droit pour le menu d'options

source: Cannot evaluate: debugger not ready
fr: Impossible d'évaluer : le débogueur n'est pas prêt

source: Cannot evaluate: unknown or invalid debug mode
fr: Impossible d'évaluer : mode de débogage inconnu ou invalide

source: Watch
fr: Surveillance

source: Watch Debug Data Values and Expressions
fr: Surveiller les valeurs des données de débogage et les expressions

source: No reference value selected
fr: Pas de valeur de référence sélectionnée

source: No value found
fr: Pas de valeur trouvée

source: No reference to track
fr: Pas de référence à rechercher

source: No parent reference to track
fr: Pas de référence parent à rechercher

source: No parent found
fr: Pas de parent trouvé

source: No parent value found
fr: Pas de valeur parent trouvée

source: No symbolic path found
fr: Pas de chemin symbolique trouvé

source: Value not in module scope
fr: Valeur non présente dans l'étendue du module

source: Invalid watch style
fr: Style de surveillance invalide

source: Value
fr: Valeur

source: Watch tool tree state
fr: État de l'arborescence de l'outil Surveillance

source: Watch tool state
fr: État de l'outil de surveillance

source: Debug %s watch on %s
fr: Débogue %s surveille %s

source: Debug %s watch on %s: %s
fr: Débogue %s surveille %s : %s

source: Debug watch tree state
fr: État de l'arborescence de la surveillance du débogage

source: Add Expression
fr: Ajouter une expression

source: Clear Selected
fr: Effacer la sélection

source: Clear All
fr: Tout effacer

source: Use Tree View
fr: Utiliser la Vue en Arborescence

source: Use Combo View
fr: Utiliser la Vue Combo

source: Watching
fr: Surveille

source: Cannot edit sub-value name::Only top-level watch point names can be edited
fr: Ne peut pas éditer le nom de sous-valeur::Seulement les noms des points de surveillance peuvent être édités

source: Cannot edit watchpoint name::Only expressions can be edited
fr: Ne peut éditer le nom du point de surveillance::Seules les expressions peuvent être éditées

source: Debug I/O
fr: Débogueur E/S

source: Debug Process I/O
fr: E/S du processus de débogage

source: Close current buffer
fr: Fermer le tampon actuel

source: No debug process
fr: Pas de processus de débogage

source: Debug process terminated
fr: Processus de débogage terminé

source: Debug I/O appears in context where process was launched
fr: Les E/S de débogage apparaissent dans le contexte lorsqu'un processus est lancé

source: See external console for debug I/O
fr: Voir la console externe pour les E/S de débogage

source: Debug I/O (stdin, stdout, stderr) appears below
fr: Les E/S de débogage (stdin, stdout, stderr) apparaissent ci-dessous

source: _Auto-Clear When Debug Starts
fr: Auto-effaçage quand le débogage démarre

source: _Never Auto-Show
fr: Jamais auto-afficher

source: Al_ways Auto-Show on Output
fr: Toujours auto-afficher sur sortie

source: Auto-Show on _First Output
fr: Auto-afficher sur la première sortie

source: Retain _History
fr: Conserver l’historique

source: Show _Child Processes
fr: Afficher les process enfant

source: Configure _External Console...
fr: Configurer la console externe…

source: Configure Enco_ding...
fr: Configurer l’encodage…

source: in file {}
fr: dans le fichier {}

source: line {}
fr: ligne {}

source: File<html>&nbsp;</html>
fr: Fichier<html>&nbsp;</html>

source: %s, line %s, in <literal>%s</literal>
fr: %s, ligne %s, dans <literal>%s</literal>

source: Debug Process Exceptions
fr: Exceptions du processus de débogage

source: Move up the exception stack
fr: Monter la pile d'exceptions

source: Move down the exception stack
fr: Descendre la pile d'exceptions

source: Show Position
fr: Afficher la position

source: _Ignore this exception location
fr: Ignorer l'emplacement de cette exception

source: Wing reports exceptions that are likely to indicate a bug in code, including some that may be handled normally outside the debugger. Use this check box to ignore an exception you are not interested in. Ignored exceptions are still reported if they later lead to program termination. You can also use the Configure item in the Options menu to alter when Wing reports exceptions and to edit the lists of exceptions that are always reported or always ignored.
fr: Wing rapporte les exceptions qui indiquent probablement un bug dans le code, incluant certaines qui sont gérées normalement en dehors du débogueur. Cocher cette case pour ignorer une exception qui ne vous intéresse pas. Les exceptions ignorées sont toujours rapportées si elles mènent plus tard à la cessation du programme. Vous pouvez aussi utiliser l'item Configurer dans le menu Options pour modifier quand Wing rapporte les exceptions et pour éditer les listes d'exceptions qui sont toujours rapportées ou toujours ignorées.

source: Copy the exception and traceback to the clipboard
fr: Copier l'exception et le retraçage dans le presse-papier

source: Copy _Traceback
fr: Copier le Retraçage

source: Clear this exception display to blank and remove any remaining debugger run markers from source code.
fr: Effacer l'affichage de cette exception et enlever tout marqueur restant du fonctionnement du débogueur du code source.

source: Truncate the exception message to at most 10 lines, each with at most 1024 characters.
fr: Tronquer le message d’exception à maximum 10 lignes, chacune avec au maximum 1024 caractères.

source: _Truncate Long Summaries
fr: Tronquer les longs résumés

source: Indicate files that are in the project in the Exception traceback
fr: Indique les fichiers qui sont dans le projet dans le retraçage des exceptions

source: Indicate _Project Files
fr: Indiquer les fichiers projet

source: Clear the list of all previously ignored exceptions
fr: Effacer la liste de toutes les exceptions ignorées précédemment

source: Clear _Ignored Exceptions
fr: Effacer les exceptions ignorées

source: Change between exception reporting modes and add/remove exceptions that are always reported or always ignored.
fr: Changer entre les modes de rapport d'exception et l'ajout/retrait d'exceptions qui sont toujours rapportées ou toujours ignorées.

source: C_onfigure...
fr: Configurer...

source: Copy
fr: Copier

source: Clear
fr: Effacer

source: Could not find file for {}, line {}
fr: N’a pas pu trouver le fichier pour {}, ligne {}

source: Could not start shell process
fr: N'a pas pu démarré le processus du shell

source: Python Shell Could Not Start
fr: Le shell Python n’a pas pu démarré

source: Could not create process launcher
fr: N'a pas pu créé le lanceur de processus

source: (unavailable; shell was cleared)
fr: (indisponible ; le shell a été nettoyé)

source: Python Shell
fr: Shell Python

source: Internal Wing Error -- please submit a bug report
fr: Erreur interne de Wing -- veuillez envoyer un rapport de bug

source: Restarting shell process...
fr: Redémarrage du processus du shell...

source: Cannot execute: program is exiting
fr: Impossible d’exécuter : le programme est train de quitter

source: Executing command. Please wait for result
fr: Execution de la commande. Veuillez patienter pour le résultat

source: Commands will be debugged. Use arrow keys for history.
fr: Les commandes vont être déboguées. Utiliser les touches fléchées pour l'historique.

source: Commands execute without debug. Use arrow keys for history.
fr: Les commandes s'exécutent sans débogage. Utiliser les touches fléchées pour l'historique.

source: Needs restart for Python env
fr: Besoin de redémarrer pour l'environnement Python

source: Traceback (most recent call last):
fr: Retraçage (dernier appel le plus récent) :

source: File "%s", line %s, in %s
fr: Fichier "%s", ligne %s, dans %s

source: cleared
fr: effacé

source: unavailable
fr: indisponible

source: Warning: The configured Python environment has changed since the Python Shell was started. Do you want to restart it now?
fr: Avertissement : L'environnement Python configuré a changé depuis que le Shell Python a démarré. Voulez-vous le redémarrer maintenant ?

source: _Restart
fr: Redémarrage

source: aborted (disconnected)
fr: annulé (déconnecté)

source: Interactive Python Shell
fr: Shell Interactif Python

source: Set active range of code in the editor
fr: Fixer la sélection active de code dans l’éditeur

source: Clear active range
fr: Effacer la sélection active

source: Click to enable debugging Python Shell commands
fr: Cliquer pour activer les commandes de débogage du Shell Python

source: Click to disable debugging Python Shell commands
fr: Cliquer pour désactiver les commandes de débogage du Shell Python

source: Show the active range in the editor
fr: Afficher la sélection active dans l’éditeur

source: Debug the active range
fr: Déboguer la sélection active

source: Execute the active range
fr: Exécuter la sélection active

source: No Active Editor::Could not set an active range because there is no current editor with a Python file.
fr: Pas d’éditeur actif::N’a pas pu fixer une sélection active car il n’y a pas d’éditeur actuel avec un fichier Python.

source: Copy _With Prompts
fr: Copier avec les invites

source: _Goto Definition
fr: Aller à la définition

source: Move Cursor Up (Ctrl-Up)
fr: Déplacer le curseur en haut (Ctrl-haut)

source: Move Cursor Down (Ctrl-Down)
fr: Déplacer le curseur en bas (Ctrl-Bas)

source: Insert Line Break (Ctrl-Return)
fr: Insérer un Retour à La ligne (Ctrl-Entrée)

source: Error: could not create process launcher
fr: Erreur : n’a pas pu créé le lanceur de processus

source: Error: cannot evaluate local file %s on remote host %s
fr: Erreur : ne peut pas évaluer le fichier local %s sur l’hôte distant %s

source: Error: cannot evaluate remote file %s on host %s (host mismatch)
fr: Erreur : ne peut pas évaluer le fichier distant %s sur l’hôte %s (incohérence d’hôte)

source: Error: cannot evaluate remote file %s on localhost
fr: Erreur : ne peut pas évaluer le fichier distant %s sur localhost

source: [Failed to inspect remote file; could not evaluate]
fr: [Échec d’inspection du fichier distant ; n’a pas pu évaluer]

source: evaluate %s
fr: évaluer %s

source: evaluate lines %i-%i from %s
fr: évaluer les lignes %i-%i depuis %s

source: evaluate selection on lines %i-%i from %s
fr: évaluer la sélection des lignes %i-%i de %s

source: Set Current Directory from Active Editor
fr: Établir le répertoire courant depuis l’éditeur actif

source: Pr_ompt to Confirm Restart
fr: Demander la confirmation pour redémarrer

source: Show Python Shell Doc_umentation
fr: Afficher la Doc_umentation du Shell Python

source: Manage Launch Configurations...
fr: Gestion du lancement de configurations...

source: Disabling debug listen (too many connections)
fr: Désactivation de l’écoute du débogage (trop de connexions)

source: Not listening (too many connections)
fr: Pas à l’écoute (trop de connexions)

source: Not listening
fr: Pas à l’écoute

source: Allowed hosts:
fr: Hôtes autorisés :

source: Listening for connections
fr: A l’écoute des connections

source: Listen failed
fr: Échec de l'écoute

source: Could not watch value::%s
fr: Ne peut pas surveiller la valeur::%s

source: Ignored Exceptions Cleared
fr: Exceptions ignorées effacées

source: Previously ignored exceptions have been cleared: %i exception(s) were removed.
fr: Les précédentes exceptions ignorées ont été effacées : %i exception(s) ont été retirées.

source: Unknown process (terminated)
fr: Process inconnu (terminé)

source: Kill Also Associated Processes?
fr: Tuer aussi les process associés ?

source: Select the process group members to kill
fr: Sélectionner les membres du groupe de process à tuer.

source: %s%s (process id %i)
fr: %s%s (id de process %i)

source: _Leave Other Processes Running
fr: Laisser les autres process fonctionner

source: Kill _Selected Processes Only
fr: Tuer les process sélectionnés uniquement

source: Kill Entire Process _Group
fr: Tuer le groupe de process entier

source: _Always Do This Without Prompting
fr: Toujours faire ceci sans demander

source: Invalid debug.location-map preference :Could not match %s In %s Using %s
fr: Préférence debug.location-map invalide :N'a pas pu correspondre à %s Dans %s Utilisant %s

source: Invalid debug.location-map preferences key: %s
fr: Touche de préférence de debug.location-map invalide : %s

source: Should be a non-empty string host name or IP address
fr: Doit être une chaîne non-vide de nom d'hôte ou une adresses IP

source: Skipping invalid debug.location-map preference value: %s
fr: Saute la valeur invalide de préférence de debug.location-map : %s

source: Found under host name %s
fr: Trouvé sous le nom d'hôte %s

source: Tuple items must be strings
fr: Les éléments tuples doivent être des chaines

source: Skipping invalid debug.location-map preference entry: %s
fr: Saute l'entrée invalide de préférence de debug.location-map : %s

source: Should be a tuple of (remote, local) tuples
fr: Devrait être un tuple de tuples (distant, local)

source: Are You Sure?
fr: Êtes-vous sûr ?

source: Show Integers as _Decimal
fr: Afficher les entiers comme décimal

source: Show Integers as _Hex
fr: Afficher les entiers comme hex

source: Show Integers as _Octal
fr: Afficher les entiers comme octal

source: Show _Memory Addresses
fr: Afficher les adresses mémoires

source: Controls whether or not the debugger listens for connections from an externally launched program. This should be enabled when the debug program is not launched by the IDE.
fr: Contrôle si le débogueur écoute des connections d'un programme lancé à l'extérieur. Ce devrait être activé quand le programme débogué n'est pas lancé par l'IDE.

source: File Mappings
fr: Mappages de fichier

source: Remote IP Address
fr: Adresse IP distante

source: Same as localhost
fr: Même que localhost

source: Specify mapping
fr: Spécifier le mapping

source: Controls how Wing reports exceptions that are raised by your debug process. By default, Wing shows exceptions at the time that the exception traceback would normally be printed. Alternatively, Wing can try to predict which exceptions are unhandled, and stop immediately when unhandled exceptions are raised so that any finally clauses can be stepped through in the debugger. Wing can also stop on all exceptions (even if handled) immediately when they are raised, or it can wait to report fatal exceptions as the debug process terminates. In the latter case Wing makes a best effort to stop before the debug process exits or at least to report the exception post-mortem, but one or both may fail if working with externally launched debug processes. In that case, we recommend using When Printed exception reporting mode.
fr: Contrôle comment Wing rapporte les exceptions qui sont rencontrées par votre processus de débogage. Par défaut, Wing affiche les exceptions au moment où le retraçage des exceptions doit être normalement imprimé. Alternativement, Wing peut essayer de prédire quelles exceptions ne sont pas gérées, et s'arrêter immédiatement lorsque des exceptions non gérées sont rencontrées et ainsi n'importes quelles clauses finales peuvent être examinées dans le débogueur. Wing peut aussi s'arrêter sur toutes les exceptions (même si elles sont gérées) immédiatement quand elles sont rencontrées, ou il peut attendre de rapporter des exceptions fatales quand le processus de débogage se termine. Dans le dernier cas Wing fait de son mieux pour s'arrêter avant que le processus de débogage soit quitté ou au moins de rapporter l'exception post-mortem, mais l'un ou les deux peuvent échoués si ils travaillent avec des processus de débogage lancés extérieurement. Dans ce cas, nous recommandons d'utiliser le mode de rapport des exceptions Lors de l'impression.

source: When Printed (Default)
fr: Lors de l'impression (par défaut)

source: At Process Termination
fr: À la fin du processus

source: Always Immediately
fr: Toujours immédiatement

source: Controls whether to stop on exceptions logged with logging.exception if the exception mode is set to 'When Printed'
fr: Contrôle l'arrêt sur des exceptions loguées avec logging.exception si le mode d'exception est à 'Lors de l'impression'

source: Determines the network interface on which the debugger listens for connections. This can be a symbolic name, an IP address, or left unspecified to indicate that the debugger should listen on all valid network interfaces on the machine. Note that when a debug session is launched from within the IDE (with the Run button), it always connects from the loopback interface (127.0.0.1)
fr: Détermine l'interface réseau dans laquelle le débogueur écoute les connections. Ce peut être un nom symbolique, une adresse IP, ou laissé non spécifié pour indiquer que le débogueur devrait écouter toutes les interfaces réseau valides sur la machine. Notez que lorsqu'une session de débogage est lancée depuis l'IDE (avec le bouton Démarrer), ça se connecte toujours depuis l'interface loopback (127.0.0.1)

source: All valid interfaces
fr: Toutes les interfaces valides

source: This interface
fr: Cette interface

source: Determines the TCP/IP port on which the IDE will listen for the connection from the debug process. This needs to be unique for each developer working on a given host. The debug process, if launched from outside of the IDE, needs to be told the value specified here using kWingHostPort inside wingdbstub.py or by WINGDB_HOSTPORT environment variable before importing wingdbstub in the debug process.
fr: Détermine le port TCP/IP sur lequel l'IDE écoutera pour la connection depuis le processus de débogage. Cela nécessite d'être unique pour chaque développeur travaillant sur un hôte donné. Le processus de débogage, si lancé depuis l'extérieur de l'IDE, nécessite de connaître la valeur spécifiée ici en utilisant kWingHostPort dans wingdbstub.py ou par la variable d'environnement WINGDB_HOSTPORT avant d'importer wingdbstub dans le processus de débogage.

source: IP Address
fr: Adresse IP

source: Controls the amount of time that the IDE will wait for the debug process to respond before it gives up. This protects the IDE from freezing up if your program running within the debug process crashes or becomes unavailable. It must also be taken into account when network connections are slow or if sending large data values (see the Huge List Threshold and Hug String Threshold preferences).
fr: Contrôle la quantité de temps que l’IDE attendra pour que le process de débogage réponde avant qu'il abandonne. Cela protège l'IDE de geler si votre programme fonctionne dans les crashes du process de débogage ou devient indisponible. Il doit aussi être pris en compte quand les connections réseau sont lentes ou s’il envoie des grandes valeurs de données (voir les préférences Césure des grandes listes et Césure des grandes chaînes).

source: Defines variable/key names for which values are never shown by the debugger.
fr: Défini des noms de variable/clé pour lesquels les valeurs ne sont jamais affichées dans le débogueur.

source: Defines the character length threshold under which a value will always be shown on a single line, even if the value is a complex type like a list or dict.
fr: Définit la longueur de seuil de caractères en dessous de laquelle une valeur est toujours affichée sur une seule ligne, même si la valeur est de type complexe comme une liste ou un dictionnaire.

source: Defines the length over which a string is considered too large to fetch for display in the debugger. If this is set too large, the debugger will time out (see the Network Timeout preference).
fr: Définit la longueur au delà de laquelle une chaîne est considérée trop grande pour être amenée à être affichée dans le débogueur. Si c'est défini trop grand, le débogueur s'arrêtera (voir préférence de délai d'expiration du réseau).

source: Set this to true to have the debug server use the __members__ attribute to try to interpret otherwise opaque data values. This is a preference because some extension modules contain bugs that result in crashing if this attribute is accessed. Note that __members__ has been deprecated since Python version 2.2.
fr: Affecter à vrai pour que le serveur de débogage utilise l'attribut __members__ pour essayer d'interpréter autrement les valeurs de données opaques. C'est une préférence due à certains modules d'extenison contenant des bugs qui résultent dans un crash si cet attribut est accédé. Noter que __members__ a été déprécié depuis Python version 2.2.

source: Number of seconds to wait before the debugger will stop in its own code after a pause request is received and no other Python code is reached.
fr: Nombre de secondes à attendre avant que le débogueur s'arrête dans son propre code après qu'une requête de pause soit reçue et qu'aucun autre code Python soit atteint.

source: Sets the tracking style used when a value is double clicked in order to watch it. Values may be tracked by symbolic name, by object reference and attribute by name, and by direct object reference.
fr: Affecte le style de tracking utilisé quand une valeur est double cliquée pour la surveiller. Les valeurs peuvent être tracées par nom symbolique, par référence d’objet et attribuées par nom, et par référence directe d’objet.

source: Symbolic name
fr: Nom symbolique

source: Parent reference + name
fr: Référence du parent + nom

source: Direct object reference
fr: Référence directe à l'objet
