Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_debug_client.po
Languages: fr

source: Breakpoints for a file
fr: Points d'arrêts pour un fichier

source: Exceptions ignored for a file
fr: Exceptions ignorées pour un fichier

source: History list of commands in Python Shell
fr: Liste historique des commandes dans le Shell Python

source: History list of expressions used in the evaluator
fr: Liste historique des expressions utilisées dans l'évaluateur

source: History list of expressions
fr: Liste historique des expressions

source: Command line arguments to use when executing or debugging. Arguments can optionally be delimited by "s or 's. Use \" to add " to an argument and \\" to add \" to an argument. Environment variable references may also be used. A \ that does not precede a ", ', or $ adds a \ to an argument.
fr: Arguments de ligne de commande à utiliser lors de l'exécution ou du débogage. Les arguments peuvent être optionellement délimités par "s ou 's. Utiliser \" pour ajouter " à un argument et \\" pour ajouter \" à un argument. Les références de variable d'environnement peuvent aussi être utilisées. Un \ qui ne précède pas un ", ', ou $ ajoute un \ à un argument.

source: Used internally to save recently used run arguments
fr: Utilisé en interne pour enregistrer les arguments utilisés récemment pour l'exécution

source: Whether to show dialog before running file. This may be overridden with the Debugger > Advanced > Auto-show Run Args Dialog preference.
fr: Si vous souhaitez afficher la boîte de dialogue avant d’exécuter le fichier. Cela peut être écrasé dans la préférence du Débogueur > Avancé > Auto-afficher la boite de dialogue d’arguments d’Exécution.

source: Breakpoint Insert Failed
fr: Échec d'insertion du point d'arrêt

source: Failed to insert breakpoint:
fr: Échec d'insertion du point d'arrêt :

source: No code at the selected line
fr: Pas de code à la ligne sélectionnée

source: Breakpoint Moved
fr: Points d'arrêt déplacé

source: _Don't show this again
fr: Ne plus afficher à nouveau

source: TrackBreaks Failed
fr: TrackBreaks a échoué

source: Call Stack
fr: Pile d'appels

source: Debug Process Call Stack
fr: Pile d'appels du processus de débogage

source: Stack Frames
fr: Éléments de pile

source: <thread is running>
fr: <tâche en cours>

source: Final Exception:
fr: Exception finale :

source: line %s
fr: ligne %s

source: prompt %i
fr: invite de commande %i

source: Failed to select stack frame
fr: Échec de sélection d'un élément de pile

source: Could not display selected stack frame
fr: N'a pas pu afficher l'élément de pile sélectionné

source: Copy Stack to Clipboard
fr: Copier la pile vers le presse-papier

source: Hide Code Line
fr: Masquer la ligne de code

source: Show Code Line Appended
fr: Afficher la ligne de code à la suite

source: Show Code Line Below
fr: Afficher la ligne de code dessous

source: Indicate Project Files
fr: Indiquer les fichiers projet

source: Show Call Stack Documentation
fr: Afficher la documentation de la Pile d'appels

source: Breakpoint Mgr
fr: Gestionnaire de points d'arrêts

source: Cannot ignore breakpoint '%s' times
fr: Ne peut ignorer le point d'arrêt '%s' fois

source: Invalid Value
fr: Valeur invalide

source: _Cancel
fr: Annuler

source: Conditional Breakpoint
fr: Point d'arrêt conditionnel

source: Enter new breakpoint condition:
fr: Entrer une nouvelle condition de point d'arrêt :

source: Ignore Breakpoint
fr: Ignorer le point d'arrêt

source: Enter number of hits to ignore:
fr: Entrer le nombre d'appels à ignorer :

source: Could not attach
fr: N'a pas pu attacher

source: Could not attach to host %s, port %s:
fr: N'a pas pu attacher à l'hôte %s, port %s :

source: The remote process is not accepting connections, or is not running. This may be caused by a missing or incorrect wingdebugpw file. The wingdebugpw file in the IDE's user settings directory (%s) must match the wingdebugpw file that is being read by the debug process (see kPWFilePath in wingdbstub.py).
fr: Le processus distant n'accepte pas de connection, ou n'est pas en fonctionnement. Ce peut être causé par un fichier wingdebugpw manquant ou incorrect. Le fichier wingdebugpw dans le répertoire (%s) des préférences utilisateur de l'IDE doit correspondre au fichier wingdebugpw qui est lu par le processus de débogage (voir kPWFilePath dans wingdbstub.py).

source: Both host and port must be filled in
fr: L'höte et le port doivent être remplis dans

source: Invalid Entry
fr: Entrée invalide

source: Invalid (non-numeric) port number
fr: Numéro de port invalide (non numérique)

source: Select a process to attach to:
fr: Sélectionner un processus à attacher à :

source: Host
fr: Hôte

source: Origin
fr: Origine

source: Prefs
fr: Préférences

source: External
fr: Externe

source: Host:
fr: Hôte :

source: Attach
fr: Attacher

source: Cancel
fr: Annuler

source: Attach to Debug Process
fr: Attacher au processus de débogage

source: Breakpoints
fr: Points d'arrêts

source: Debug Breakpoint Manager
fr: Gestionnaire de point d'arrêt de débogage

source: Breakpoint Manager
fr: Gestionnaire de points d'arrêts

source: Breakpoint manager state
fr: État du gestionnaire de points d'arrêts

source: Ignores
fr: Ignorés

source: Location
fr: Emplacement

source: Temporary
fr: Temporaire

source: Enabled
fr: Activé

source: Hits
fr: Appels

source: Ignores Left
fr: Ignorés restants

source: %s, line %i
fr: %s, ligne %i

source: Show Breakpoint
fr: Afficher le point d'arrêt

source: Remove Breakpoint
fr: Enlever le point d'arrêt

source: Remove All Breakpoints
fr: Enlever tous les points d'arrêts

source: Disable _All Breakpoints
fr: Désactiver _tous les points d'arrêts

source: Enable _All Breakpoints
fr: Activer tous les points d'arrêts

source: Show Breakpoints Documentation
fr: Afficher la documentation des points d'arrêts

source: Cannot execute: no debug process
fr: Impossible d’exécuter : aucun processus de débogage

source: Cannot execute: debug process is busy
fr: Impossible d’exécuter : le processus de débogage est occupé

source: Waiting for keyboard input
fr: Attend une entrée du clavier

source: Executing command. Please wait for result.
fr: Execution de la commande en cours. Veuillez attendre pour le résultat.

source: Debugging recursively (R=%i). Use arrow keys for history.
fr: Débogage récursif (R=%i). Utiliser les touches fléchées pour l'historique.

source: Commands execute in current stack frame. Use arrow keys for history.
fr: Les commandes s’exécutent dans l'élément de pile actuel. Utiliser les flèches pour l'historique.

source: Cannot execute: debug program is connecting
fr: Impossible d’exécuter : le programme à déboguer se connecte

source: Cannot execute: debugger not ready or exiting
fr: Impossible d’exécuter : le débogueur n'est pas prêt ou est en train de quitter

source: Cannot execute: unknown or invalid debug mode
fr: Impossible d’exécuter : mode de débogage inconnu ou invalide

source: Command Line for Probing Paused Debug Process Data
fr: Ligne de commande pour évaluer les données du processus de débogage en pause

source: _Clear
fr: Effacer

source: _Save a Copy...
fr: Enregistrer une copie...

source: _Wrap Lines
fr: Retour à la ligne automatique

source: _Enable Auto-completion
fr: Activer l'auto-complétion

source: _Filter History by Entered Prefix
fr: Filtrer l’historique par des préfixes entrés

source: Evaluate Only W_hole Lines
fr: Évaluer uniquement les lignes entières

source: Enable _Debugging
fr: Activer le débogage

source: Enable Recursi_ve Prompt
fr: Activer l’invite de commande récursive

source: Could not find definition of '%s'
fr: N'a pas pu trouver la définition de '%s'

source: Kill current IPython session?
fr: Tuer la session actuelle d’IPython ?

source: Disconnect from current IPython session?
fr: Déconnecter de la session IPython actuelle ?

source: debugging is disabled, use Options menu to start debugging
fr: le débogage est désactivé, utiliser le menu Options pour démarrer le débogage

source: debugger is active
fr: le débogueur est actif

source: code is stopped in debugger, use the debug tools to work with it
fr: le code est arrêté dans le débogueur, utiliser les outils de débogage pour travailler avec

source: Could not start IPython
fr: Ne peut pas démarrer IPython

source: Cannot execute: use Options -> Restart Shell to launch shell
fr: N'a pas pu exécuter : utiliser Options -> Redémarrer le shell pour lancer le shell

source: Cannot execute: waiting for shell to restart
fr: N'a pas pu exécuter : attend le redémarrage du shell

source: busy
fr: occupé

source: idle
fr: inactif

source: IPython: kernel is {}; {}
fr: IPython : le noyau est {} ; {}

source: Cannot interrupt because kernel is not connected
fr: Ne peut pas s’interrompre car le noyau n’est pas connecté

source: Cannot interrupt because kernel was not launched by this process
fr: Ne peut pas s’interrompre car le noyau n’a pas été lancé par ce process

source: IPython Shell
fr: Shell IPython

source: Evaluate _line %i from %s
fr: Évaluer ligne %i de %s

source: Evaluate _lines %i-%i from %s
fr: Évaluer lignes %i-%i de %s

source: Evaluate _selection on line %i in %s
fr: Évaluer la sélection sur la ligne %i dans %s

source: Evaluate _selection on lines %i-%i in %s
fr: Évaluer la sélection des lignes %i-%i dans %s

source: Evaluate _Selection
fr: Évaluer la sélection

source: _Restart Shell
fr: Redémarrer le Shell

source: _Connect to Existing Kernel...
fr: Connecter au noyau existant…

source: Sa_ve a Copy...
fr: Sauvegarder une copie...

source: Send _Interrupt
fr: Envoyer une interruption

source: _Debug
fr: Déboguer

source: _Evaluate %s
fr: Évaluer %s

source: Enable Auto-_completion
fr: Activer l'auto-complétion

source: _Filter history by entered prefix
fr: Filtrer l’historique par des préfixes entrés

source: _Auto-restart when Evaluate File
fr: Auto-redémarrage lors de l'évaluation du fichier

source: _Launch Configuration
fr: Lancement de configuration

source: _Prompt on Stale Environment
fr: Demande sur environnement périmé

source: Show IPython _Documentation
fr: Afficher la documentation de IPython

source: Untitled
fr: Sans titre

source: Launch %s
fr: Lancer %s

source: Untitled Launch Config
fr: Lancement de configuration sans-titre

source: Create Launch Configuration
fr: Créer un lancement de configuration

source: Create a new launch configuration
fr: Créer un nouveau lancement de configuration

source: Duplicate Launch Configuration
fr: Dupliquer un lancement de configuration

source: Duplicate the selected launch configuration
fr: Dupliquer le lancement de configuration sélectionné

source: Edit Launch Configuration
fr: Éditer un lancement de configuration

source: Edit the selected launch configuration
fr: Éditer le lancement de configuration sélectionné

source: Delete Launch Configuration
fr: Supprimer un lancement de configuration

source: Delete the selected launch configuration
fr: Supprimer le lancement de configuration sélectionné

source: New
fr: Nouveau

source: Duplicate
fr: Dupliquer

source: Edit
fr: Éditer

source: Delete
fr: Effacer

source: Show _Docs...
fr: Afficher la _documentation…

source: _Close
fr: Fermer

source: Name
fr: Nom

source: Shared
fr: Partagé

source: Manage Launch Configurations
fr: Gestion du lancement de configurations

source: That launch configuration already exists. Are you sure you want to create two launch configurations named '%s'?
fr: Ce lancement de configuration existe déjà. Êtes-vous sûr de vouloir créer deux lancements de configurations nommés '%s' ?

source: Named Entry Point:
fr: Point d'entrée nommé :

source: File:
fr: Fichier :

source: Delete Launch Configuration?
fr: Supprimer ce lancement de configuration ?

source: Are you sure you want to delete launch configuration '%s'? This cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le lancement de configuration '%s' ? Cela ne peut pas être annulé.

source: _New...
fr: Nouveau...

source: D_uplicate...
fr: Dupliquer...

source: _Edit...
fr: Éditer...

source: _Delete...
fr: Effacer...

source: Launch Configuration: %s
fr: Lancement de configuration : %s

source: Remote Host '%s' is missing a configuration in this project. This launch configuration will not work until one is added.
fr: Il manque une configuration de l’hôte distant ‘%s’ dans ce projet. Ce lancement de configuration ne fonctionnera pas jusqu’à ce qu’un soit ajouté.

source: If you must use a partial path, be sure to set Initial Directory under the Python tab.
fr: Si vous devez utiliser un chemin partiel, soyez sûr de définir le répertoire initial dans l’onglet Python.

source: Python Path entry '%s' is also a partial path
fr: L’entrée ‘%s’ du Path Python est aussi un chemin partiel

source: Python Path entry '%s' is also a full path
fr: L’entrée ‘%s’ du Path Python est aussi un chemin complet

source: Python Path entry '%s' does not exist
fr: L’entrée ‘%s’ du Path Python n’existe pas

source: Environment
fr: Environnement

source: Command line arguments to use when executing or debugging with this launch configuration. Arguments can optionally be delimited by "s or 's. Use \" to add " to an argument and \\" to add \" to an argument. Environment variable references may also be used. A \ that does not precede a ", ', or $ adds a \ to an argument.
fr: Arguments de ligne de commande à utiliser lors de l’exécution ou du débogage avec cette configuration de lancement. Les arguments peuvent être optionellement délimités par « s ou ’s. Utiliser \" pour ajouter " à un argument et \\" pour ajouter \" à un argument. Les références de variable d’environnement peuvent aussi être utilisées. Un \ qui ne précède pas un ", ‘, ou $ ajoute un \ à un argument.

source: Remote
fr: Distant

source: The name of the launch configuration
fr: Le nom du lancement de configuration

source: Unbuffered (-u)
fr: Sans-tampon (-u)

source: Create a new named entry point
fr: Créer un nouveau point d’entrée nommé

source: Duplicate the selected named entry point
fr: Dupliquer le point d'entrée nommé sélectionné

source: Edit the selected named entry point
fr: Éditer le point d'entrée nommé sélectionné

source: Delete the selected named entry point
fr: Supprimer le point d'entrée nommé sélectionné

source: _Show Docs...
fr: Afficher la documentation...

source: _Execute
fr: Exécuter

source: Debug Key Binding
fr: Déboguer les raccourcis clavier

source: Execute Key Binding
fr: Exécuter le raccourci clavier

source: Right click on the list for additional operations
fr: Clic droit sur la liste pour des opérations additionnelles

source: Manage Named Entry Points
fr: Gestion des points d'entrée

source: Overwrite Existing Named Entry Point?
fr: Écraser le point d'entrée nommé existant ?

source: That named entry point already exists. Are you sure you want to overwrite the existing named entry point '%s'?
fr: Le point d'entrée nommé existe déjà. Êtes-vous sûr de vouloir écraser le point d'entrée nommé existant '%s' ?

source: Confirm Named Entry Point Deletion
fr: Confirmer la suppression du point d'entrée nommé

source: Are you sure you want to delete named entry point '%s'?
fr: Êtes-vous sûr de vouloir écraser le point d'entrée nommé existant '%s' ?

source: Cannot Debug
fr: Ne peut pas déboguer

source: Cannot debug the named entry point. The maximum number of debug processes is already running.
fr: Ne peut pas déboguer le point d’entrée nommé. Le nombre maximum de process de débogage est déjà en cours.

source: _Set Debug Key Binding...
fr: Affecter un raccourci clavier de débogage…

source: Set E_xecute Key Binding...
fr: Affecter un raccourci clavier d'exécution...

source: Named Entry Point: %s
fr: Point d'entrée nommé : %s

source: Debug
fr: Déboguer

source: Data
fr: Donnée

source: Python File
fr: Fichier Python

source: The Python file to launch
fr: Le fichier Python à lancer

source: Whether to show this dialog before launching this entry point
fr: Afficher la boite de dialogue avant de lancer ce point d’entrée

source: You must specify a file to launch.
fr: Vous devez spécifier un fichier à lancer.

source: The selected file does not exist.
fr: Le fichier sélectionné n'existe pas.

source: The selected file is not a Python file. Use the OS Commands tool to launch non-Python files.
fr: Le fichier sélectionné n'est pas un fichier Python. Utiliser l'outil de Commandes de l’OS pour lancer des fichiers non-Python.

source: (from project properties)
fr: (depuis les propriétés du projet)

source: The selected launch configuration no longer exists.
fr: Le lancement de configuration sélectionné n'existe plus.

source: The key binding assigned to initiate debug of the named entry point
fr: Le raccourci clavier assigné pour initier le débogage du point d'entrée nommé

source: The key binding assigned to initiate execution (without debugger) of the named entry point
fr: Le raccourci clavier assigné pour initier l'exécution (sans débogueur) du point d'entrée nommé

source: Key Binding
fr: Raccourci clavier

source: Module-oriented Debug Data View (sys.modules)
fr: Vue des données de débogage Orientée-module (sys.modules)

source: No Remote Hosts
fr: Pad d’hôtes distants

source: No remote hosts have been configured. Do you want to add one now?
fr: Aucun hôte distant n'a été configuré. Voulez-vous en rajouter un maintenant ?

source: _Add Remote Host
fr: Ajouter un hôte distant

source: No Shared Remote Hosts
fr: Pas d’hôtes distants partagés

source: No shared remote hosts have been configured. Do you want to add one now?
fr: Aucun hôte distant partagé n'a été configuré. Voulez-vous en rajouter un maintenant ?

source: _Add Shared Remote Host
fr: Ajouter un hôte distant partagé

source: _Show Documentation
fr: Afficher la documentation

source: Preparing Installation
fr: Préparation de l’installation

source: Configuring Installation
fr: Configuration de l’installation

source: Configuring wingdbstub.py
fr: Configure wingdbstub.py

source: Converting EOLs for remote host
fr: Converti les fins de lignes pour l’hôte distant

source: Installing remote agent:
fr: Installe l'agent distant :

source: Timed out
fr: Délai expiré

source: Installing Remote Agent: %s
fr: Installe l'agent distant : %s

source: Please wait.
fr: Veuillez patienter.

source: Failed to start command line: %s
fr: Échec de lancement de la ligne de commande : %s

source: (truncated)
fr: (tronqué)

source: Detecting Remote OS Type
fr: Détection du type d'OS distant

source: Could not determine OS type (err={})
fr: N’a pas pu le type d’OS (err={})

source: Detecting OS type
fr: Déctection du type d'OS

source: Failed to transfer remote agent (err={})
fr: Échec de transfert de l'agent distant (err={})

source: Base Directory Changed
fr: Répertoire de base modifié

source: Save Files First
fr: Enregistrer les fichiers en premier

source: There are unsaved files open on this remote host. Please save or close them before editing the remote host configuration.
fr: Il y a des fichiers non sauvegardés sur cet hôte distant. Veuillez les enregistrer ou les fermer avant d’éditer la configuration de l’hôte distant.

source: Cannot Edit Remote Host
fr: Ne peut pas éditer l’hôte distant

source: Remote Host Is Being Used
fr: L’hôte distant Est Utilisé

source: This remote host is in use and editing its configuration will affect the following:
fr: Cet hôte distant est en cours d'utilisation et la modification de sa configuration aura une incidence sur ce qui suit :

source: _Edit Remote Host
fr: Éditer l’hôte distant

source: Cannot Remove Remote Host
fr: Ne peut pas enlever l'hôte distant

source: This remote host configuration cannot be removed since it is used as follows:
fr: Cette configuration d’hôte distant ne peut pas être enlevée tant qu’elle est utilisée comme suit :

source: You must close files and/or reconfigure your project to avoid using this remote host before you can remove it.
fr: Vous devez fermer les fichiers et/ou reconfigurer votre projet pour éviter d’utiliser cet hôte distant avant de pouvoir l’enlever.

source: Confirm Remote Host Deletion
fr: Confirmer la suppression l’hôte distant

source: Are you sure you want to delete remote host configuration '%s'?
fr: Êtes-vous sûr de vouloir supprimer la configuration pour cet hôte distant '%s' ?

source: The currently open project is stored on this remote host
fr: Le projet ouvert actuel est stocké sur cet hôte distant

source: The project's Python Executable is on this remote host
fr: L’exécutable Python du projet est sur cet hôte distant

source: Files and directories in the project are on this remote host
fr: Les fichiers et répertoire dans le projet sont sur cet hôte distant

source: Files on the remote host are open in the editor
fr: Les fichiers sur l'hôte distant sont ouvert dans l'éditeur

source: Initializing...
fr: Initialisation en cours...

source: Waiting for connection...
fr: En attente de connection…

source: Connected but not ready
fr: Connecté mais pas prêt

source: Missing Remote Host Configuration
fr: Configuration d’hôte distant Manquante

source: There is no remote host configuration for host %s. Do you want to create one?
fr: Il n’y a pas de configuration d’hôte distant pour l’hôte %s. Voulez-vous en créer une ?

source: Remote Agent Failed to Start
fr: Échec de démarrage de l'agent distant

source: Remote Agent Failed to Install
fr: Échec d'Installation de l'agent distant

source: The remote agent could not be installed on host id %s.
fr: L’agent distant ne peut pas être installé sur l’id d’hôte %s.

source: It looks like you have never connected to this host. Try it first from the command line to verify its identity:
fr: Il semble que vous n’avais jamais été connecté à cette hôte. Essayer tout d’abord depuis la ligne de commande pour vérifier son identité :

source: The stored host identity does not match.
fr: L'identité de l'hôte stocké ne correspond pas.

source: The remote agent was not found. Do you want to install it now?
fr: L'agent distant n'a été trouvé. Voulez-vous l'installer maintenant ?

source: Output received:
fr: Sortie reçue :

source: No output was received.
fr: Aucune sortie n'a été reçue.

source: Co_nfigure...
fr: Configurer...

source: _Install Remote Agent
fr: Installer un agent distant

source: Remote Host is Ready
fr: Hôte distant Prêt

source: Host Name:
fr: Nom d’hôte :

source: File System Encoding:
fr: Encodage du système de fichiers :

source: Installation Directory:
fr: Répertoire d’installation :

source: Home Directory:
fr: Répertoire de base :

source: Base Directory:
fr: Répertoire de base :

source: Update Remote Agent?
fr: Mettre-à-jour l'agent distant?

source: _Update Remote Agent
fr: Mettre-à-jour l'agent distant

source: _Not Now
fr: Pas maintenant

source: Don't show this dialog again
fr: Ne plus afficher à nouveau cette boîte de dialogue

source: Open Local _File...
fr: Ouvrir un fichier local...

source: Open _Remote File...
fr: Ouvrir un fichier distant...

source: Sa_ve As Remote File...
fr: Enregistrer comme un fichier distant...

source: Open _Remote Project...
fr: Ouvrir un projet distant...

source: Sa_ve Project On Remote Host...
fr: Enregistrer le projet sur un hôte distant...

source: Create a new remote host
fr: Créer un nouvel hôte distant

source: Duplicate the selected remote host
fr: Dupliquer l’hôte distant sélectionné

source: Edit the selected remote host
fr: Éditer l’hôte distant sélectionné

source: Delete the selected remote host
fr: Supprimer l’hôte distant sélectionné

source: Hostname
fr: Nom d’hôte

source: Base Directory
fr: Répertoire de base

source: Manage Remote Hosts
fr: Gérer les hôtes distants

source: Overwrite Existing Remote Host?
fr: Écraser l’hôte distant existant ?
