Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_debug_client.po
Languages: fr

source: Search Registry for Python
fr: Chercher dans le registre pour Python

source: Search PATH for 'python'
fr: Chercher dans PATH pour 'python'

source: Sets the default Python Executable to use for debugging and source code analysis. This can be overridden on a project by project basis in Project Properties.
fr: Défini l'Exécutable Python par défaut à utiliser pour le débogage et l'analyse du code source. Cela peut être écrasé sur une base de projet à projet dans les propriétés du projet.

source: Specify:
fr: Spécifiez :

source: Select the display style for integer values.
fr: Sélectionne le style d'affichage pour les valeurs entières.

source: Decimal
fr: Décimal

source: Hex
fr: Hexadécimal

source: Controls whether or not time out, huge value, and error handling value errors are displayed by the debugger the first time they are encountered in each run of Wing.
fr: Contrôle que le délai d'expiration, les grandes valeurs, et que les erreurs de valeur de gestion d'erreurs soient affichés par le débogueur la première fois qu'ils sont recontrés dans chaque lancement de Wing.

source: The color of the text highlight used for the run position during debugging
fr: Couleur du surlignage du texte utilisé pour la position de l'exécution durant le débogage

source: Select transparency (0-160) of the text highlight used for the run position during debugging
fr: Sélectionner la transparence (0-160) du surlignage du texte utilisé pour la position de l'exécution durant le débogage

source: This is used to obtain verbose information about debugger internals in cases where you are having problems getting debugging working. The resulting log file can be emailed to support@wingware.com along with your bug report for interpretation. Logging can be disabled, or sent to stderr, stdout, or a file. When enabled, the debugger will run more slowly.
fr: C'est utilisé pour obtenir des informations verbeuses sur les internals du débogueur dans les cas où vous auriez des problèmes pour faire fonctionner le débogage. Le fichier de log résultant peut être envoyé par mail à support@wingware.com avec votre rapport de bug pour interprétation. Le logging peut être désactivé, ou envoyé vers stderr, stdout, ou un fichier. Si activé, le débogueur fonctionnera plus lentement.

source: No logging
fr: Pas de logs

source: Log to sys.stderr
fr: Log vers sys.stderr

source: Log to sys.stdout
fr: Log vers sys.stdout

source: Log to file:
fr: Log vers le fichier :

source: This is used to turn on very verbose and detailed logging from the debugger. This should only be enabled at the request of Wingware Technical Support and will drastically slow down the debugger.
fr: Utilisé pour activer un logging très verbeux et détaillé du débogueur. Cela devrait être activé seulement à la demande du support technique de Wingware et va ralentir drastiquement le débogueur.

source: This is used to obtain verbose information about the Python Shell internals in cases where you are having problems getting it working. The resulting log file can be emailed to support@wingware.com along with your bug report for interpretation. Logging can be disabled, or sent to stderr, stdout, or a file. When enabled, the Python Shell will run more slowly.
fr: C'est utilisé pour obtenir des informations verbeuses sur les internals du Shell Python dans les cas où vous auriez des problèmes pour le faire fonctionner. Le fichier de log résultant peut être envoyé par mail à support@wingware.com avec votre rapport de bug pour interprétation. Le logging peut être désactivé, ou envoyé vers stderr, stdout, ou un fichier. Si activé, le shell Python fonctionnera plus lentement.

source: This is used to turn on very verbose and detailed logging from the Python Shell internals. This should only be enabled at the request of Wingware Technical Support and will drastically slow down the Python Shell.
fr: Utilisé pour activer un logging très verbeux et détaillé depuis les internals du Shell Python. Cela devrait être activé seulement à la demande du support technique de Wingware et va ralentir drastiquement votre shell Python.

source: Selects whether to use the integrated Debug I/O tool for debug process input/output or an external terminal window. Use an external window if your debug process depends on details of the command prompt environment for cursor movement, color text, etc.
fr: Sélectionne l'utilisation de l’outil intégré Débogueur E/S pour les entrées/sorties du processus de débogage ou d'une fenêtre de terminal externe. Utiliser une fenêtre externe si votre processus de débogage dépend des détails de l'environnement de l'invite de commande pour les mouvements du curseur, la couleur du texte, etc.

source: Determines whether to leave up the console after normal program exit, or to close the console right away in all cases. This is only relevant when running with an external native console instead of using the integrated Debug I/O tool.
fr: Détermine de laisser la console après une sortie normale du programme, ou de fermer la console tout de suite dans tous les cas. C'est significatif uniquement en fonctionnement avec une console externe native au lieu d'utiliser l’outil intégré d'E/S de débogage.

source: Enables line wrapping in the integrated Debug I/O tool.
fr: Activer le passage à la ligne dans l’outil intégré Débogueur E/S.

source: Enables line wrapping in the Python Shell.
fr: Activer le passage à la ligne dans le Shell Python.

source: Auto-restart the Python Shell before a file is evaluated within it. When this is disabled, be aware that previously defined symbols will linger in the Python Shell environment.
fr: Auto-redémarrage du Shell Python avant qu'un fichier soit évalué dedans. Lorsque désactivé, faites attention aux symbôles définis précédement qui persisteront dans l'environnement du Shell Python.

source: Evaluate whole lines from editor rather than the exact selection, when a selection from the editor is sent to the Python Shell tool.
fr: Évaluer les lignes entières de l'éditeur plutôt que la sélection exacté, lorsqu'une sélection de l'éditeur est envoyée dans l'outil de Shell Python.

source: Set to False so that shells will act modal in the same way as editors when working with a modal key bindings such as that for VI. When True, the shells always act as if in Insert mode.
fr: Affecter à Faux ainsi les shells agiront en modal de la même manière que les éditeurs quand ils travaillent avec des raccourcis clavier modaux comme ceux pour VI. Si Vrai, les shells agiront toujours comme en mode Insertion.

source: The number of lines after which the Python Shell will just print a summary rather than the actual lines of code pasted, dragged, or other transferred to the shell.
fr: Le nombre de lignes après lesquelles le Shell Python imprimera juste un sommaire plutôt que les lignes de code actuelles collées, déplacées ou transférées dans le shell.

source: Used internally to show information about exception handling to new users. Once turned off, it is never turned on again
fr: Utilisé en interne pour afficher des informations sur la gestion d'exceptions aux nouveaux utilisateurs. Une fois désactivé, cela n'est jamais réactivé

source: Enable to automatically clear the Debug I/O tool each time a new debug session is started
fr: Active l'effacement automatique de l'outil Débogueur E/S à chaque fois qu'une nouvelle session de débogage est démarrée

source: Never Auto-Show
fr: Jamais auto-afficher

source: Auto-Show on First Output
fr: Auto-afficher sur la première sortie

source: Always Auto-Show on Output
fr: Toujours auto-afficher sur sortie

source: Controls whether and when to automatically show the Debug I/O tool when it receives output.
fr: Contrôle si et quand afficher automatiquement l'outil Débogueur E/S quand il reçoit une sortie.

source: Names of builtin exceptions to never report, even if the exception is not handled. This list takes precedence over the Always Report preference and the Report Exceptions preference when it is set to a value other than Always Immediately.
fr: Noms des exceptions prédéfinies à ne jamais rapporter, même si l'exception n'est pas gérée. Cette liste prend la précédence sur la préférence de Toujours rapporter et la préférence de rapport des exceptions quand c’est fixé à une valeur autre que Toujours immédiatement.

source: Names of builtin exceptions to (nearly) always report. These exceptions are not reported only if they are explicitly caught by the specific subclass in the same frame in which they are raised.
fr: Noms des exceptions prédéfinies à (presque) toujours rapporter. Ces exceptions ne sont pas seulement rapportées si elles sont appelées explicitement par la sous-classe spécifique dans le même cadre dans lequel elles sont sorties.

source: Disabled
fr: Désactivé

source: Symbols Only
fr: Symboles uniquement

source: All (Use with Caution!)
fr: Tout (utiliser avec précaution !)

source: Controls whether debug values are shown when the mouse hovers over a selection in the editor. This may be disabled, enabled for symbols (like x.y.z) only, or enabled for all selections including function or methods calls. WARNING: Enabling evaluation of any selection may result in function or method calls that have side effects such as altering the program state or even making unintended database or disk accesses!
fr: Contrôle si les valeurs de débogage sont affichées quand la souris passe au dessus d'une sélection dans l'éditeur. Ce peut être désactivé, activé seulement pour les symboles (comme x.y.z), ou activé pour toutes les sélections incluant les appels de fonctions ou de méthodes. ATTENTION : Activer l'évaluation de n'importe quelle sélection peut résulter en des appels de fonctions ou de méthodes qui ont des effets indésirables comme la modification de l'état du programme ou même des accès involontaires à des bases de données ou au disque !

source: Enable to display debug data values for any symbol on the editor when the mouse cursor hovers over it.
fr: Active l'affichage des valeurs de données de débogage de n'importe quel symbole dans l'éditeur quand le curseur de la souris passe au-dessus.

source: Console default (%s)
fr: Console par défaut (%s)

source: Encoding of input/output in the Debug I/O panel
fr: Encodage des entrées/sorties dans le panneau du Débogueur E/S

source: Always
fr: Toujours

source: Never
fr: Jamais

source: Use default stdin / stdout encoding
fr: Utiliser par défaut l'encodage stdin / stdout

source: Encoding of input/output in the integrated Python Shell
fr: Encodage des entrées/sorties dans le Shell Python intégré

source: Default
fr: Par défaut

source: File:
fr: Fichier :

source: According to File Properties
fr: Selon les propriétés du fichier

source: Prompt for Action
fr: Demander pour action

source: Cancel Debug
fr: Annuler le débogage

source: Debug Anyway
fr: Déboguer de toute façon

source: Leave Other Processes Running
fr: Laisser les autres process fonctionner

source: Kill Entire Process Group
fr: Tuer le groupe de process entier

source: Prompt For Action When a Process is Killed
fr: Demander pour action quand un process est tué

source: Enable multi-process debugging. When disabled, Wing will only accept one debug connection at a time.
fr: Active le débogage multi-process. Si désactivé, Wing n’acceptera qu’une connection de débogage à la fois.

source: Maximum number of debug processes that can connect to Wing at once. After the limit is reached, Wing accepts no additional connections until some processes detach or exit.
fr: Nombre maximum de process de débogage qui peuvent se connecter à Wing en une fois. Après que cette limite soit atteinte, Wing n’accepte plus de connections supplémentaires jusqu’à ce que des process soit détachés ou quittés.

source: Enable debugging sub-processes. When disabled, Wing will only debug the initially launched parent process.
fr: Activer le débogage de sous-process. Si désactivé, Wing déboguera seulement le process parent lancé initialement.

source: Enable replacement of sys.executable so that processes launched using that value will be debugged. This must be enabled on Windows in order to debug child processes created with the multiprocessing module.
fr: Active le remplacement de sys.executable pour que les process lancés utilisant cette valeur soient débogués. Ce doit être activé sur Windows pour débouter les process enfants créés avec le module de multiprocessing.

source: Switch Only if No Active Debug Process
fr: Basculer seulement si il n’y a pas de process de débogage actif

source: Switch to Most Recently Launched Process Group
fr: Basculer sur le groupe de process lancé le plus récemment

source: Always Switch
fr: Toujours Switcher

source: Enable debugging more than one instance of a named entry point. When disabled, any existing debug process for a named entry point will be terminated when it is debugged.
fr: Activer le débogage de plus d’une instance de point d’entré nommé. Si désactivé, tout process de débogage existant pour un point d’entrée nommé sera terminé quand il sera débogué.

source: Server not responding
fr: Le serveur ne répond pas

source: The debug server has stopped responding: Network connection has been closed
fr: Le serveur de débogage a arrêté de répondre : la connection réseau a été fermée

source: Could not find a file to debug
fr: Impossible de trouver un fichier à déboguer

source: Nothing to debug
fr: Rien à déboguer

source: Could not debug unsaved file
fr: Ne peut pas déboguer un fichier non sauvegardé

source: File does not exist: %s
fr: Le fichier n'existe pas : %s

source: Debugger launch cancelled
fr: Lancement du débogueur annulé

source: Failed to open remote file
fr: Échec d’ouverture du fichier distant

source: Build Command Not Found
fr: Commande de construction non trouvée

source: The build command set in file or project properties could not be found because it was removed from the OS Commands tool. Please edit your file or project properties to correct this error. Starting debug without build.
fr: La commande de construction fixée dans les propriétés d'un fichier ou d'un projet ne peut pas être trouvée car elle a été enlevée depuis l'outil de Commandes de l’OS. Veuillez éditer les propriétés de votre fichier ou projet pour corriger cette erreur. Démarrer un débogage sans construction.

source: Build Command Failed
fr: Commande de construction échouée

source: The build command failed. Start debugging anyway?
fr: Commande de construction échouée. Lancer le débogage quand même ?

source: _Don't ask me again
fr: Ne plus me demander à nouveau

source: _Yes
fr: Oui

source: _No
fr: Non

source: Could not debug %s because it does not exist.
fr: Ne peut pas déboguer %s car il n'existe pas.

source: Could not start debug process
fr: Ne peut pas démarrer le processus de débogage

source: Could not start TCP/IP listen
fr: Ne peut pas démarrer l'écoute TCP/IP

source: Could not debug "%s" -- the file does not exist
fr: N'a pas pu déboguer "%s" -- le fichier n'existe pas

source: Could not debug directory "%s"
fr: N'a pas pu déboguer le répertoire "%s"

source: Cannot debug main file located within a zip or egg "%s"
fr: Ne peut pas déboguer le fichier principal dans un zip ou un egg "%s"

source: Unexpected local launch of remote file: %s
fr: Lancement local non attendu du fichier distant : %s

source: Configured run directory does not exist: %s
fr: Le répertoire d'exécution configuré n'existe pas : %s

source: Could not launch debugger for "%s". The python interpreter "%s" may not exist.
fr: N'a pas pu lancer le débogueur pour "%s". L'interpréteur python "%s" pourrait ne pas exister.

source: Could not launch debugger for "%s".
fr: N'a pas pu lancer le débogueur pour "%s".

source: Debug Failed - Could not establish SSH tunnel
fr: Échec du débogage - N’a pas pu établir un tunnel SSH

source: Output seen:
fr: Sortie vue :

source: No output was seen
fr: Aucune sortie vue

source: Received output:
fr: Sortie reçue :

source: You have specified that Wing should display a separate console for this debug process but Wing cannot find any of the configured consoles: %s Try altering the setting the Debug External Consoles preference from Preferences in the Edit menu or use integrated I/O by unchecking the Use External Console preference.
fr: Vous avez spécifié que Wing devrait afficher une console séparée pour ce processus de débogage mais Wing ne peut pas trouver aucune des consoles configurée : %s Essayez de modifier la configuration de la préférence de consoles externes de débogage depuis les préférences dans le menu Éditer ou utiliser les E/S intégrées en décochant la préférence Utiliser une console externe.

source: Could not start debugger because the filename %s cannot be encoded in the current file system encoding (%s)
fr: N'a pas pu démarrer le débogueur car le nom de fichier %s n'a pas pu être encodé dans le système d'encodage du fichier actuel (%s)

source: Step Over
fr: Un pas en avant

source: Step Over Line
fr: Un pas au delà de la ligne

source: Step Into
fr: Un pas en profondeur

source: Step Out
fr: Un pas en dehors

source: Step Out To Frame
fr: Un pas en dehors de la Frame

source: Continue
fr: Continuer

source: Debug to Cursor
fr: Déboguer jusqu'au curseur

source: Wing cannot run to this location because the file is not available on the remote host.
fr: Wing ne peut pas fonctionner à cet emplacement car le fichier n’est pas disponible sur l’hôte distant.

source: Process %i raised an exception
fr: Le procès %i a levé une exception

source: Process %i reached a breakpoint or paused
fr: Le process %i a atteint un point-d’arrêt ou est en pause

source: [%ld of %ld files changed since module load]
fr: [%ld de %ld fichier(s) changés depuis le dernier chargement de module]

source: [%ld modules loaded]
fr: [%ld module(s) chargé(s)]

source: You may need to configure anti-virus or security software to allow Wing to listen on TCP/IP ports.
fr: Vous devriez avoir besoin de configurer un anti-virus ou un programme de sécurité pour autoriser Wing à écouter sur les ports TCP/IP.

source: Debug Listen Failed
fr: Échec de l’écoute de débogage

source: Listening on a random port also failed so debugging sub-processes will not work.
fr: L’écoute sur un port aléatoire a aussi échoué donc le débogage des sous-process ne fonctionnera pas.

source: Debugger could not listen for TCP/IP connections for debugging sub-processes.
fr: Le débogueur n’a pas pu écouter les connections TCP/IP pour le débogage des sous-process.

source: ; host=%s, pid=%s
fr: ; hôte=%s, pid=%s

source: Debug process exited
fr: Processus de débogage quitté

source: Debug process running
fr: Processus de débogage en cours

source: Debug process paused
fr: Processus de débogage en pause

source: Program exception
fr: Exception du programme

source: Connected to debug process
fr: Connecté au processus de débogage

source: Unknown or invalid debug mode
fr: Mode de débogage inconnu ou invalide

source: terminated
fr: terminé

source: no process
fr: pas de process

source: running
fr: en fonctionnement

source: paused
fr: en pause

source: listening
fr: en écoute

source: connected
fr: connecté

source: unknown mode
fr: mode inconnu

source: (changed on disk only)
fr: (changé sur le disque uniquement)

source: (unsaved changes)
fr: (changements non sauvegardés)

source: (open and changed on disk)
fr: (ouvert et changés sur le disque)

source: The following files are unsaved or do not match the code running in the debug process because they have changed in the IDE and/or on disk since they were last loaded. This may lead to incorrect source display for those files or failure to stop on breakpoints. If your debug program is not designed to reload altered modules, you may wish to restart your debug process now.
fr: Les fichiers suivants ne sont pas sauvegardés ou ne correspondent pas au code en exécution dans le processus de débogage car ils ont changés dans l'IDE et/ou sur le disque depuis la dernière fois qu'ils ont été chargés. Cela peut mener à un affichage incorrect de la source pour ces fichiers ou une défaillance qui s'arrête sur les points d'arrêts. Si votre programme débogué n'est pas conçu pour recharger les modules altérés, vous devriez redémarrer votre processus de débogage maintenant.

source: Files Modified
fr: Fichiers modifiés

source: _Step Over
fr: Un pas en _avant

source: _Step Over Line
fr: Un pas au delà de la ligne

source: _Step Out To Frame
fr: Un pas en dehors de la Frame

source: _Step Into
fr: Un pas en _profondeur

source: _Step Out
fr: Un pas en de_hors

source: Con_tinue Debug
fr: Continuer le débogage

source: _Debug to Cursor
fr: Déboguer jusqu'au curseur

source: Debug to Clicked
fr: Déboguer jusqu'au clic

source: _Debug to Clicked
fr: Déboguer jusqu'au clic

source: Con_tinue Without Restart
fr: Continuer sans redémarrage

source: Save & _Restart
fr: Enregistrer & redémarrer

source: Save & Sto_p Debugging
fr: Enregistrer & arrêter le débogage

source: Sa_ve &
fr: Sauvegarder &

source: Without Saving
fr: Sans enregistrement

source: Sto_p Debugging
fr: Arrêter le débogage

source: Always _ignore module changes
fr: Toujours ignorer les changements de modules

source: _Auto-save before debugging
fr: Auto-enregistrement avant le débogage

source: Failed to Start
fr: Démarrage échoué

source: Failed to start the debug the program: Could not listen on TCP/IP port %s.
fr: Échec de démarrage du débogage du programme : N'a pas pu écouter le port %s sur TCP/IP.

source: Failed to start the debug the program: Could not listen on TCP/IP host %s, port %s.
fr: Échec de démarrage du débogage du programme : N'a pas pu écouté sur TCP/IP l'hôte %s, port %s.

source: The debug process never connected back to Wing: Aborting debug session. See Trouble-shooting Failure to Debug in the product manual.
fr: Le processus de débogage ne s'est jamais reconnecté à Wing : avortement de la session de débogage. Voir de Trouble-shooting Failure à Debug dans le manuel du produit.

source: Connection Failed
fr: Connexion échouée

source: Protocol Mismatch
fr: Discordance de Protocole

source: Couldn't initialize debug process
fr: N'a pas pu initialiser le processus de débogage

source: Couldn't get information from the debug process or initialize it
fr: N'a pas pu avoir l'information du processus de débogage ou l'initialiser

source: Open failed: %s is probably a binary file
fr: Échec d'ouverture : %s est probablement un fichier binaire

source: Debug Process Exception
fr: Exception du processus de débogage
