Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_debug_tserver.po
Languages: fr

source: Wing Debug Log File
fr: Fichier de log de débogage de Wing

source: This file can be used to diagnose problems in debugger internals
fr: Ce file peut être utilisé pour diagnostiquer les problèmes dans les routines du débogueur

source: For help, contact support@wingware.com
fr: Pour de l'aide, contactez support@wingware.com

source: Warning: Log file does not exist:
fr: Avertissement : Le fichier de log n'existe pas :

source: Warning: and could not be created; logging disabled
fr: Avertissement : et ne peut pas être créé. Enregistrement désactivé.

source: Warning: Log file is not a file:
fr: Avertissement : Le fichier de log n'est pas un fichier :

source: Warning: Logging disabled
fr: Avertissement : Logging désactivé

source: (truncated)
fr: (tronqué)

source: <error evaluating>
fr: <erreur durant l'évaluation>

source: <thread %i is running>
fr: <la tâche %i est en cours>

source: <invalid thread id %s or stack index %s>
fr: <id de tâche %s ou index de pile %s invalide>

source: <invalid stack frame>
fr: <élément de pile invalide>

source: <sys.modules does not exist>
fr: <sys.modules n'existe pas>

source: <error accessing sys.modules>
fr: <erreur en accédant à sys.modules>

source: <no longer exists
fr: <n'existe plus

source: <no longer exists>
fr: <n'existe plus>

source: <parent too large>
fr: <parent trop large>

source: <invalid parent type>
fr: <type de parent invalide>

source: <value not found>
fr: <valuer non trouvée>

source: <thread is running>
fr: <tâche en cours>

source: <invalid context>
fr: <contexte invalide>

source: <invalid path %s at pos=%i>
fr: <chemin %s invalide à la position=%i>

source: <undefined>
fr: <indéfini>

source: at
fr: à

source: <huge %s at %s; len=%i>
fr: <énorme %s à %s ; longueur=%i>

source: , pos
fr: , position

source: , line
fr: , ligne

source: SyntaxError:
fr: Erreur de syntaxe :

source: Error
fr: Erreur

source: Error: Wing was unable to pack up an exception message
fr: Erreur : Wing n'a pas été capable de générer un message d'exception

source: Value
fr: Valeur

source: Redirected I/O failed on closed debug connection
fr: La redirection des E/S a échoué lors de la fermeture de la connexion de débogage

source: EOF when reading a line
fr: EOF lors de la lecture d'une ligne

source: (unavailable)
fr: (indisponible)

source: [omitting some output]
fr: [omet quelques sorties]
