Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_wingutils.po
Languages: fr

source: Value should be None
fr: La valeur devrait être None

source: Boolean value must be 0 or 1
fr: Une valeur booléenne doit être 0 ou 1

source: <boolean: 0 or 1>
fr: <booléen : 0 ou 1>

source: Value has type %s, should be one of:
fr: La valeur est de type %s, elle devrait être de l'un de :

source: Value is type %s, should be
fr: La valeur est de type %s, et devrait être

source: [one of:
fr: [une de :

source: Value out of range, should be one of:
fr: Valeur hors de la plage, elle devrait une de :

source: Value is type %s, should be %s
fr: La valeur est de type %s, et devrait être %s

source: Value out of valid range %s -> %s
fr: La valeur est hors de la plage %s -> %s

source: [from %s to %s]
fr: [de %s à %s]

source: Value is type %s, should be tuple
fr: La valeur est de type %s, et devrait être un tuple

source: Bad tuple item %i: %s
fr: Mauvais élément de tuple %i : %s

source: [tuple of:
fr: [tulpe de :

source: Value is type %s, should be set
fr: La valeur est de type %s, et devrait être fixée

source: [set of:
fr: [jeu de :

source: Value has length %i, should be %i
fr: La valeur est de longueur %i, au lieu de %i

source: Bad tuple slot %i: %s
fr: Mauvais emplacement de tuple %i : %s

source: [tuple length %i of: %s]
fr: [longueur de tuple %i de : %s]

source: Value is type %s, should be list
fr: La valeur est de type %s, et devrait être une liste

source: Bad list item %s: %s
fr: Mauvais élément de liste %s : %s

source: [list of:
fr: [liste de :

source: Value is %s, should be dict
fr: La valeur est %s, et devrait être un dictionnaire

source: Bad dictionary key %s: %s
fr: Mauvaise clé de dictionnaire %s : %s

source: Bad dictionary value %s: %s
fr: Mauvaise valeur de dictionnaire %s : %s

source: , values:
fr: , valeurs :

source: [dict; keys:
fr: [dictionnaire ; clés :

source: [None or
fr: [None ou

source: [any value]
fr: [n'importe quelle valeur]

source: Value is a %s, should be a CResourceLocation
fr: La valeur est un %s, elle devrait être un CRessourceLocation

source: [Any resource location]
fr: [N'importe quel emplacement de ressource]

source: Value is a %s, should be a list of strings
fr: La valeur est un %s, et devrait être une liste de chaines

source: Value contains non-string item in position %i
fr: La valeur contient un élément qui n'est pas une chaîne en position %i

source: [list of str]
fr: [liste de chaînes]

source: [file filters]
fr: [filtres de fichier]

source: Value has type %s, should be string containing a #.#.#.# IP4 address
fr: La valeur est de type %s, elle devrait être une chaine contenant une adresse IP4 #.#.#.#

source: Value should be a #.#.#.# IP4 address
fr: La valeur devrait être une adresse IP4 #.#.#.#

source: Value should be a #.#.#.# IP4 address but contains non-numeric parts
fr: La valeur devrait être une adresse IP4 #.#.#.# mais contient des éléments non-numériques

source: Icon file does not exist
fr: Le fichier icône n'existe pas

source: Icon file is a directory
fr: Le fichier icône est un répertoire

source: Icon spec has type %s, should be string, unicode, or location
fr: Icône spec a un type %s, qui devrait être une chaîne, un unicode ou un emplacement

source: Value is not a CResourceLocation: %s
fr: La valeur n'est pas une CResourceLocation : %s

source: Cannot convert text into a CResourceLocation: %s
fr: Impossible de convertir du texte en CResourceLocation : %s

source: English
fr: Anglais

source: US, Canada, and Others
fr: États-Unis, Canada et autres

source: Hebrew
fr: Hébreux

source: US, Australia, New Zealand, S. Africa
fr: États-Unis, Australie, Nouvelle Zélande, Afrique du Sud

source: Western European
fr: Europe occidentale

source: Greek
fr: Grec

source: Baltic Languages
fr: Langues baltes

source: Central and Eastern European
fr: Europe de l'est et centrale

source: Cyrillic Languages
fr: Langues cyrillique

source: Turkish
fr: Turc

source: Portuguese
fr: Portugais

source: Icelandic
fr: Islandais

source: Canadian English/French
fr: Canadien Anglais/Français

source: Arabic
fr: Arabe

source: Danish, Norwegian
fr: Danois, Norvégien

source: Thai
fr: Thaï

source: Vietnamese
fr: Viétnamien

source: Esperanto and Maltese
fr: Espéranto et maltais

source: Nordic Languages
fr: Langues nordiques

source: Celtic Languages
fr: Langues celtiques

source: Russian
fr: Russe

source: Ukrainian
fr: Ukrainien

source: Chinese (PRC)
fr: Chinois (PRC)

source: Chinese (ROC)
fr: Chinois (ROC)

source: Japanese
fr: Japonais

source: Korean
fr: Coréen

source: Current code page (ansi/mbcs)
fr: Code de la page actuelle (ansi/mbcs)

source: Also known as:
fr: Aussi connu comme :

source: The mime type set for a file, when the user has overridden the default value for the file type.
fr: Le type mime donné à un fichier, lorsque l'utilisateur a écrasé la valeur par défaut pour ce type de fichier.

source: The encoding to use for this file, overriding the file system and default encoding. The encoding cannot be changed if there is an encoding comment present in the file; in that case this attribute is ignored and the encoding comment should be changed instead.
fr: L'encodage à utiliser pour ce fichier, outrepassant l'encodage du système de fichiers et celui par défaut. L'encodage ne peut pas être modifié s'il y a un commentaire d'encodage dans le fichier ; dans ce cas cet attribut est ignoré et le commentaire d'encodage doit être modifié à la place.

source: Unknown
fr: Inconnu

source: Invalid line %d
fr: Ligne invalide %d

source: Invalid name on line %d
fr: Nom invalide sur la ligne %d

source: Invalid value on line %d
fr: Valeur invalide sur la ligne %d

source: Could not write to read-only file %s
fr: Impossible d'écrire le fichier %s en lecture seule

source: Unknown value name %s
fr: Nom de valeur inconnu %s

source: Error in %s, line %d
fr: Erreur dans %s, ligne %d

source: Internal data error:
fr: Erreur interne de données :

source: Bad value is:
fr: La mauvaise valeur est :

source: Error::
fr: Erreur::

source: Fatal Error::
fr: Erreur fatale::

source: WARNING
fr: AVERTISSEMENT

source: ERROR
fr: ERREUR
