Repository: wingware-dev/wing7-po-all
Catalog: PO/*/src_proj.po
Languages: fr, ru

source: Whether to show files matching the Hidden and Temporary file filter. When checked, those files are not included in the project. When unchecked, all files in the directory are included in the project. Use the button to alter the Hidden and Temporary file filter in preferences.
ru: Показывать ли файлы, соответствующие скрытому и временному фильтру файлов. Если этот флажок установлен, эти файлы не включаются в проект. Если флажок снят, все файлы в каталоге включаются в проект. Используйте кнопку, чтобы изменить фильтр скрытых и временных файлов в настройках.

source: Check this to watch for changes on disk and update the project view to reflect any changes to files existing on disk. When unchecked, the directory is only scanned once at startup or by right-clicking on the directory and selecting Rescan Directory.
ru: Установите этот флажок, чтобы отслеживать изменения на диске и обновлять представление проекта для отражения любых изменений в файлах, существующих на диске. Если флажок снят, каталог сканируется только один раз при запуске или щелкнув правой кнопкой мыши по каталогу и выбрав команду повторное сканирование каталога.

source: The name of the directory.
fr: Le nom du répertoire.
ru: Имя каталога.

source: Files and directories located within this directory that have been manually removed or excluded from display in the project. Use the Clear Excludes button to remove all excludes for this directory.
ru: Файлы и каталоги, расположенные в этом каталоге, которые были вручную удалены или исключены из отображения в проекте. Используйте кнопку очистить исключения, чтобы удалить все исключения для этого каталога.

source: Add Directory
fr: Ajouter un répertoire
ru: Добавить Каталог

source: Directory Properties
fr: Propriétés du répertoire
ru: Свойства Каталога

source: No Excludes
fr: Pas d'exclusions
ru: Нет исключений

source: Hidden and Temporary files
fr: Fichiers cachés et temporaires
ru: Скрытые и временные файлы

source: Directory
fr: Répertoire
ru: Каталог

source: Include
fr: Inclure
ru: Включить

source: Exclude
fr: Exclure
ru: Исключить

source: Recursive
fr: Récursif
ru: Рекурсивный

source: Watch for external changes
fr: Surveiller les modifications externes
ru: Следите за внешними изменениями

source: Clear Excludes
fr: Effacer les exclusions
ru: Очистить Исключения

source: Immediately clear all exclusions for this directory
fr: Nettoyer immédiatement toutes les exclusions pour ce répertoire
ru: Немедленно очистить все исключения для этого каталога

source: No files or subdirectories excluded
fr: Aucun fichier ou sous-répertoire exclu
ru: Нет исключенных файлов или подкаталогов

source: %s files or subdirectories excluded
fr: %s fichiers ou sous-répertoires exclus
ru: %s исключенные файлы или подкаталоги

source: Remote Inspect Failed
ru: Удаленная проверка не выполнена

source: Could not show file dialog because remote inspect of %s failed
ru: Не удалось отобразить диалоговое окно файла, так как удаленная проверка %s не удалена

source: The following referenced environment variables were undefined:
fr: Les variables d'environnement référencées suivantes étaient indéfinies :
ru: Следующие переменные среды не определены:

source: Invalid Properties
fr: Propriétés invalides
ru: Недопустимые Свойства

source: Some values are invalid:
fr: Certaines valeurs sont invalides :
ru: Некоторые значения недопустимы:

source: Some warnings were also encountered:
fr: Quelques avertissements ont aussi été détectés :
ru: Также были обнаружены некоторые предупреждения:

source: Please correct the values and try again.
fr: Veuillez corriger ces valeurs et essayer à nouveau.
ru: Исправьте значения и повторите попытку.

source: Some property warnings were encountered:
fr: Quelques avertissements de propriétés ont été détectés :
ru: Были обнаружены некоторые предупреждения о свойствах:

source: Properties Warnings
fr: Avertissements des propriétés
ru: Свойства Предупреждений

source: Edit the selected remote host configuration
fr: Éditer le lancement de configuration distant sélectionné
ru: Изменить выбранную конфигурацию удаленного узла

source: Create and use a new remote host configuration
fr: Créer et utiliser une nouvelle configuration d’hôte distant
ru: Создание и использование новой конфигурации удаленного узла

source: Show the remote host configuration manager to add, edit, or delete named remote hosts.
ru: Показать диспетчер конфигурации удаленных узлов для добавления, изменения или удаления именованных удаленных узлов.

source: Create Remote Host Configuration
fr: Créer une configuration d’hôte distant
ru: Создание конфигурации удаленного хоста

source: _Replace the Selected Files
fr: Remplacer le(s) fichier(s) sélectionné(s)

source: Use _Auto-Updating Project
fr: Utiliser l'auto-mise à jour du projet

source: Use _Static Project
fr: Utiliser un projet statique

source: _Add Directory
fr: Ajouter un répertoire

source: _Project Properties
fr: Propriétés du projet

source: _Save Now
fr: Enregistrer maintenant

source: Save _Later
fr: Enregistrer plus tard

source: Add other directories to the project
fr: Ajouter d’autres répertoires au projet

source: Executed:
fr: Exécuté :

source: Output received:
fr: Sortie reçue :

source: Zope2 Instance Home
fr: Instance principale Zope2

source: Zope2 Host (if remote)
fr: Hôte Zope2 (si distant)

source: _Show Documentation
fr: Afficher la documentation

source: Show this dialog when creating projects
fr: Afficher cette boite de dialogue lors de la création de projets

source: Vagrantfile not found in %s
fr: Fichier Vagrant non trouvé dans %s

source: _Retry puttygen
fr: Réessayer puttygen

source: Could Not Convert Key
fr: N'a pas pu convertir la clé

source: Private Key Conversion
fr: Conversion de la clé privée

source: Start puttygen
fr: Lancer puttygen

source: Python _Path
fr: _Chemin Python

source: Zope2 instance directory must be specified when Zope support is enabled
fr: Le répertoire d'instance Zope2 doit être spécifié quand le support Zope est activé

source: Zope2 instance directory '%s' does not exist or is not a directory
fr: Le répertoire d'instance Zope 2 '%s' n'existe pas ou n'est pas un répertoire

source: Zope2 installation directory could not be read from ZOPEINST/etc/zope.conf or does not exist -- using '%s'
fr: Le répertroire d'installation Zope2 ne peut pas être lu depuis ZOPEINST/etc/zope.conf ou n'existe pas -- utilise '%s'

source: Zope2 home directory '%s' (obtained from etc/zope.conf in Zope Instance) does not exist or is not a directory
fr: Le répertoire principal '%s' Zope2 (obtenu depuis etc/zope.conf dans l'instance Zope) n'existe pas ou n'est pas un répertoire

source: Zope2 home directory '%s' (obtained from etc/zope.conf in the Zope Instance) appears invalid -- missing expected directories and files
fr: Le répertoire principal '%s' Zope2 (obtenu depuis etc/zope.conf dans l'instance Zope) apparaît invalide -- il manque les répertoires et fichier attendus

source: Enable Zope2/Plone Support
fr: Activer le support Zope2/Plone

source: _Reload Now
fr: Recharger maintenant

source: Do _Not Reload
fr: Ne pas recharger

source: _Cancel Encoding Change
fr: Annuler le changement d'encodage

source: Debug Environment: %s
fr: Environnement de débogage : %s
